<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  
  <meta name="description" content="阿尔托利亚是我老婆~" />
  

  
  
  
  
  
  
  <title>让你的代码成为代码中的高富帅 | SaberDa的幻想乡</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x6240;&amp;#x6709;&amp;#x7684;&amp;#x4EE3;&amp;#x7801;&amp;#x2014;&amp;#x4E0D;&amp;#x8BBA;&amp;#x662F;&amp;#x4E00;&amp;#x4E2A;&amp;#x4EBA;&amp;#x4E0D;&amp;#x540C;&amp;#x65F6;&amp;#x671F;&amp;#x5199;&amp;#x7684;&amp;#x4EE3;&amp;#x7801;&amp;#xFF0C;&amp;#x8FD8;&amp;#x662F;&amp;#x4E00;&amp;#x4E2A">
<meta property="og:type" content="article">
<meta property="og:title" content="让你的代码成为代码中的高富帅">
<meta property="og:url" content="https://saberda.github.io/2016/06/27/让你的代码成为代码中的高富帅/index.html">
<meta property="og:site_name" content="SaberDa的幻想乡">
<meta property="og:description" content="&amp;#x6240;&amp;#x6709;&amp;#x7684;&amp;#x4EE3;&amp;#x7801;&amp;#x2014;&amp;#x4E0D;&amp;#x8BBA;&amp;#x662F;&amp;#x4E00;&amp;#x4E2A;&amp;#x4EBA;&amp;#x4E0D;&amp;#x540C;&amp;#x65F6;&amp;#x671F;&amp;#x5199;&amp;#x7684;&amp;#x4EE3;&amp;#x7801;&amp;#xFF0C;&amp;#x8FD8;&amp;#x662F;&amp;#x4E00;&amp;#x4E2A">
<meta property="og:updated_time" content="2016-09-29T09:51:03.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="让你的代码成为代码中的高富帅">
<meta name="twitter:description" content="&amp;#x6240;&amp;#x6709;&amp;#x7684;&amp;#x4EE3;&amp;#x7801;&amp;#x2014;&amp;#x4E0D;&amp;#x8BBA;&amp;#x662F;&amp;#x4E00;&amp;#x4E2A;&amp;#x4EBA;&amp;#x4E0D;&amp;#x540C;&amp;#x65F6;&amp;#x671F;&amp;#x5199;&amp;#x7684;&amp;#x4EE3;&amp;#x7801;&amp;#xFF0C;&amp;#x8FD8;&amp;#x662F;&amp;#x4E00;&amp;#x4E2A">
  
  
    <link rel="icon" href="/css/images/favicon.ico">
  
  <link rel="stylesheet" href="/css/style.css">
  

  
  <!-- baidu webmaster push -->
  <script src='//push.zhanzhang.baidu.com/push.js'></script>
</head>
<body class="home blog custom-background custom-font-enabled single-author">
  <div id="page" class="hfeed site">
      <header id="masthead" class="site-header" role="banner">
    <hgroup>
      <h1 class="site-title">
        <a href="/" title="SaberDa的幻想乡" rel="home">SaberDa的幻想乡</a>
      </h1>
      
        <h2 class="site-description">
          <a href="/" id="subtitle">　　iOS　　|　　二次元　　|　　630991493@qq.com　　|　　生而骄傲 何须放纵</a>
        </h2>
      
    </hgroup>

    <nav id="site-navigation" class="main-navigation" role="navigation">
            <button class="menu-toggle">菜单</button>
            <a class="assistive-text" href="/#content" title="跳至内容">跳至内容</a><!--TODO-->
            <div class="menu-main-container">
                <ul id="menu-main" class="nav-menu">
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/archives">所有文章</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/">主页</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/编程/">编程</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/iOS/">iOS</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/Machine Learning/">Machine Learning</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/MAC/">MAC</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/御宅文化/">御宅文化</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/LIFE/">LIFE</a></li>
                
                </ul>
            </div>
    </nav>
</header>
      <div id="main" class="wrapper">
        <div id="primary" class="site-content"><div id="content" role="main"><article id="post-让你的代码成为代码中的高富帅" class="post-让你的代码成为代码中的高富帅 post type-post status-publish format-standard hentry">
    <!---->

      <header class="entry-header">
        
        
  
    <h1 class="entry-title article-title">
      让你的代码成为代码中的高富帅
    </h1>
  

        
        <div class="comments-link">
            
            <a href="javascript:void(0);" data-url="https://saberda.github.io/2016/06/27/让你的代码成为代码中的高富帅/" data-id="ciw65xiw6006vvvhbaaz152ln" class="leave-reply bdsharebuttonbox" data-cmd="more">Share</a>
        </div><!-- .comments-link -->
      </header><!-- .entry-header -->

    <div class="entry-content">
      
        <hr>
<h2 id="&#x6240;&#x6709;&#x7684;&#x4EE3;&#x7801;&#x2014;&#x4E0D;&#x8BBA;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x4E0D;&#x540C;&#x65F6;&#x671F;&#x5199;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x8FD8;&#x662F;&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x4E0D;&#x540C;&#x7684;&#x6210;&#x5458;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x2014;&#x90FD;&#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x81F4;&#x7684;&#x3001;&#x4F18;&#x96C5;&#x7684;&#x3002;"><a href="#&#x6240;&#x6709;&#x7684;&#x4EE3;&#x7801;&#x2014;&#x4E0D;&#x8BBA;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x4E0D;&#x540C;&#x65F6;&#x671F;&#x5199;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x8FD8;&#x662F;&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x4E0D;&#x540C;&#x7684;&#x6210;&#x5458;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x2014;&#x90FD;&#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x81F4;&#x7684;&#x3001;&#x4F18;&#x96C5;&#x7684;&#x3002;" class="headerlink" title="&#x6240;&#x6709;&#x7684;&#x4EE3;&#x7801;&#x2014;&#x4E0D;&#x8BBA;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x4E0D;&#x540C;&#x65F6;&#x671F;&#x5199;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x8FD8;&#x662F;&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x4E0D;&#x540C;&#x7684;&#x6210;&#x5458;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x2014;&#x90FD;&#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x81F4;&#x7684;&#x3001;&#x4F18;&#x96C5;&#x7684;&#x3002;"></a>&#x6240;&#x6709;&#x7684;&#x4EE3;&#x7801;&#x2014;&#x4E0D;&#x8BBA;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x4E0D;&#x540C;&#x65F6;&#x671F;&#x5199;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x8FD8;&#x662F;&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x4E0D;&#x540C;&#x7684;&#x6210;&#x5458;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x2014;&#x90FD;&#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x81F4;&#x7684;&#x3001;&#x4F18;&#x96C5;&#x7684;&#x3002;</h2><a id="more"></a>
<p>&#x8BA9;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x53D8;&#x7684;&#x4F18;&#x7F8E;&#x3002;&#x5C31;&#x662F;&#x8BA9;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x683C;&#x5F0F;&#x5316;</p>
<p>&#x6CE8;&#xFF1A;&#x6B64;&#x683C;&#x5F0F;&#x5316;&#x975E;&#x5F7C;&#x683C;&#x5F0F;&#x5316;</p>
<hr>
<h2 id="&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x683C;&#x5F0F;&#x5316;"><a href="#&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x683C;&#x5F0F;&#x5316;" class="headerlink" title="&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x683C;&#x5F0F;&#x5316;"></a>&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x683C;&#x5F0F;&#x5316;</h2><p>&#x4EE3;&#x7801;&#x7684;&#x683C;&#x5F0F;&#x5316;&#x76F4;&#x63A5;&#x5F71;&#x54CD;&#x5230;&#x300C;&#x4F7F;&#x7528;&#x4EE3;&#x7801;&#x6C9F;&#x901A;&#x300D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x300C;&#x4F7F;&#x7528;&#x4EE3;&#x7801;&#x6C9F;&#x901A;&#x300D;&#x662F;&#x4E00;&#x4E2A;&#x4E13;&#x4E1A;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x7B2C;&#x4E00;&#x8981;&#x52A1;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x300C;&#x53EA;&#x8981;&#x80FD;&#x8BA9;&#x4EE3;&#x7801;&#x80FD;&#x8FD0;&#x884C;&#x8D77;&#x6765;&#x5C31;&#x884C;&#x300D;&#x3002;</p>
<p>&#x4F60;&#x4ECA;&#x5929;&#x5199;&#x7684;&#x529F;&#x80FD;&#x53EF;&#x80FD;&#x4E0D;&#x4E45;&#x4E4B;&#x540E;&#x5C31;&#x4F1A;&#x9700;&#x8981;&#x88AB;&#x66F4;&#x6539;&#xFF0C;&#x4F46;&#x662F;&#x4EE3;&#x7801;&#x7684;&#x300C;&#x53EF;&#x8BFB;&#x6027;&#x300D;&#x5C06;&#x4F1A;&#x5BF9;&#x300C;&#x672A;&#x6765;&#x4EE3;&#x7801;&#x7684;&#x4FEE;&#x6539;&#x6216;&#x91CD;&#x6784;&#x300D;&#x4EA7;&#x751F;&#x6DF1;&#x8FDC;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
<hr>
<p>&#x63A5;&#x4E0B;&#x6765;&#x662F;&#x4E00;&#x4E9B;&#x5BF9;&#x300C;&#x4F7F;&#x7528;&#x4EE3;&#x7801;&#x6C9F;&#x901A;&#x300D;&#x80FD;&#x529B;&#x6709;&#x5F71;&#x54CD;&#x7684;&#x65B9;&#x9762;&#xFF1A;</p>
<hr>
<h2 id="&#x53D8;&#x91CF;&#x7684;&#x5B9A;&#x4E49;"><a href="#&#x53D8;&#x91CF;&#x7684;&#x5B9A;&#x4E49;" class="headerlink" title="&#x53D8;&#x91CF;&#x7684;&#x5B9A;&#x4E49;"></a>&#x53D8;&#x91CF;&#x7684;&#x5B9A;&#x4E49;</h2><pre><code>&#x5E94;&#x8BE5;&#x5C3D;&#x91CF;&#x9760;&#x8FD1;&#x5B83;&#x88AB;&#x4F7F;&#x7528;&#x7684;&#x5730;&#x65B9;&#x3002;
</code></pre><p>1.&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;</p>
<p>(&#x7C7B;&#x7684;&#x52A8;&#x6001;&#x53D8;&#x91CF;&#xFF09;&#x5E94;&#x8BE5;&#x88AB;&#x5B9A;&#x4E49;&#x5728;&#x7C7B;&#x7684;&#x8D77;&#x59CB;&#x3002;</p>
<p>&#x4E0D;&#x8BBA;&#x662F;&#x9075;&#x5FAA;&#x300C;&#x526A;&#x5200;&#x539F;&#x5219;&#x300D;&#xFF0C;&#x5C06;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x5B9A;&#x4E49;&#x5728;&#x7C7B;&#x7684;&#x6700;&#x4F4E;&#x7AEF;&#xFF0C;&#x8FD8;&#x662F;&#x6839;&#x636E;Java&#x7684;&#x60EF;&#x4F8B;&#xFF0C;&#x5C06;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x5B9A;&#x4E49;&#x5728;&#x7C7B;&#x7684;&#x6700;&#x9876;&#x7AEF;&#xFF0C;&#x90FD;&#x662F;&#x597D;&#x7684;&#x3002;&#x4F46;&#x8BF7;&#x4E0D;&#x8981;&#x628A;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x653E;&#x5728;&#x9664;&#x4E86;&#x8FD9;&#x4E24;&#x79CD;&#x4E4B;&#x5916;&#x7684;&#x5176;&#x4ED6;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>2.&#x6709;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x7684;&#x51FD;&#x6570;</p>
<p>&#x5E94;&#x8BE5;&#x5728;&#x5782;&#x76F4;&#x7684;&#x8DDD;&#x79BB;&#x4E0A;&#x5C3D;&#x91CF;&#x9760;&#x8FD1;&#xFF0C;&#x800C;&#x4E14;&#x5F80;&#x5F80;&#x8C03;&#x7528;&#x8005;&#x5E94;&#x8BE5;&#x5728;&#x88AB;&#x8C03;&#x7528;&#x8005;&#x7684;&#x4E0A;&#x8FB9;&#xFF08;&#x5982;&#x679C;&#x53EF;&#x80FD;&#x7684;&#x8BDD;&#xFF09;&#x3002;</p>
<p>3.&#x6982;&#x5FF5;&#x4E0A;&#x5173;&#x7CFB;&#x8F83;&#x5BC6;&#x5207;&#x7684;&#x4EE3;&#x7801;</p>
<p>&#x5E94;&#x8BE5;&#x6839;&#x636E;&#x4ED6;&#x4EEC;&#x5173;&#x7CFB;&#x7684;&#x5BC6;&#x5207;&#x7A0B;&#x5EA6;&#x6765;&#x9009;&#x62E9;&#x4ED6;&#x4EEC;&#x95F4;&#x7684;&#x8DDD;&#x79BB;</p>
<h2 id="&#x5782;&#x76F4;&#x65B9;&#x5411;&#x4E0A;&#x7684;&#x683C;&#x5F0F;&#x5316;"><a href="#&#x5782;&#x76F4;&#x65B9;&#x5411;&#x4E0A;&#x7684;&#x683C;&#x5F0F;&#x5316;" class="headerlink" title="&#x5782;&#x76F4;&#x65B9;&#x5411;&#x4E0A;&#x7684;&#x683C;&#x5F0F;&#x5316;"></a>&#x5782;&#x76F4;&#x65B9;&#x5411;&#x4E0A;&#x7684;&#x683C;&#x5F0F;&#x5316;</h2><pre><code>&#x5782;&#x76F4;&#x65B9;&#x5411;&#x4E0A;&#x7684;&#x683C;&#x5F0F;&#x5316;&#x7B80;&#x5355;&#x8BF4;&#x5C31;&#x662F;&#x4EE3;&#x7801;&#x7684;&#x957F;&#x5EA6;&#x3002;
</code></pre><p>&#x6211;&#x4EEC;&#x5728;&#x5F00;&#x53D1;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x5E94;&#x8BE5;&#x5C3D;&#x91CF;&#x53BB;&#x8FFD;&#x6C42;&#x5199;&#x51FA;&#x8F83;&#x5C0F;&#x7684;&#x4EE3;&#x7801;&#x6E90;&#x6587;&#x4EF6;&#xFF0C;&#x7B14;&#x8005;&#x7ED9;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x53C2;&#x8003;&#x503C;&#x662F;&#xFF1A;<em>&#x300C;&#x5927;&#x591A;&#x6570;&#x7684;&#x6587;&#x4EF6;&#x5E94;&#x8BE5;&#x90FD;&#x5C0F;&#x4E8E;200&#x884C;&#xFF0C;&#x6700;&#x957F;&#x7684;&#x6587;&#x4EF6;&#x6700;&#x597D;&#x8981;&#x5C0F;&#x4E8E;500&#x884C;&#x300D;</em>&#x3002;&#x4F46;&#x662F;&#x7B14;&#x8005;&#x4E5F;&#x8BF4;&#x8FD9;&#x6761;&#x89C4;&#x5219;&#x4E0D;&#x5E94;&#x8BE5;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x786C;&#x6027;&#x7684;&#x6807;&#x51C6;&#xFF0C;&#x800C;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x65AD;&#x8FFD;&#x6C42;&#x7684;&#x5883;&#x754C;&#x3002;&#x6BD5;&#x7ADF;&#x6709;&#x65F6;&#x6211;&#x4EEC;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5730;&#x5FC5;&#x987B;&#x5199;&#x51FA;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x957F;&#x7684;&#x6E90;&#x6587;&#x4EF6;&#x3002;</p>
<p>1.&#x62A5;&#x7EB8;&#x7684;&#x6BD4;&#x55BB;</p>
<p>&#x4E00;&#x4E2A;&#x6E90;&#x6587;&#x4EF6;&#x8BFB;&#x8D77;&#x6765;&#x5E94;&#x8BE5;&#x50CF;&#x62A5;&#x7EB8;&#x91CC;&#x7684;&#x6587;&#x7AE0;&#x4E00;&#x6837;&#xFF0C;<em>&#x540D;&#x5B57;</em> &#x5E94;&#x8BE5;&#x7B80;&#x77ED;&#x4F46;&#x80FD;&#x8868;&#x8FBE;&#x6587;&#x7AE0;&#x7684;&#x57FA;&#x672C;&#x610F;&#x601D;&#xFF0C;&#x6E90;&#x6587;&#x4EF6; <em>&#x521A;&#x5F00;&#x59CB;&#x7684;&#x90E8;&#x5206;</em> &#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x63D0;&#x4F9B;&#x4E00;&#x4E9B;&#x9AD8;&#x5C42;&#x7684;&#x62BD;&#x8C61;&#x548C;&#x7B97;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x5177;&#x4F53;&#x7684;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x5728; <em>&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x7AE0;&#x8282;</em> &#x4E2D;&#x4F9D;&#x6B21;&#x5C55;&#x5F00;&#xFF0C;&#x76F4;&#x5230;&#x6E90;&#x6587;&#x4EF6;&#x7684;&#x6700;&#x540E;&#xFF0C;&#x5728;&#x90A3;&#x91CC;&#x6211;&#x4EEC;&#x80FD;&#x627E;&#x5230;&#x6700;&#x4F4E;&#x7B49;&#x7EA7;&#x7684;&#x51FD;&#x6570;&#x548C;&#x6700;&#x7EC6;&#x8282;&#x7684;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x4E00;&#x5F20;&#x62A5;&#x7EB8;&#xFF08;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#xFF09;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x6587;&#x7AE0;&#xFF08;&#x6E90;&#x6587;&#x4EF6;&#xFF09;&#x7EC4;&#x6210;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x90FD;&#x5F88;&#x77ED;&#xFF0C;&#x5076;&#x5C14;&#x6709;&#x4E00;&#x4E9B;&#x7A0D;&#x5FAE;&#x6709;&#x4E9B;&#x957F;&#xFF0C;&#x6781;&#x5C11;&#x6570;&#x7684;&#x60C5;&#x51B5;&#x4E5F;&#x4F1A;&#x51FA;&#x73B0;&#x5360;&#x636E;&#x6574;&#x4E2A;&#x9875;&#x9762;&#x7684;&#x957F;&#x5EA6;&#x7684;&#x6587;&#x7AE0;&#x3002;</p>
<p>2.&#x4E0D;&#x540C;&#x6982;&#x5FF5;&#x4E4B;&#x95F4;&#x7684;&#x5782;&#x76F4;&#x95F4;&#x9694;</p>
<p>&#x5728;&#x6E90;&#x6587;&#x4EF6;&#x4E2D;&#x4E0D;&#x540C;&#x7684;&#x6982;&#x5FF5;&#xFF08;&#x5F80;&#x5F80;&#x6307;&#x7684;&#x662F;&#x51FD;&#x6570;&#xFF09;&#x4E4B;&#x95F4;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x7A7A;&#x884C;&#x6765;&#x9694;&#x5F00;&#xFF0C;&#x8FD9;&#x6837;&#x5728;&#x8BFB;&#x8005;&#x9605;&#x8BFB;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x65F6;&#x4F1A;&#x975E;&#x5E38;&#x8212;&#x670D;&#x3002;</p>
<p>3.&#x5782;&#x76F4;&#x805A;&#x96C6;</p>
<p>&#x4E0E;&#x4E0A;&#x4E00;&#x6761;&#x4E2D;&#x9610;&#x8FF0;&#x7684;&#x5185;&#x5BB9;&#x521A;&#x521A;&#x76F8;&#x53CD;&#xFF0C;&#x76F8;&#x4F3C;&#x6216;&#x8005;&#x76F8;&#x5173;&#x6027;&#x8F83;&#x5F3A;&#x7684;&#x6982;&#x5FF5;&#x4E4B;&#x95F4;&#x5F80;&#x5F80;&#x4E0D;&#x5E94;&#x8BE5;&#x6709;&#x5206;&#x9694;&#xFF08;&#x5F80;&#x5F80;&#x662F;&#x6CE8;&#x91CA;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x65E0;&#x610F;&#x4E49;&#x7684;&#x7A7A;&#x884C;&#xFF09;&#xFF0C;&#x800C;&#x5E94;&#x8BE5;&#x805A;&#x96C6;&#x5728;&#x4E00;&#x8D77;&#x3002;</p>
<p>4.&#x5782;&#x76F4;&#x8DDD;&#x79BB;</p>
<p>&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x4F1A;&#x78B0;&#x5230;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x4EEC;&#x9605;&#x8BFB;&#x4EE3;&#x7801;&#x65F6;&#x8FF7;&#x5931;&#x5728;&#x4E86;&#x5BFB;&#x627E;&#x300C;&#x53D8;&#x91CF;&#x4E0E;&#x53D8;&#x91CF;&#x95F4;&#x3001;&#x51FD;&#x6570;&#x4E0E;&#x51FD;&#x6570;&#x95F4;&#x3001;&#x7C7B;&#x4E0E;&#x7C7B;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x300D;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x80FD;&#x81EA;&#x62D4;&#xFF0C;&#x5927;&#x91CF;&#x7684;&#x65F6;&#x95F4;&#x82B1;&#x5728;&#x4E86;&#x5BFB;&#x627E;&#x300C;&#x90A3;&#x6BB5;&#x4EE3;&#x7801;&#x5728;&#x54EA;&#x91CC;&#x300D;&#x3002;</p>
<p>&#x76F8;&#x8FD1;&#x7684;&#x6982;&#x5FF5;&#x5E94;&#x8BE5;&#x5728;&#x5782;&#x76F4;&#x8DDD;&#x79BB;&#x4E0A;&#x5C3D;&#x91CF;&#x63A5;&#x8FD1;&#xFF0C;&#x76F8;&#x4F3C;&#x7684;&#x6982;&#x5FF5;&#x5E94;&#x8BE5;&#x5C3D;&#x91CF;&#x5B58;&#x5728;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF08;&#x9664;&#x975E;&#x4F60;&#x6709;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x539F;&#x56E0;&#x4E0D;&#x53BB;&#x8FD9;&#x4E48;&#x505A;&#xFF09;&#xFF0C;protected&#x7684;&#x53D8;&#x91CF;&#x5E94;&#x8BE5;&#x88AB;&#x7981;&#x6B62;&#x4F7F;&#x7528;&#xFF08;&#x8FD9;&#x6761;&#x53EF;&#x80FD;&#x5728;&#x67D0;&#x4E9B;&#x8BED;&#x8A00;&#x91CC;&#x4E0D;&#x5B58;&#x5728;&#xFF09;&#x3002;</p>
<p>5.&#x5782;&#x76F4;&#x6392;&#x5E8F;</p>
<p>&#x5782;&#x76F4;&#x5750;&#x6807;&#x4E0A;&#x7684;&#x5143;&#x7D20;&#xFF08;&#x53EF;&#x80FD;&#x662F;&#x4EE3;&#x7801;&#x5757;&#xFF0C;&#x51FD;&#x6570;&#xFF0C;&#x53D8;&#x91CF;&#x7B49;&#xFF09;&#x5E94;&#x8BE5;&#x6309;&#x7167;&#x81EA;&#x4E0A;&#x800C;&#x4E0B;&#x7684;&#x9605;&#x8BFB;&#x987A;&#x5E8F;&#x8FDB;&#x884C;&#x6392;&#x5217;&#xFF0C;&#x8FD9;&#x6837;&#x66F4;&#x6613;&#x4E8E;&#x9605;&#x8BFB;&#x3002;</p>
<h2 id="&#x6C34;&#x5E73;&#x65B9;&#x5411;&#x4E0A;&#x7684;&#x683C;&#x5F0F;&#x5316;"><a href="#&#x6C34;&#x5E73;&#x65B9;&#x5411;&#x4E0A;&#x7684;&#x683C;&#x5F0F;&#x5316;" class="headerlink" title="&#x6C34;&#x5E73;&#x65B9;&#x5411;&#x4E0A;&#x7684;&#x683C;&#x5F0F;&#x5316;"></a>&#x6C34;&#x5E73;&#x65B9;&#x5411;&#x4E0A;&#x7684;&#x683C;&#x5F0F;&#x5316;</h2><pre><code>&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x5178;&#x578B;&#x7684;&#x5E94;&#x7528;&#xFF08;Junit, FitNesse, testNG, Time and Money, JDepend, Ant, Tomcat&#xFF09;&#x7684;&#x884C;&#x7684;&#x5BBD;&#x5EA6;&#x8FDB;&#x884C;&#x4E86;&#x7EDF;&#x8BA1;&#xFF0C;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x7684;&#x5BBD;&#x5EA6;&#x90FD;&#x5728;60&#x4E2A;&#x5B57;&#x7B26;&#x4EE5;&#x4E0B;&#xFF0C;&#x5927;&#x4E8E;80&#x4E2A;&#x5B57;&#x7B26;&#x4EE5;&#x4E0A;&#x5BBD;&#x5EA6;&#x7684;&#x5360;&#x6BD4;&#x975E;&#x5E38;&#x5C0F;&#x3002;&#x901A;&#x5E38;&#x7684;&#x8BF4;&#xFF0C;&#x4EE3;&#x7801;&#x7684;&#x884C;&#x5BBD;&#x5E94;&#x8BE5;&#x5C0F;&#x4E8E;100&#x6216;120&#x3002;
</code></pre><p>1.&#x6C34;&#x5E73;&#x7684;&#x95F4;&#x9694;&#x548C;&#x805A;&#x96C6;</p>
<pre><code>//&#x4EE3;&#x7801;4-1 
private void measureLine(String line) { 
lineCount++; int lineSizeline.length();
totalChars+=lineSize;
lineWidthHistogram.addLine(lineSize, lineCount); 
recordWidestLine(lineSize); 
}
</code></pre><p>&#x5728;&#x6C34;&#x5E73;&#x65B9;&#x5411;&#x4E0A;&#xFF0C;&#x4F5C;&#x8005;&#x4E3B;&#x5F20;&#x5728;&#x5F3A;&#x76F8;&#x5173;&#x7684;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x4E0D;&#x4F7F;&#x7528;&#x7A7A;&#x683C;&#xFF0C;&#x800C;&#x5728;&#x5F31;&#x76F8;&#x5173;&#x7684;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x6DFB;&#x52A0;&#x7A7A;&#x683C;&#x6765;&#x4E88;&#x4EE5;&#x533A;&#x5206;&#xFF0C;&#x6BD4;&#x5982;&#x4EE3;&#x7801;4-1&#x3002;</p>
<pre><code>- &#x8D4B;&#x503C;&#x8BED;&#x53E5;&#x7684;&#x5DE6;&#x53F3;&#x662F;&#x4E24;&#x4E2A;&#x533A;&#x522B;&#x5F88;&#x5927;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x90A3;&#x4E48;&#x4F7F;&#x7528;&#x7A7A;&#x683C;&#x6765;&#x7A81;&#x51FA;&#x8D4B;&#x503C;&#x64CD;&#x4F5C;&#x7B26;&#xFF08;&#x5C31;&#x662F;= &#xFF09;&#x5E76;&#x5BF9;&#x8D4B;&#x503C;&#x8BED;&#x53E5;&#x7684;&#x5DE6;&#x53F3;&#x4E24;&#x90E8;&#x5206;&#x52A0;&#x4EE5;&#x533A;&#x5206;&#x3002;
- &#x51FD;&#x6570;&#x540D;&#x548C;&#x5DE6;&#x62EC;&#x53F7;&#x4E4B;&#x95F4;&#x662F;&#x5341;&#x5206;&#x76F8;&#x5173;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x4E0D;&#x4F7F;&#x7528;&#x7A7A;&#x683C;
- &#x53C2;&#x6570;&#x4E4B;&#x95F4;&#x7684;&#x9017;&#x53F7;&#x5206;&#x9694;&#x7B26;&#x4E4B;&#x540E;&#x4F7F;&#x7528;&#x7A7A;&#x683C;&#xFF0C;&#x7528;&#x4EE5;&#x7A81;&#x51FA;&#x5206;&#x9694;&#x7B26;&#x5E76;&#x533A;&#x5206;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x53C2;&#x6570;&#x3002;
</code></pre><p>2.&#x6C34;&#x5E73;&#x5BF9;&#x9F50;</p>
<p>&#x6709;&#x4E9B;&#x4EBA;&#x559C;&#x6B22;&#x5728;&#x6709;&#x4E00;&#x5806;&#x7684;&#x53D8;&#x91CF;&#x5B9A;&#x4E49;&#x6216;&#x8D4B;&#x503C;&#x8BED;&#x53E5;&#x65F6;&#xFF0C;&#x4F7F;&#x7528;&#x5BF9;&#x9F50;&#x6765;&#x4F7F;&#x4EE3;&#x7801;&#x53D8;&#x5F97;&#x66F4;&#x6613;&#x8BFB;&#xFF0C;&#x4F46;&#x8FD9;&#x6837;&#x662F;&#x6CA1;&#x6709;&#x7528;&#x7684;&#x3002;&#x4F7F;&#x7528;&#x8FD9;&#x6837;&#x7684;&#x5BF9;&#x9F50;&#x4F1A;&#x55A7;&#x5BBE;&#x593A;&#x4E3B;&#xFF0C;&#x628A;&#x4EE3;&#x7801;&#x9605;&#x8BFB;&#x8005;&#x7684;&#x9605;&#x8BFB;&#x91CD;&#x5FC3;&#x5438;&#x5F15;&#x5230;&#x4E86;&#x9519;&#x8BEF;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x51FA;&#x73B0;&#x4E86; <em>&#x5F88;&#x957F;&#x7684;&#x53D8;&#x91CF;&#x5B9A;&#x4E49;&#x6216;&#x8D4B;&#x503C;&#x8BED;&#x53E5;&#x5217;&#x8868;</em> &#xFF0C;&#x957F;&#x5230;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x5DE6;&#x5BF9;&#x9F50;&#x6765;&#x4F7F;&#x5B83;&#x4EEC;&#x66F4;&#x6613;&#x8BFB;&#xFF0C;&#x90A3;&#x4E48;&#x4E3B;&#x8981;&#x95EE;&#x9898;&#x5E94;&#x8BE5;&#x662F;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x4E2D; <em>&#x4E0D;&#x5E94;&#x8BE5;&#x51FA;&#x73B0;&#x8FD9;&#x4E48;&#x957F;&#x7684;&#x53D8;&#x91CF;&#x5B9A;&#x4E49;&#x6216;&#x8D4B;&#x503C;&#x5217;&#x8868;</em> &#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7F3A;&#x5C11;&#x4E86;&#x5DE6;&#x5BF9;&#x9F50;&#x3002;</p>
<p>3.&#x7F29;&#x8FDB;</p>
<p>&#x6E90;&#x6587;&#x4EF6;&#x91CC;&#x7684;&#x5185;&#x5BB9;&#x4E0E;&#x5176;&#x8BF4;&#x662F;&#x300C;&#x63D0;&#x7EB2;&#x548C;&#x5185;&#x5BB9;&#x300D;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x4E0D;&#x5982;&#x8BF4;&#x662F;&#x300C;&#x5C42;&#x7EA7;&#x300D;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x8981;&#x4F20;&#x8FBE;&#x7684;&#x4FE1;&#x606F;&#x4E4B;&#x95F4;&#x7684;&#x4ECE;&#x5C5E;&#x5173;&#x7CFB;&#x4ECE;&#x6587;&#x4EF6;&#x5230;&#x7C7B;&#x3001;&#x7C7B;&#x5230;&#x65B9;&#x6CD5;&#x3001;&#x65B9;&#x6CD5;&#x5230;&#x4EE3;&#x7801;&#x5757;&#x3001;&#x4EE3;&#x7801;&#x5757;&#x5230;&#x5B50;&#x4EE3;&#x7801;&#x5757;&#xFF0C;&#x9010;&#x7EA7;&#x5F80;&#x4E0B;&#xFF0C;&#x4E3A;&#x4E86;&#x533A;&#x5206;&#x8FD9;&#x79CD;&#x5C42;&#x7EA7;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x975E;&#x5E38;&#x559C;&#x6B22;&#x4F7F;&#x7528;&#x4EE3;&#x7801;&#x7684;&#x7F29;&#x8FDB;&#x6765;&#x4F7F;&#x4EE3;&#x7801;&#x66F4;&#x52A0;&#x6613;&#x8BFB;&#x3002;</p>
<hr>
<p>&#x7F29;&#x8FDB; &#x662F;&#x4EE3;&#x7801;&#x8D28;&#x91CF;&#x7BA1;&#x7406;&#x91CC;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x73AF;&#xFF0C;&#x6211;&#x4E2A;&#x4EBA;&#x6BD4;&#x8F83;&#x559C;&#x6B22;&#x4F7F;&#x7528;&#x5236;&#x8868;&#x7B26;&#xFF08;TAB&#xFF0C;&#x5F80;&#x5F80;&#x662F;4&#x4E2A;&#x7A7A;&#x683C;&#xFF09;&#x6765;&#x6807;&#x8BC6;&#x7F29;&#x8FDB;&#xFF0C;&#x7136;&#x800C;&#x6211;&#x6709;&#x4E2A;&#x540C;&#x5B66;&#x5C31;&#x7279;&#x522B;&#x559C;&#x6B22;&#x4F7F;&#x7528;2&#x4E2A;&#x7A7A;&#x683C;&#x6765;&#x8868;&#x793A;&#x7F29;&#x8FDB;&#xFF0C;&#x8FD9;&#x79CD;&#x4E8B;&#x60C5;&#x4EC1;&#x8005;&#x89C1;&#x4EC1;&#x667A;&#x8005;&#x89C1;&#x667A;&#x3002;</p>
<hr>
<p>&#x4E0D;&#x8981;&#x7834;&#x574F;&#x7F29;&#x8FDB;(breaking indentation)&#x3002;&#x8C28;&#x8BB0;&#x4E00;&#x5B9A;&#x8981;&#x4F7F;&#x7528;&#x7F29;&#x8FDB;&#x3002;<br>&#x6709;&#x65F6;&#x5019;&#x4E00;&#x4E2A;if&#x8BED;&#x53E5;&#x6216;&#x8005;for&#x5FAA;&#x73AF;&#x4EE3;&#x7801;&#x5757;&#x6216;&#x8005;&#x51FD;&#x6570;&#x975E;&#x5E38;&#x5C0F;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x4F1A;&#x89C9;&#x5F97;&#x4E0D;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7F29;&#x8FDB;&#xFF0C;&#x800C;&#x628A;&#x5927;&#x62EC;&#x53F7;&#xFF0C;&#x6267;&#x884C;&#x8BED;&#x53E5;&#x7B49;&#x90FD;&#x5199;&#x5728;&#x540C;&#x4E00;&#x884C;,&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x770B;&#x5FC3;&#x60C5;&#x5427;&#x3002;</p>
<p>4.&#x7A7A;&#x8BED;&#x53E5;</p>
<p>&#x6211;&#x4E2A;&#x4EBA;&#x975E;&#x5E38;&#x4E0D;&#x559C;&#x6B22;&#x7A7A;&#x8BED;&#x53E5;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x662F;&#x4F1A;&#x5C3D;&#x529B;&#x907F;&#x514D;&#x4F7F;&#x7528;&#x7A7A;&#x8BED;&#x53E5;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4E0D;&#x5F97;&#x4E0D;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x4E5F;&#x4E00;&#x5B9A;&#x4F1A;&#x52A0;&#x4E0A;&#x5927;&#x62EC;&#x53F7;&#x5E76;&#x4E14;&#x4F7F;&#x7528;&#x7F29;&#x8FDB;&#x6765;&#x8BA9;&#x4EE3;&#x7801;&#x66F4;&#x6613;&#x8BFB;&#x3002;</p>
<h2 id="&#x56E2;&#x961F;&#x89C4;&#x5219;&#xFF08;Team-Rules&#xFF09;"><a href="#&#x56E2;&#x961F;&#x89C4;&#x5219;&#xFF08;Team-Rules&#xFF09;" class="headerlink" title="&#x56E2;&#x961F;&#x89C4;&#x5219;&#xFF08;Team Rules&#xFF09;"></a>&#x56E2;&#x961F;&#x89C4;&#x5219;&#xFF08;Team Rules&#xFF09;</h2><pre><code>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x662F;&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x534F;&#x540C;&#x5F00;&#x53D1;&#xFF0C;&#x90A3;&#x4E48;&#x56E2;&#x961F;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x8981;&#x9075;&#x5FAA;&#x8FD9;&#x4E2A;&#x56E2;&#x961F;&#x5B9A;&#x4E0B;&#x6765;&#x7684;&#x683C;&#x5F0F;&#x5316;&#x8981;&#x6C42;&#xFF0C;&#x6765;&#x4FDD;&#x8BC1;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x4E2D;&#x7684;&#x683C;&#x5F0F;&#x662F;&#x987A;&#x6ED1;&#x7684;&#x3001;&#x4E00;&#x81F4;&#x7684;&#x3002;
</code></pre><p>Ps&#xFF1A;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x90FD;&#x4E0D;&#x8981;&#x5FD8;&#x8BB0;&#x7ED9;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x8865;&#x4E0A;&#x6CE8;&#x91CA;</p>

      
    </div><!-- .entry-content -->

    <footer class="entry-meta">
    <a href="/2016/06/27/让你的代码成为代码中的高富帅/">
    <time datetime="2016-06-26T16:00:00.000Z" class="entry-date">
        2016-06-27
    </time>
</a>
    
  <span class="article-delim">&#8226;</span>
  <div class="article-category">
  <a class="article-category-link" href="/categories/编程/">编程</a>
  </div>

    
    </footer>
</article>


    
<nav class="nav-single">
    <h3 class="assistive-text">文章导航</h3>
    
        <span class="nav-previous"><a href="/2016/06/28/hexo搭建博客-给文章添加多个tags或category/" rel="prev"><span class="meta-nav">←</span> hexo搭建博客--给文章添加多个tag或category</a></span>
    
    
        <span class="nav-next"><a href="/2016/06/27/详细教程—用github-pages与hexo搭建属于自己的免费博客/" rel="next">详细教程—用github pages与hexo搭建属于自己的免费博客 <span class="meta-nav">→</span></a></span>
    
</nav><!-- .nav-single -->







</div></div>
        <div id="secondary" class="widget-area" role="complementary">
  
    <aside id="search" class="widget widget_search"><form role="search" method="get" accept-charset="utf-8" id="searchform" class="searchform" action="//google.com/search">
    <div>
        <input type="text" value="" name="s" id="s" />
        <input type="submit" id="searchsubmit" value="搜索" />
    </div>
</form></aside>
  
    
  
    
  <aside class="widget">
    <h3 class="widget-title">Categories</h3>
    <div class="widget-content">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/LIFE/">LIFE</a><span class="category-list-count">3</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/MAC/">MAC</a><span class="category-list-count">3</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Machine-Learning/">Machine Learning</a><span class="category-list-count">3</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/iOS/">iOS</a><span class="category-list-count">20</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/御宅文化/">御宅文化</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/编程/">编程</a><span class="category-list-count">55</span></li></ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Recents</h3>
    <div class="widget-content">
      <ul>
        
          <li>
            <a href="/2016/11/29/Machine-Learning-3/">Machine-Learning-3</a>
          </li>
        
          <li>
            <a href="/2016/11/26/Machine-Learning-2/">Machine-Learning-2</a>
          </li>
        
          <li>
            <a href="/2016/11/21/Machine-Learning-1/">Machine Learning-1</a>
          </li>
        
          <li>
            <a href="/2016/11/19/入门MySQL（三）/">入门MySQL（三）</a>
          </li>
        
          <li>
            <a href="/2016/11/19/入门MySQL（二）/">入门MySQL（二）</a>
          </li>
        
      </ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Tags</h3>
    <div class="widget-content">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/Cocoapods/">Cocoapods</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/HTML/">HTML</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Linux/">Linux</a><span class="tag-list-count">15</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Machine-Learning/">Machine Learning</a><span class="tag-list-count">3</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Matlab/">Matlab</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/MySQL/">MySQL</a><span class="tag-list-count">3</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIColor/">UIColor</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView/">UIView</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView-圆角/">UIView-圆角</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Vim/">Vim</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/bug/">bug</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/hexo/">hexo</a><span class="tag-list-count">4</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/指针/">指针</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/数据结构/">数据结构</a><span class="tag-list-count">20</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/算法/">算法</a><span class="tag-list-count">8</span></li></ul>
    </div>
  </aside>

  
    
<div class="widget tag">
<h3 class="title">blogroll</h3>
<ul class="entry">


<li><a href="https://github.com/" target="_blank">github</a></li>


<li><a href="http://www.jianshu.com/users/41cd7711ed44/latest_articles" target="_blank">我的简书主页</a></li>

</ul>
</div>

  
</div>
      </div>
      <footer id="colophon" role="contentinfo">
    <p>&copy; 2016 SaberDa
    All rights reserved.</p>
    <p>Powered by <a href="http://hexo.io/" target="_blank">Hexo</a></p>
</footer>
    <script>window._bd_share_config={"common":{"bdSnsKey":{},"bdText":"","bdMini":"1","bdMiniList":false,"bdPic":"","bdStyle":"2","bdSize":"16"},"share":{}};with(document)0[(getElementsByTagName('head')[0]||body).appendChild(createElement('script')).src='http://bdimg.share.baidu.com/static/api/js/share.js?v=89860593.js?cdnversion='+~(-new Date()/36e5)];</script>

<script src="/js/jquery-2.0.3.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

<script src="/js/navigation.js"></script>

<div id="bg"></div>

  </div>
</body>
</html>