<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  
  <meta name="description" content="阿尔托利亚是我老婆~" />
  

  
  
  
  
  
  
  <title>循环神经网络_RNN | SaberDa的幻想乡</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x5FAA;&amp;#x73AF;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#xFF0C;&amp;#x82F1;&amp;#x6587;&amp;#x540D;&amp;#x662F;Recurrent Neural Network&amp;#xFF0C;&amp;#x968F;&amp;#x7740;&amp;#x5BF9;&amp;#x5B83;&amp;#x7684;&amp;#x4E0D;&amp;#x65AD;&amp;#x6DF1;&amp;#x5165;&amp;#x4E86;">
<meta property="og:type" content="article">
<meta property="og:title" content="循环神经网络_RNN">
<meta property="og:url" content="https://saberda.github.io/2017/11/01/循环神经网络-RNN/index.html">
<meta property="og:site_name" content="SaberDa的幻想乡">
<meta property="og:description" content="&amp;#x5FAA;&amp;#x73AF;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#xFF0C;&amp;#x82F1;&amp;#x6587;&amp;#x540D;&amp;#x662F;Recurrent Neural Network&amp;#xFF0C;&amp;#x968F;&amp;#x7740;&amp;#x5BF9;&amp;#x5B83;&amp;#x7684;&amp;#x4E0D;&amp;#x65AD;&amp;#x6DF1;&amp;#x5165;&amp;#x4E86;">
<meta property="og:image" content="https://saberda.github.io/2017/11/01/循环神经网络-RNN/1.png">
<meta property="og:image" content="https://saberda.github.io/2017/11/01/循环神经网络-RNN/2.png">
<meta property="og:image" content="https://saberda.github.io/2017/11/01/循环神经网络-RNN/3.png">
<meta property="og:image" content="https://saberda.github.io/2017/11/01/循环神经网络-RNN/4.png">
<meta property="og:image" content="https://saberda.github.io/2017/11/01/循环神经网络-RNN/5.png">
<meta property="og:image" content="https://saberda.github.io/2017/11/01/循环神经网络-RNN/6.png">
<meta property="og:image" content="https://saberda.github.io/2017/11/01/循环神经网络-RNN/7.png">
<meta property="og:image" content="https://saberda.github.io/2017/11/01/循环神经网络-RNN/8.png">
<meta property="og:image" content="https://saberda.github.io/2017/11/01/循环神经网络-RNN/9.png">
<meta property="og:image" content="https://saberda.github.io/2017/11/01/循环神经网络-RNN/10.png">
<meta property="og:image" content="https://saberda.github.io/2017/11/01/循环神经网络-RNN/11.png">
<meta property="og:image" content="https://saberda.github.io/2017/11/01/循环神经网络-RNN/12.png">
<meta property="og:image" content="https://saberda.github.io/2017/11/01/循环神经网络-RNN/13.png">
<meta property="og:image" content="https://saberda.github.io/2017/11/01/循环神经网络-RNN/16.png">
<meta property="og:image" content="https://saberda.github.io/2017/11/01/循环神经网络-RNN/14.png">
<meta property="og:image" content="https://saberda.github.io/2017/11/01/循环神经网络-RNN/15.png">
<meta property="og:updated_time" content="2017-10-31T18:27:16.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="循环神经网络_RNN">
<meta name="twitter:description" content="&amp;#x5FAA;&amp;#x73AF;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#xFF0C;&amp;#x82F1;&amp;#x6587;&amp;#x540D;&amp;#x662F;Recurrent Neural Network&amp;#xFF0C;&amp;#x968F;&amp;#x7740;&amp;#x5BF9;&amp;#x5B83;&amp;#x7684;&amp;#x4E0D;&amp;#x65AD;&amp;#x6DF1;&amp;#x5165;&amp;#x4E86;">
<meta name="twitter:image" content="https://saberda.github.io/2017/11/01/循环神经网络-RNN/1.png">
  
  
    <link rel="icon" href="/css/images/favicon.ico">
  
  <link rel="stylesheet" href="/css/style.css">
  

  
  <!-- baidu webmaster push -->
  <script src='//push.zhanzhang.baidu.com/push.js'></script>
</head>
<body class="home blog custom-background custom-font-enabled single-author">
  <div id="page" class="hfeed site">
      <header id="masthead" class="site-header" role="banner">
    <hgroup>
      <h1 class="site-title">
        <a href="/" title="SaberDa的幻想乡" rel="home">SaberDa的幻想乡</a>
      </h1>
      
        <h2 class="site-description">
          <a href="/" id="subtitle">　　iOS/ ML　　|　　二次元　　|　　saberda@qq.com　　|　　从花时间省钱到花钱省时间</a>
        </h2>
      
    </hgroup>

    <nav id="site-navigation" class="main-navigation" role="navigation">
            <button class="menu-toggle">菜单</button>
            <a class="assistive-text" href="/#content" title="跳至内容">跳至内容</a><!--TODO-->
            <div class="menu-main-container">
                <ul id="menu-main" class="nav-menu">
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/archives">所有文章</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/">主页</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/编程/">编程</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/iOS/">iOS</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/ML/">ML</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/PGM/">PGM</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/MAC/">MAC</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/御宅文化/">御宅文化</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/LIFE/">LIFE</a></li>
                
                </ul>
            </div>
    </nav>
</header>
      <div id="main" class="wrapper">
        <div id="primary" class="site-content"><div id="content" role="main"><article id="post-循环神经网络-RNN" class="post-循环神经网络-RNN post type-post status-publish format-standard hentry">
    <!---->

      <header class="entry-header">
        
        
  
    <h1 class="entry-title article-title">
      循环神经网络_RNN
    </h1>
  

        
        <div class="comments-link">
            
            <a href="javascript:void(0);" data-url="https://saberda.github.io/2017/11/01/循环神经网络-RNN/" data-id="cj9fwssd3007g62b3gio3wils" class="leave-reply bdsharebuttonbox" data-cmd="more">Share</a>
        </div><!-- .comments-link -->
      </header><!-- .entry-header -->

    <div class="entry-content">
      
        <p>&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x82F1;&#x6587;&#x540D;&#x662F;Recurrent Neural Network&#xFF0C;&#x968F;&#x7740;&#x5BF9;&#x5B83;&#x7684;&#x4E0D;&#x65AD;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x8FD9;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6A21;&#x578B;&#x662F;&#x591A;&#x4E48;&#x7684;&#x6709;&#x8DA3;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5582;&#x7ED9;&#x5B83;&#x838E;&#x58EB;&#x6BD4;&#x4E9A;&#x7684;&#x4F5C;&#x54C1;&#xFF0C;&#x7ECF;&#x8FC7;&#x6709;&#x6548;&#x7684;&#x8BAD;&#x7EC3;&#x540E;&#x5B83;&#x4F1A;&#x7ED9;&#x4F60;&#x8F93;&#x51FA;&#x5E26;&#x6709;&#x838E;&#x58EB;&#x6BD4;&#x4E9A;&#x98CE;&#x683C;&#x7684;&#x53E5;&#x5B50;&#xFF1B;&#x4F60;&#x5582;&#x7ED9;&#x5B83; Linux &#x6E90;&#x7801;&#xFF0C;&#x5B83;&#x4F1A;&#x88C5;&#x6A21;&#x4F5C;&#x6837;&#x7684;&#x7ED9;&#x4F60;&#x751F;&#x6210;&#x4E00;&#x6BB5;&#x5B83;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5C3D;&#x7BA1;&#x4F1A;&#x6709;&#x8BED;&#x610F;&#x9519;&#x8BEF;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x4F1A;&#x6709;&#x8BED;&#x6CD5;&#x9519;&#x8BEF;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x5E9F;&#x8BDD;&#x4E0D;&#x591A;&#x8BF4;&#xFF0C;&#x76F4;&#x63A5;&#x8FDB;&#x5165;&#x6B63;&#x6587;&#x5427;&#x3002;</p>
<h2 id="Recurrent-Neural-Network"><a href="#Recurrent-Neural-Network" class="headerlink" title="Recurrent Neural Network"></a>Recurrent Neural Network</h2><pre><code>&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x597D;&#x5904;&#x5C31;&#x662F;&#x4ED6;&#x4EEC;&#x4F1A;&#x5728;&#x4F60;&#x5EFA;&#x7ACB;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x67B6;&#x6784;&#x65F6;&#x7ED9;&#x4E88;&#x4F60;&#x5F88;&#x9AD8;&#x7684;&#x7075;&#x6D3B;&#x6027;
</code></pre><p>&#x54B1;&#x4EEC;&#x5148;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x6700;&#x5DE6;&#x8FB9;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x822C;&#x4F60;&#x5728;&#x5904;&#x7406;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x5411;&#x91CF;&#xFF08;&#x5373;&#x56FE;&#x4E2D;&#x7684;&#x7EA2;&#x8272;&#x6846;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x9690;&#x85CF;&#x5C42; &#x2013; &#x8FD9;&#x4E2A;&#x7EFF;&#x8272;&#x7684;&#x6846;&#x6765;&#x5904;&#x7406;&#x5B83;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x5411;&#x91CF;&#xFF0C;&#x5C31;&#x662F;&#x84DD;&#x8272;&#x3002;&#x6240;&#x4EE5;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x56FE;&#x50CF;&#x8FDB;&#x5165;&#x7F51;&#x7EDC;&#xFF0C;&#x7136;&#x540E;&#x8981;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x5411;&#x91CF;&#xFF0C;&#x4ED6;&#x662F;&#x4E00;&#x4E2A; class score&#xFF0C;&#x5728;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x987A;&#x5E8F;&#x5B9E;&#x73B0;&#xFF0C;&#x6BD4;&#x5982;&#x4ECE;&#x8F93;&#x5165;&#x5F00;&#x59CB;&#x6216;&#x8F93;&#x51FA;&#x5F00;&#x59CB;&#xFF0C;&#x6216;&#x8005;&#x4E24;&#x8005;&#x540C;&#x65F6;&#x5F00;&#x59CB;&#x3002;</p>
<a id="more"></a>
<p><img src="/2017/11/01/&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;-RNN/1.png" alt=""></p>
<p>&#x518D;&#x4E3E;&#x4E00;&#x4E2A;&#x56FE;&#x50CF;&#x5B57;&#x5E55;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x6BD4;&#x65B9;&#x8BF4;&#x4F60;&#x5F97;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x63A8;&#x5411;&#xFF0C;&#x901A;&#x8FC7;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x751F;&#x6210;&#x4E00;&#x4E9B;&#x6309;&#x987A;&#x5E8F;&#x6392;&#x5217;&#x7684;&#x63CF;&#x8FF0;&#x56FE;&#x50CF;&#x5185;&#x5BB9;&#x7684;&#x8BCD;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E9B;&#x8BCD;&#x4F1A;&#x8FDE;&#x6210;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x8FD9;&#x5E45;&#x56FE;&#x7684;&#x63CF;&#x8FF0;&#x3002;</p>
<p><img src="/2017/11/01/&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;-RNN/2.png" alt=""></p>
<p>&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x5728;&#x60C5;&#x611F;&#x5206;&#x7C7B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x4E3E;&#x6E38;&#x8BF4;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x6211;&#x4EEC;&#x4F1A;&#x5904;&#x7406;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x6309;&#x7167;&#x987A;&#x5E8F;&#x6392;&#x5217;&#x7684;&#x8BCD;&#xFF0C;&#x7136;&#x540E;&#x8BD5;&#x7740;&#x53BB;&#x628A;&#x8FD9;&#x4E2A;&#x53E5;&#x5B50;&#x91CC;&#x7684;&#x8BCD;&#x6309;&#x6B63;&#x9762;&#x60C5;&#x611F;&#x548C;&#x8D1F;&#x9762;&#x60C5;&#x611F;&#x6765;&#x5206;&#x7C7B;&#x3002;</p>
<p><img src="/2017/11/01/&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;-RNN/3.png" alt=""></p>
<p>&#x5728;&#x7528;&#x673A;&#x5668;&#x8FDB;&#x884C;&#x8BED;&#x8A00;&#x7FFB;&#x8BD1;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x5230;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8BA9;&#x8FD9;&#x4E2A;&#x7F51;&#x7EDC;&#x628A;&#x8FD9;&#x4E9B;&#x5355;&#x8BCD;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x662F;&#x82F1;&#x6587;&#x5355;&#x8BCD;&#x7FFB;&#x8BD1;&#x6210;&#x6CD5;&#x8BED;&#x5355;&#x8BCD;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x4E9B;&#x8BCD;&#x653E;&#x5728;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x79F0;&#x4E4B;&#x4E3A;&#x4ECE;&#x4E00;&#x4E2A;&#x5E8F;&#x5217;&#x7FFB;&#x8BD1;&#x81F3;&#x53E6;&#x4E00;&#x4E2A;&#x5E8F;&#x5217;&#xFF08;seq to seq&#xFF09;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x7F51;&#x7EDC;&#x628A;&#x82F1;&#x6587;&#x53E5;&#x5B50;&#x7FFB;&#x8BD1;&#x6210;&#x4E86;&#x6CD5;&#x8BED;&#x53E5;&#x5B50;&#x3002;</p>
<p><img src="/2017/11/01/&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;-RNN/4.png" alt=""></p>
<p>&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x5C31;&#x662F;&#x89C6;&#x9891;&#x5206;&#x7C7B;&#xFF0C;&#x63D0;&#x5230;&#x8FD9;&#x4E2A;&#xFF0C;&#x4E5F;&#x8BB8;&#x4F60;&#x4F1A;&#x60F3;&#x5230;&#x628A;&#x89C6;&#x9891;&#x91CC;&#x7684;&#x6BCF;&#x4E00;&#x5E27;&#x56FE;&#x50CF;&#x90FD;&#x6309;&#x7167;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x7C7B;&#x6765;&#x5206;&#x7C7B;&#xFF0C;&#x4F46;&#x5173;&#x952E;&#x662F;&#x4F60;&#x5B9E;&#x9645;&#x4E0A;&#x4E0D;&#x5E0C;&#x671B;&#x8FD9;&#x4E2A;&#x9884;&#x6D4B;&#x4EC5;&#x4EC5;&#x662F;&#x5F53;&#x524D;&#x65F6;&#x95F4;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x5F53;&#x524D;&#x8131;&#x6C28;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x4F60;&#x66F4;&#x5E0C;&#x671B;&#x4ED6;&#x662F;&#x5F53;&#x524D;&#x65F6;&#x95F4;&#x4E4B;&#x524D;&#x6240;&#x6709;&#x56FE;&#x7247;&#x7684;&#x51FD;&#x6570;&#x3002;&#x90A3;&#x4E48;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5C31;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x67B6;&#x6784;&#xFF0C;&#x8FD9;&#x4E2A;&#x67B6;&#x6784;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x9884;&#x6D4B;&#x5F97;&#x5230;&#x67D0;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#x524D;&#x6240;&#x6709;&#x56FE;&#x7247;&#x7684;&#x51FD;&#x6570;&#x3002;&#x5373;&#x4F7F;&#x4F60;&#x6CA1;&#x6709;&#x8F93;&#x5165;&#x6216;&#x8F93;&#x51FA;&#x7684;&#x5E8F;&#x5217;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x5230;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x751A;&#x81F3;&#x4F60;&#x5728;&#x6700;&#x5F00;&#x59CB;&#x7684;&#x90A3;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x7528;&#x5230;&#x4ED6;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x53EF;&#x4EE5;&#x5BF9;&#x4F60;&#x7684;&#x56FA;&#x5B9A;&#x5C3A;&#x5BF8;&#x7684;&#x8F93;&#x5165;&#x6216;&#x8005;&#x8F93;&#x51FA;&#x6309;&#x987A;&#x5E8F;&#x7684;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;</p>
<p><img src="/2017/11/01/&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;-RNN/5.png" alt=""></p>
<p>&#x90A3;&#x4E48;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5B9E;&#x8D28;&#x4E0A;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x7EFF;&#x8272;&#x7684;&#x6846;&#x3002;&#x4ED6;&#x81EA;&#x5DF1;&#x6709;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#xFF0C;&#x5E76;&#x5B9A;&#x671F;&#x7684;&#x63A5;&#x53D7;&#x6570;&#x636E;&#xFF0C;&#x6240;&#x4EE5;&#x6BCF;&#x4E00;&#x4E2A;&#x5728;&#x6BCF;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#x4E2D;&#x5B83;&#x6709;&#x5185;&#x5728;&#x7684;&#x72B6;&#x6001;&#x3002;&#x7136;&#x540E;&#x5B83;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#x6240;&#x63A5;&#x53D7;&#x5185;&#x5BB9;&#x7684;&#x6839;&#x636E;&#x51FD;&#x6570;&#x6765;&#x4FEE;&#x6539;&#x81EA;&#x5DF1;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x4ED6;&#x4F1A;&#x5728; RNN &#x91CC;&#x7B49;&#x5F85;&#x7740;&#xFF0C;RNN &#x4F1A;&#x6839;&#x636E;&#x4ED6;&#x5728;&#x63A5;&#x53D7;&#x8F93;&#x5165;&#x65F6;&#x72B6;&#x6001;&#x7684;&#x53C2;&#x4E0E;&#x7A0B;&#x5EA6;&#x6765;&#x6539;&#x53D8;&#x5B83;&#x7684;&#x884C;&#x4E3A;&#x3002;</p>
<p><img src="/2017/11/01/&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;-RNN/6.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x8FD8;&#x8981;&#x5173;&#x6CE8;&#x57FA;&#x4E8E; RNN &#x72B6;&#x6001;&#x6240;&#x751F;&#x6210;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728; RNN &#x4E0A;&#x65B9;&#x751F;&#x6210;&#x8FD9;&#x4E9B;&#x5411;&#x91CF;&#xFF0C;&#x4F60;&#x4F1A;&#x770B;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x56FE;&#xFF0C;&#x4F46;&#x6211;&#x8981;&#x8BF4;&#x7684;&#x662F; RNN &#x5C31;&#x53EA;&#x662F;&#x5728;&#x4E2D;&#x95F4;&#x7684;&#x4E00;&#x5757;&#xFF0C;&#x4ED6;&#x6709;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#xFF0C;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x95F4;&#x53D8;&#x5316;&#x63A5;&#x53D7;&#x5411;&#x91CF;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x4E9B;&#x5E94;&#x7528;&#x4E2D;&#x6839;&#x636E;&#x4ED6;&#x4E0A;&#x65B9;&#x7684;&#x72B6;&#x6001;&#x8FDB;&#x884C;&#x5047;&#x8BBE;</p>
<p><img src="/2017/11/01/&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;-RNN/7.png" alt=""></p>
<h2 id="&#x5FAA;&#x73AF;&#x7684;&#x8FC7;&#x7A0B;"><a href="#&#x5FAA;&#x73AF;&#x7684;&#x8FC7;&#x7A0B;" class="headerlink" title="&#x5FAA;&#x73AF;&#x7684;&#x8FC7;&#x7A0B;"></a>&#x5FAA;&#x73AF;&#x7684;&#x8FC7;&#x7A0B;</h2><p>&#x90A3;&#x4E48;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x770B;&#x8D77;&#x6765;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;RNN &#x6709;&#x67D0;&#x79CD;&#x72B6;&#x6001;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x8BB0;&#x4E3A;&#x5411;&#x91CF; H &#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x8BB8;&#x591A;&#x5411;&#x91CF;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x52A0;&#x7EFC;&#x5408;&#x7684;&#x72B6;&#x6001;&#x3002;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x8981;&#x6839;&#x636E;&#x4E4B;&#x524D;&#x7684;&#x9690;&#x85CF;&#x72B6;&#x6001; h &#x524D;&#x7684;&#x65F6;&#x95F4; t-1 &#x4EE5;&#x53CA;&#x73B0;&#x5728;&#x8F93;&#x5165;&#x5411;&#x91CF; X &#x5217;&#x4E00;&#x4E2A;&#x65B9;&#x7A0B;&#xFF0C;&#x5176;&#x4E2D;&#x8FD8;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x628A;&#x5B83;&#x79F0;&#x4E4B;&#x4E3A;&#x9012;&#x5F52;&#x51FD;&#x6570;&#xFF08;recurrence function&#xFF09;&#xFF0C;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x6709;&#x4E00;&#x4E2A;&#x53C2;&#x6570; W &#xFF0C;&#x90A3;&#x4E48;&#x5F53;&#x6211;&#x4EEC;&#x5BF9; W &#x8FDB;&#x884C;&#x6539;&#x53D8;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;RNN&#x6709;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x8868;&#x73B0;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x662F;RNN&#x7684;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8981;&#x8BAD;&#x7EC3;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x4E2D;&#x7684;&#x6743;&#x91CD;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x8981;&#x7740;&#x91CD;&#x8BF4;&#x660E;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x4E0D;&#x957F;&#x4E2D;&#x6211;&#x4EEC;&#x90FD;&#x8981;&#x6709;&#x540C;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x540C;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x5927;&#x5C0F;&#x7684;f<sub>w</sub>&#xFF0C;&#x5728;&#x6BCF;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#x4E2D;&#x6211;&#x4EEC;&#x90FD;&#x8981;&#x7528;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x65E2;&#x53EF;&#x4EE5;&#x4F7F;&#x6211;&#x4EEC;&#x6309;&#x987A;&#x5E8F;&#x4F7F;&#x7528;&#x5FAA;&#x73AF;&#x56DE;&#x5F52;&#x7F51;&#x7EDC;&#xFF0C;&#x53C8;&#x4E0D;&#x7528;&#x53BB;&#x7BA1;&#x8FD9;&#x4E2A;&#x5E8F;&#x5217;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x65E0;&#x8BBA;&#x8F93;&#x5165;&#x6216;&#x8F93;&#x51FA;&#x7684;&#x5E8F;&#x5217;&#x6709;&#x591A;&#x957F;&#xFF0C;&#x5728;&#x6BCF;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x4E0D;&#x957F;&#x4E2D;&#x6211;&#x4EEC;&#x7528;&#x7684;&#x90FD;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x3002;</p>
<p><img src="/2017/11/01/&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;-RNN/8.png" alt=""></p>
<p>&#x6240;&#x4EE5;&#x5728;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x60C5;&#x51B5;&#x4E2D;&#xFF0C;&#x5728;&#x53EF;&#x7528;&#x7684;&#x6700;&#x7B80;&#x5355;&#x7684;&#x5FAA;&#x73AF;&#x4E2D;&#x5EFA;&#x7ACB;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x6700;&#x7B80;&#x4FBF;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F; vanilla RNN&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x72B6;&#x6001;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x9690;&#x85CF;&#x72B6;&#x6001;&#xFF08;hidden state&#xFF09;h&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x5FAA;&#x73AF;&#x65B9;&#x7A0B;&#x5F0F;&#x3002;&#x8FD9;&#x4E2A;&#x65B9;&#x7A0B;&#x5F0F;&#x53EF;&#x4EE5;&#x544A;&#x8BC9;&#x4F60;&#x600E;&#x4E48;&#x6765;&#x66F4;&#x65B0;&#x4F60;&#x7684;&#x9690;&#x85CF;&#x72B6;&#x6001;&#x3002;&#x8FD9;&#x9700;&#x8981;&#x7528;&#x5230;&#x4E4B;&#x524D;&#x7684;&#x9690;&#x85CF;&#x72B6;&#x6001;&#x8FD8;&#x6709;&#x73B0;&#x5728;&#x8F93;&#x5165;&#x7684; X<sub>t</sub> &#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x6700;&#x7279;&#x6B8A;&#x4E5F;&#x662F;&#x6700;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x7528;&#x5230;&#x8FD9;&#x4E9B;&#x6743;&#x77E9;&#x9635; W<sub>hh</sub> &#x548C; W<sub>xh</sub>&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x77E9;&#x9635;&#x5206;&#x522B;&#x5BF9;&#x4E4B;&#x524D;&#x7684;&#x9690;&#x85CF;&#x72B6;&#x6001;&#x548C;&#x73B0;&#x5728;&#x7684;&#x8F93;&#x5165;&#x505A;&#x6295;&#x5F71;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x8FD9;&#x4E24;&#x8005;&#x76F8;&#x52A0;&#xFF0C;&#x5E76;&#x6C42;&#x51FA;&#x8FD9;&#x4E2A;&#x548C;&#x7684;&#x53CC;&#x66F2;&#x6B63;&#x5207;&#x503C;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x66F4;&#x65B0;&#x65F6;&#x95F4; t &#x4E0B;&#x9690;&#x85CF;&#x72B6;&#x6001;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x4E2A;&#x5FAA;&#x73AF;&#x6240;&#x505A;&#x7684;&#x5C31;&#x662F;&#x544A;&#x8BC9;&#x6211;&#x4EEC;h&#x662F;&#x600E;&#x6837;&#x968F;&#x65F6;&#x95F4;&#x548C;&#x76EE;&#x524D;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#x7684;&#x8F93;&#x5165;&#x7684;&#x53D8;&#x5316;&#x800C;&#x53D8;&#x5316;&#x7684;&#x3002;&#x90A3;&#x4E48;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x5BF9;h&#x8FDB;&#x884C;&#x68C0;&#x6D4B;&#x3002;&#x6BD4;&#x5982;&#x7528;&#x53E6;&#x4E00;&#x4E2A;&#x77E9;&#x9635;&#x5BF9;&#x9690;&#x85CF;&#x72B6;&#x6001;&#x8FDB;&#x884C;&#x6295;&#x5F71;&#x3002;</p>
<p><img src="/2017/11/01/&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;-RNN/9.png" alt=""></p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x7528;&#x4E8E;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x3002;&#x4E3A;&#x4E86;&#x8BB2;&#x8FF0;&#x8FD9;&#x5230;&#x5E95;&#x600E;&#x4E48;&#x7528;&#x7684;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x8981;&#x8BB2; X<sub>t</sub> &#x548C; y &#x5728;&#x5411;&#x91CF;&#x4E2D;&#x7684;&#x62BD;&#x8C61;&#x5F62;&#x5F0F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x8BED;&#x4E49;&#x5B66;&#x6765;&#x5206;&#x6790;&#x8FD9;&#x4E9B;&#x5411;&#x91CF;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x5230;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x65B9;&#x9762;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5B57;&#x7B26;&#x7EA7;&#x8BED;&#x8A00;&#x6A21;&#x578B;&#xFF08;character-level language model&#xFF09;&#x3002;&#x8FD9;&#x662F;&#x6211;&#x8BA4;&#x4E3A;&#x7406;&#x89E3;RNN&#x6700;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x4E4B;&#x4E00;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x53C8;&#x76F4;&#x89C2;&#x53C8;&#x6709;&#x8DA3;&#x3002;</p>
<h2 id="Char-RNN"><a href="#Char-RNN" class="headerlink" title="Char-RNN"></a>Char-RNN</h2><p>&#x90A3;&#x4E48;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;RNN&#x7684;&#x5B57;&#x7B26;&#x7EA7;&#x8BED;&#x8A00;&#x6A21;&#x578B;&#xFF0C;&#x4ED6;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x662F;&#xFF1A;&#x628A;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x5B57;&#x7B26;&#x8F93;&#x5165;&#x5230;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x3002;&#x5728;&#x6BCF;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x4F1A;&#x8981;&#x6C42;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6765;&#x9884;&#x6D4B;&#x4E0B;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x5C31;&#x4F1A;&#x6839;&#x636E;&#x4ED6;&#x6240;&#x770B;&#x5230;&#x7684;&#x5B57;&#x7B26;&#x6765;&#x9884;&#x6D4B;&#x4E0B;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x662F;&#x4EC0;&#x4E48;&#x3002;</p>
<p>&#x4E3E;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x8BAD;&#x7EC3;&#x5E8F;&#x5217; hello&#xFF0C;&#x5B57;&#x7B26;&#x8BCD;&#x6C47;&#xFF0C;&#x5373; [h, e, l, o]&#xFF0C;&#x6211;&#x4EEC;&#x8BD5;&#x7740;&#x5728;&#x8FD9;&#x7EC4;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x4E2D;&#x4F7F;&#x7528;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6765;&#x5B66;&#x4E60;&#x9884;&#x6D4B;&#x5E8F;&#x5217;&#x4E2D;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x65B9;&#x6CD5;&#x5F00;&#x59CB;&#x8FD0;&#x4F5C;&#xFF0C;&#x5C06;&#x6BCF;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x6309;&#x7167;&#x5148;&#x540E;&#x4E0D;&#x540C;&#x65F6;&#x95F4;&#x70B9;&#x8F6C;&#x5316;&#x4E3A;&#x4E00;&#x4E2A;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x8DEF;&#x3002;&#x7B2C;&#x4E00;&#x6B65;&#x5B8C;&#x6210;&#x7684;&#x662F; h &#x5B57;&#x7B26;&#xFF0C;&#x7136;&#x540E;&#x662F; e&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x8FD9;&#x6837;&#x5B8C;&#x6210;&#x4E86; H-E-L-L&#x3002;&#x6211;&#x4EEC;&#x6765;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x8BCD;&#x5411;&#x91CF; &#x2013; one hot&#x5411;&#x91CF;&#xFF0C;&#x4EE3;&#x8868;&#x4E86;&#x5B57;&#x7B26;&#x7684;&#x987A;&#x5E8F;&#x548C;&#x8BCD;&#x6C47;&#x3002;</p>
<p><img src="/2017/11/01/&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;-RNN/10.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x9012;&#x63A8;&#x516C;&#x5F0F;&#x3002;</p>
<p><img src="/2017/11/01/&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;-RNN/11.png" alt=""></p>
<p>&#x5728;&#x6BCF;&#x4E00;&#x4E2A;&#x6D4B;&#x8BD5;&#x4E2D;&#x6211;&#x4EEC;&#x4ECE;h&#x5F00;&#x59CB;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x8981;&#x6C42;&#x8BA1;&#x7B97;&#x9690;&#x85CF;&#x5C42;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x9AA4;&#x4F7F;&#x7528;&#x6211;&#x4EEC;&#x7684;&#x5730;&#x63A8;&#x516C;&#x5F0F;&#x3002;&#x5047;&#x8BBE;&#x8FD9;&#x4E00;&#x5C42;&#x4E2D;&#x53EA;&#x6709;&#x4E09;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x7528;&#x4E00;&#x4E2A;&#x4E09;&#x7EF4;&#x5411;&#x91CF;&#xFF0C;&#x57FA;&#x672C;&#x5728;&#x65F6;&#x95F4;&#x70B9;&#x4E0A;&#x603B;&#x7ED3;&#x4E86;&#x6240;&#x6709;&#x7684;&#x5B57;&#x7B26;&#xFF0C;&#x76F4;&#x5230;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x9AA4;&#x4E0A;&#x90FD;&#x6709;&#x9690;&#x85CF;&#x5C42;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x9884;&#x6D4B;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x9AA4;&#x6240;&#x8FDE;&#x63A5;&#x7684;&#x5E8F;&#x5217;&#x4E2D;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x662F;&#x4EC0;&#x4E48;&#x3002;</p>
<p><img src="/2017/11/01/&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;-RNN/12.png" alt=""></p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#x4E2D;&#x6709;&#x56DB;&#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x6211;&#x4EEC;&#x9884;&#x6D4B;&#x5728;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#x6709;&#x56DB;&#x4E2A;&#x6570;&#x5B57;&#x3002;&#x4F8B;&#x5982;&#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x5E94;&#x4E86;&#x5B57;&#x6BCD; H &#xFF0C;&#x540C;&#x65F6; RNN &#x5728;&#x8FD9;&#x65F6;&#x5019;&#x7684;&#x6743;&#x91CD;&#x5DF2;&#x7ECF;&#x8BA1;&#x7B97;&#x5230;&#x4E86;&#x4ED6;&#x73B0;&#x5728;&#x7684;&#x5B57;&#x6BCD;&#x4EE5;&#x53CA;&#x4E0B;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#x548C;&#x5B57;&#x7B26;&#x3002;&#x90A3;&#x4E48;&#x63A8;&#x65AD;&#xFF0C;H &#x5BF9;&#x5E94;&#x7684;&#x4E0B;&#x4E00;&#x4F4D;&#x5B57;&#x7B26;&#x7684;&#x6743;&#x91CD;&#x662F; H &#x7684;&#x8BDD;&#x662F; 1.0&#xFF0C;E &#x662F; 2.2&#xFF0C;L &#x662F; -3.0&#xFF0C;O &#x662F; 4.1&#xFF0C;&#x9664;&#x4E86;&#x5176;&#x4ED6;&#x53EF;&#x80FD;&#x6027;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x77E5;&#x9053;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x8BAD;&#x7EC3;&#x5E8F;&#x5217;&#x4E2D;&#xFF0C;E &#x662F;&#x5728; H &#x540E;&#x9762;&#x7684;&#x90A3;&#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x6240;&#x4EE5;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x53D8;&#x4E3A;&#x7EFF;&#x8272;&#x7684;&#x90A3;&#x4E2A; 2.2 &#x662F;&#x6B63;&#x786E;&#x7684;&#x7B54;&#x6848;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x8FD9;&#x4E2A;&#x503C;&#x662F;&#x9AD8;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x95E8;&#x8981;&#x8BA9;&#x5176;&#x4ED6;&#x503C;&#x6BD4;&#x8F83;&#x4F4E;&#xFF0C;&#x8FD9;&#x5C31;&#x4F7F;&#x6211;&#x4EEC;&#x57FA;&#x672C;&#x4E0A;&#x6709;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#xFF0C;&#x8C01;&#x4F1A;&#x662F;&#x5E8F;&#x5217;&#x4E2D;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x3002;</p>
<p><img src="/2017/11/01/&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;-RNN/13.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x4EC5;&#x4EC5;&#x662F;&#x60F3;&#x8BA9;&#x8FD9;&#x4E00;&#x7C7B;&#x7684;&#x503C;&#x662F;&#x9AD8;&#x7684;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x503C;&#x662F;&#x4F4E;&#x7684;&#xFF0C;&#x5305;&#x62EC;&#x7EFF;&#x8272;&#x7684;&#x4FE1;&#x53F7;&#x3001;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B;&#x94FE;&#x63A5;&#x5411;&#x540E;&#x4F20;&#x64AD;&#x3002;&#x8FD9;&#x79CD;&#x7528;&#x6765;&#x601D;&#x8003;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x9AA4;&#xFF0C;&#x6211;&#x4EEC;&#x57FA;&#x672C;&#x4E0A;&#x6709;&#x4E00;&#x4E2A;&#x5927;&#x7684; softmax &#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x8FD9;&#x4E9B;&#x5927;&#x7684; softmax &#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x7ED3;&#x675F;&#x540E;&#x4F1A;&#x63A5;&#x7740;&#x4E0B;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x5728;&#x6BCF;&#x4E2A;&#x70B9;&#x4E0A;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x4E0B;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EA;&#x662F;&#x5F97;&#x5230;&#x4E86;&#x4ECE;&#x4E0A;&#x5230;&#x4E0B;&#x7684;&#x635F;&#x5931;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x8FC7;&#x8FD9;&#x5F20;&#x56FE;&#x6D41;&#x901A;&#xFF0C;&#x5411;&#x540E;&#x81F3;&#x6240;&#x6709;&#x7684;&#x7BAD;&#x5934;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x5F97;&#x5230;&#x6240;&#x6709;&#x6743;&#x91CD;&#x77E9;&#x9635;&#x7684;&#x68AF;&#x5EA6;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x8F6C;&#x79FB;&#x77E9;&#x9635;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x5F53;&#x524D;&#x7684;&#x95EE;&#x9898;&#x6765;&#x81EA;&#x4E8E; RNN&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8981;&#x4F1A;&#x5851;&#x9020;&#x8FD9;&#x4E9B;&#x6743;&#x91CD;&#xFF0C;&#x8FD9;&#x624D;&#x662F;&#x6B63;&#x786E;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5F62;&#x6210;&#x5B57;&#x7B26;&#xFF0C;&#x5E76;&#x4E14;&#x4F60;&#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#x7684;&#x51FA;&#x6765;&#x4F60;&#x662F;&#x5982;&#x4F55;&#x8BAD;&#x7EC3;&#x7684;&#x3002;</p>
<h2 id="&#x8BAD;&#x7EC3;-RNN"><a href="#&#x8BAD;&#x7EC3;-RNN" class="headerlink" title="&#x8BAD;&#x7EC3; RNN"></a>&#x8BAD;&#x7EC3; RNN</h2><p>&#x6B63;&#x5982;&#x6211;&#x63D0;&#x5230;&#x7684;&#x6BCF;&#x4E2A;&#x9012;&#x5F52;&#x573A;&#x666F;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x6211;&#x4EEC;&#x6BCF;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x9AA4;&#x90FD;&#x6709;&#x4E00;&#x4E2A; W<sub>xh</sub> &#xFF0C;&#x4E5F;&#x6709;&#x4E00;&#x4E2A; W<sub>hy</sub> &#x3002;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x4E2A;&#x56FE;&#x89E3;&#x4E2D;&#x7528;&#x4E86;&#x56DB;&#x6B21; W<sub>xh</sub> &#x548C; W<sub>hy</sub>&#xFF0C;&#x5411;&#x540E;&#x4F20;&#x64AD;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B;&#x7ED9;&#x4ED6;&#x4EEC;&#x8BA1;&#x6570;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4F1A;&#x628A;&#x6240;&#x6709;&#x7684;&#x6DFB;&#x52A0;&#x5230;&#x76F8;&#x540C;&#x7684;&#x6743;&#x91CD;&#x77E9;&#x9635;&#xFF0C;&#x4E5F;&#x56E0;&#x4E3A;&#x4ED6;&#x5DF2;&#x7ECF;&#x88AB;&#x7528;&#x5728;&#x591A;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x9AA4;&#xFF0C;&#x8FD9;&#x4F7F;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x5904;&#x7406;&#x4E0D;&#x540C;&#x8F93;&#x5165;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x56E0;&#x4E3A;&#x5373;&#x4F7F;&#x6211;&#x4EEC;&#x6BCF;&#x6B21;&#x505A;&#x76F8;&#x540C;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x529F;&#x80FD;&#x7684;&#x6570;&#x91CF;&#x4E5F;&#x4E0D;&#x4F1A;&#x76F8;&#x540C;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div></pre></td><td class="code"><pre><div class="line">import numpy as np</div><div class="line"></div><div class="line"># data I/O</div><div class="line">data = open(&apos;input.txt&apos;, &apos;r&apos;).read() # should be simple plain text file</div><div class="line">chars = list(set(data))</div><div class="line">data_size, vocab_size = len(data), len(chars)</div><div class="line">print &apos;data has %d characters, %d unique.&apos; % (data_size, vocab_size)</div><div class="line">char_to_ix = { ch:i for i,ch in enumerate(chars) }</div><div class="line">ix_to_char = { i:ch for i,ch in enumerate(chars) }</div></pre></td></tr></table></figure>
<p>&#x5728;&#x6700;&#x5F00;&#x59CB;&#xFF0C;&#x6B63;&#x5982;&#x4F60;&#x6240;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x53EA;&#x6709; numpy&#xFF0C;&#x4E00;&#x4E9B;&#x6587;&#x672C;&#x6570;&#x636E;&#x6B63;&#x5728;&#x52A0;&#x8F7D;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x91CC;&#x53EA;&#x662F;&#x6536;&#x96C6;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x5B57;&#x7B26;&#x5E8F;&#x5217;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x8F93;&#x5165; txt &#x6587;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x4F1A;&#x5F97;&#x5230;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5B57;&#x7B26;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x4F1A;&#x627E;&#x5230;&#x6240;&#x6709;&#x72EC;&#x4E00;&#x65E0;&#x4E8C;&#x7684;&#x5B57;&#x7B26;&#x3002;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x6620;&#x5C04;&#x5B57;&#x5178;&#xFF0C;&#x6620;&#x5C04;&#x5B57;&#x7B26;&#x7D22;&#x5F15;&#xFF0C;&#x4ECE;&#x7D22;&#x5F15;&#x80FD;&#x627E;&#x5230;&#x5B57;&#x7B26;&#xFF0C;&#x6211;&#x4EEC;&#x6700;&#x57FA;&#x672C;&#x7684;&#x8FD8;&#x662F;&#x4E3A;&#x4E86;&#x5B57;&#x7B26;&#x3002;&#x4ECE;&#x8868;&#x9762;&#x4E0A;&#x770B;&#x662F;&#x4E00;&#x5927;&#x5806;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x6570;&#x767E;&#x4E2A;&#x7684;&#x5B57;&#x7B26;&#x6216;&#x8005;&#x7C7B;&#x4F3C;&#x7684;&#x4E1C;&#x897F;&#x5E76;&#x4E14;&#x5728;&#x5E8F;&#x5217;&#x91CC;&#x6392;&#x5E8F;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x628A;&#x7D22;&#x5F15;&#x5173;&#x8054;&#x5230;&#x6BCF;&#x4E2A;&#x5B57;&#x7B26;&#x4E0A;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x5728;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x5316;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div></pre></td><td class="code"><pre><div class="line"># hyperparameters</div><div class="line">hidden_size = 100 # size of hidden layer of neurons</div><div class="line">seq_length = 25 # number of steps to unroll the RNN for</div><div class="line">learning_rate = 1e-1</div><div class="line"></div><div class="line"># model parameters</div><div class="line">Wxh = np.random.randn(hidden_size, vocab_size)*0.01 # input to hidden</div><div class="line">Whh = np.random.randn(hidden_size, hidden_size)*0.01 # hidden to hidden</div><div class="line">Why = np.random.randn(vocab_size, hidden_size)*0.01 # hidden to output</div><div class="line">bh = np.zeros((hidden_size, 1)) # hidden bias</div><div class="line">by = np.zeros((vocab_size, 1)) # output bias</div></pre></td></tr></table></figure>
<p>&#x9996;&#x5148;&#x662F;&#x9690;&#x85CF;&#x5927;&#x5C0F;&#x7684;&#x521D;&#x59CB;&#x503C;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x4F1A;&#x7528;&#x5230; RNN&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x4E0D;&#x80FD;&#x8BA9;&#x4ED6;&#x6210;&#x4E3A; 100&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x5B66;&#x4E60;&#x7387;&#xFF0C;&#x5E8F;&#x5217;&#x957F;&#x5EA6;&#x5728;&#x8FD9;&#x91CC;&#x8FBE;&#x5230;&#x4E86; 25&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4F60;&#x9700;&#x8981;&#x610F;&#x8BC6;&#x5230;&#x7684;&#x53C2;&#x6570;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x7684;&#x8F93;&#x5165;&#x6570;&#x636E;&#x5F88;&#x5927;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x6709;&#x6570;&#x767E;&#x4E07;&#x6B21;&#xFF0C;&#x4F60;&#x5C31;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x628A;&#x5B83;&#x653E;&#x5728;&#x6240;&#x6709;&#x7684;&#x4E0A;&#x9762;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4FDD;&#x6301;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x548C;&#x5185;&#x5B58;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x5411;&#x540E;&#x4F20;&#x64AD;&#x3002;&#x4F46;&#x662F;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x6CA1;&#x529E;&#x6CD5;&#x628A;&#x4ED6;&#x4EEC;&#x6240;&#x6709;&#x90FD;&#x5B58;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x5E76;&#x4E14;&#x5411;&#x540E;&#x4F20;&#x64AD;&#x6240;&#x6709;&#x7684;&#x8F93;&#x5165;&#x6570;&#x636E;&#x5757;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x901A;&#x8FC7;&#x4E00;&#x4E2A; 25 &#x5B57;&#x7B26;&#x7684;&#x5E8F;&#x5217;&#xFF0C;&#x6211;&#x4F1A;&#x5728;&#x4E0B;&#x6587;&#x8BB2;&#x5230;&#x3002;&#x6211;&#x4EEC;&#x6709;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x8981;&#x8BA9;&#x4ED6;&#x53D8;&#x6210;&#x5728;&#x67D0;&#x4E00;&#x65F6;&#x95F4;&#x53EA;&#x6709; 25 &#x4E2A;&#x5B57;&#x7B26;&#x7684;&#x6570;&#x636E;&#x5757;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x6B21;&#x90FD;&#x662F;&#x6309;&#x65F6;&#x901A;&#x8FC7; 25 &#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x8D1F;&#x62C5;&#x4E0D;&#x8D77;&#x592A;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x5411;&#x540E;&#x4F20;&#x64AD;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x8BB0;&#x5F55;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8BA9;&#x6570;&#x636E;&#x5757;&#x5305;&#x542B; 2 5&#x4E2A;&#x5B57;&#x7B26;&#x3002;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x4F8B;&#x4E3E;&#x4E86;&#x6240;&#x6709;&#x7684; W &#x77E9;&#x9635;&#xFF0C;&#x5206;&#x6790;&#x4E86;&#x4E00;&#x4E9B;&#x968F;&#x673A;&#x7684;&#x65B9;&#x6846;&#x6240;&#x4EE5; W<sub>xh</sub> &#x548C; W<sub>hy</sub> &#x90FD;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x624D;&#x80FD;&#x8BAD;&#x7EC3;&#x5411;&#x540E;&#x4F20;&#x64AD;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div><div class="line">17</div><div class="line">18</div><div class="line">19</div><div class="line">20</div><div class="line">21</div><div class="line">22</div><div class="line">23</div><div class="line">24</div><div class="line">25</div><div class="line">26</div><div class="line">27</div><div class="line">28</div><div class="line">29</div><div class="line">30</div><div class="line">31</div><div class="line">32</div></pre></td><td class="code"><pre><div class="line">n, p = 0, 0</div><div class="line">mWxh, mWhh, mWhy = np.zeros_like(Wxh), np.zeros_like(Whh), np.zeros_like(Why)</div><div class="line">mbh, mby = np.zeros_like(bh), np.zeros_like(by) # memory variables for Adagrad</div><div class="line">smooth_loss = -np.log(1.0/vocab_size)*seq_length # loss at iteration 0</div><div class="line">while True:</div><div class="line">  # prepare inputs (we&apos;re sweeping from left to right in steps seq_length long)</div><div class="line">  if p+seq_length+1 &gt;= len(data) or n == 0: </div><div class="line">    hprev = np.zeros((hidden_size,1)) # reset RNN memory</div><div class="line">    p = 0 # go from start of data</div><div class="line">  inputs = [char_to_ix[ch] for ch in data[p:p+seq_length]]</div><div class="line">  targets = [char_to_ix[ch] for ch in data[p+1:p+seq_length+1]]</div><div class="line"></div><div class="line">  # sample from the model now and then</div><div class="line">  if n % 100 == 0:</div><div class="line">    sample_ix = sample(hprev, inputs[0], 200)</div><div class="line">    txt = &apos;&apos;.join(ix_to_char[ix] for ix in sample_ix)</div><div class="line">    print &apos;----\n %s \n----&apos; % (txt, )</div><div class="line"></div><div class="line">  # forward seq_length characters through the net and fetch gradient</div><div class="line">  loss, dWxh, dWhh, dWhy, dbh, dby, hprev = lossFun(inputs, targets, hprev)</div><div class="line">  smooth_loss = smooth_loss * 0.999 + loss * 0.001</div><div class="line">  if n % 100 == 0: print &apos;iter %d, loss: %f&apos; % (n, smooth_loss) # print progress</div><div class="line">  </div><div class="line">  # perform parameter update with Adagrad</div><div class="line">  for param, dparam, mem in zip([Wxh, Whh, Why, bh, by], </div><div class="line">                                [dWxh, dWhh, dWhy, dbh, dby], </div><div class="line">                                [mWxh, mWhh, mWhy, mbh, mby]):</div><div class="line">    mem += dparam * dparam</div><div class="line">    param += -learning_rate * dparam / np.sqrt(mem + 1e-8) # adagrad update</div><div class="line"></div><div class="line">  p += seq_length # move data pointer</div><div class="line">  n += 1 # iteration counter </div></pre></td></tr></table></figure>
<p>&#x7136;&#x540E;&#x6211;&#x4EEC;&#x5148;&#x770B;&#x6700;&#x540E;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div></pre></td><td class="code"><pre><div class="line"># prepare inputs (we&apos;re sweeping from left to right in steps seq_length long)</div><div class="line">  if p+seq_length+1 &gt;= len(data) or n == 0: </div><div class="line">    hprev = np.zeros((hidden_size,1)) # reset RNN memory</div><div class="line">    p = 0 # go from start of data</div><div class="line">  inputs = [char_to_ix[ch] for ch in data[p:p+seq_length]]</div><div class="line">  targets = [char_to_ix[ch] for ch in data[p+1:p+seq_length+1]]</div></pre></td></tr></table></figure>
<p>&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x4E3B;&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x91CC;&#x7684;&#x4E00;&#x4E9B;&#x521D;&#x59CB;&#x503C;&#x8BBE;&#x7F6E;&#x4E3A;20&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#x5BF9;&#x4E00;&#x6279;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x91C7;&#x6837;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E5F;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x5904;&#x6279;&#x5904;&#x7406; 25 &#x4E2A;&#x5B57;&#x7B26;&#x7684;&#x5730;&#x65B9;&#x3002;&#x8FD9;&#x4E9B;&#x5C31;&#x662F;&#x8F93;&#x5165;&#x5217;&#x8868;&#xFF0C;&#x8F93;&#x5165;&#x5217;&#x8868;&#x57FA;&#x672C;&#x4E0A;&#x53EA;&#x6709;&#x5BF9;&#x5E94;&#x7684; 25 &#x4E2A;&#x5B57;&#x7B26;&#x3002;&#x4F60;&#x6240;&#x770B;&#x5230;&#x7684;&#x76EE;&#x6807;&#x662F;&#x6240;&#x6709;&#x7684;&#x76F8;&#x540C;&#x5B57;&#x7B26;&#xFF0C;&#x9664;&#x53BB;&#x79FB;&#x9664;&#x7684;&#x90A3;&#x4E2A;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x6211;&#x4EEC;&#x8BD5;&#x56FE;&#x5728;&#x6BCF;&#x4E00;&#x5C42;&#x9884;&#x6D4B;&#x7684;&#x68C0;&#x7D22;&#x3002;&#x91CD;&#x8981;&#x7684;&#x76EE;&#x6807;&#x662F;&#x90A3; 25 &#x4E2A;&#x5B57;&#x7B26;&#x7684;&#x8F93;&#x5165;&#x5217;&#x8868;&#xFF0C;&#x8FD8;&#x6709;&#x5C06;&#x4F1A;&#x88AB;&#x79FB;&#x9664;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x57FA;&#x672C;&#x7684;&#x6570;&#x636E;&#x91C7;&#x6837;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div></pre></td><td class="code"><pre><div class="line"># sample from the model now and then</div><div class="line">  if n % 100 == 0:</div><div class="line">    sample_ix = sample(hprev, inputs[0], 200)</div><div class="line">    txt = &apos;&apos;.join(ix_to_char[ix] for ix in sample_ix)</div><div class="line">    print &apos;----\n %s \n----&apos; % (txt, )</div></pre></td></tr></table></figure>
<p>&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4F4E;&#x5C42;&#x6B21;&#x5B57;&#x7B26;&#x548C;&#x6D4B;&#x8BD5;&#x65F6;&#x95F4;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4E00;&#x4E9B;&#x5B57;&#x7B26;&#xFF0C;&#x7136;&#x800C;&#x4ED6;&#x4EEC;&#x5E76;&#x4E0D;&#x662F;&#x90A3;&#x4E9B;&#x5728;&#x8FD9;&#x4E2A;&#x5E8F;&#x5217;&#x4E2D;&#x4E0B;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x7684;&#x5206;&#x5E03;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#x4ECE;&#x4ED6;&#x7684;&#x91C7;&#x6837;&#x5230;&#x4ED6;&#x5728;&#x5206;&#x5E03;&#x4E2D;&#x5F62;&#x6210;&#x4E0B;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E0D;&#x65AD;&#x7684;&#x91C7;&#x6837;&#xFF0C;&#x5E76;&#x4E14;&#x6301;&#x7EED;&#x4E0B;&#x53BB;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x4EFB;&#x610F;&#x7684;&#x6587;&#x672C;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5E76;&#x4E14;&#x751F;&#x6210;&#x4E86;&#x6837;&#x672C;&#x51FD;&#x6570;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div></pre></td><td class="code"><pre><div class="line"># forward seq_length characters through the net and fetch gradient</div><div class="line">  loss, dWxh, dWhh, dWhy, dbh, dby, hprev = lossFun(inputs, targets, hprev)</div><div class="line">  smooth_loss = smooth_loss * 0.999 + loss * 0.001</div><div class="line">  if n % 100 == 0: print &apos;iter %d, loss: %f&apos; % (n, smooth_loss) # print progress</div></pre></td></tr></table></figure>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6765;&#x8BF4;&#x4E00;&#x4E0B; loss function&#xFF08;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF09;&#xFF0C;&#x635F;&#x5931;&#x51FD;&#x6570;&#x63A5;&#x53D7;&#x8F93;&#x5165;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x5B83;&#x4E5F;&#x63A5;&#x53D7;H prep&#xFF0C;H prep &#x7684;&#x7F3A;&#x70B9;&#x5C31;&#x662F;&#x4ED6;&#x7684;&#x5F62;&#x72B6;&#x5411;&#x91CF;&#x6765;&#x81EA;&#x4E8E;&#x524D;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5757;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8981;&#x5206;&#x6279;&#x8FDB;&#x884C;25&#x4E2A;&#x5B57;&#x7B26;&#x7684;&#x533A;&#x5757;&#xFF0C;&#x5E76;&#x4E14;&#x6211;&#x4EEC;&#x8981;&#x8DDF;&#x8E2A;&#x5728; 25 &#x4E2A;&#x5B57;&#x7B26;&#x7ED3;&#x5C3E;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x60C5;&#x666F;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x5728;&#x5411;&#x540E;&#x4F20;&#x64AD;&#x76F8;&#x9047;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230; H &#x6700;&#x521D;&#x7684;&#x5F62;&#x6001;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div></pre></td><td class="code"><pre><div class="line"># perform parameter update with Adagrad</div><div class="line">  for param, dparam, mem in zip([Wxh, Whh, Why, bh, by], </div><div class="line">                                [dWxh, dWhh, dWhy, dbh, dby], </div><div class="line">                                [mWxh, mWhh, mWhy, mbh, mby]):</div><div class="line">    mem += dparam * dparam</div><div class="line">    param += -learning_rate * dparam / np.sqrt(mem + 1e-8) # adagrad update</div></pre></td></tr></table></figure>
<p>&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x786E;&#x4FDD;&#x9690;&#x85CF;&#x5C42;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x65B9;&#x5F0F;&#x5728;&#x533A;&#x5757;&#x4E4B;&#x95F4;&#x662F;&#x57FA;&#x672C;&#x4E0A;&#x6B63;&#x786E;&#x7684;&#x4F20;&#x64AD;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x53EA;&#x5411;&#x540E;&#x4F20;&#x64AD;&#x8FD9;&#x4E9B; 25 &#x6B21;&#xFF0C;&#x4E3A;&#x6B64;&#x6211;&#x4EEC;&#x6DFB;&#x52A0;&#x4E86;&#x635F;&#x5931;&#x51FD;&#x6570;&#x548C;&#x68AF;&#x5EA6;&#xFF0C;&#x8FD8;&#x6709;&#x6240;&#x6709;&#x7684;&#x6743;&#x91CD;&#x77E9;&#x9635;&#x548C;&#x65B9;&#x6846;&#xFF0C;&#x53EF;&#x4EE5;&#x8F93;&#x51FA;&#x635F;&#x5931;&#xFF0C;&#x7136;&#x540E;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x66F4;&#x65B0;&#xFF0C;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x8981;&#x66F4;&#x65B0;&#x6BD4;&#x8F83;&#x8001;&#x7684;&#x90E8;&#x5206;&#x3002;&#x6CE8;&#x610F;&#xFF1A;&#x8FD9;&#x91CC;&#x5171;&#x6709; 25 &#x4E2A; softmax &#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x8FD9; 25 &#x4E2A;&#x7AEF;&#x540C;&#x65F6;&#x8FDB;&#x884C;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#xFF0C;&#x6700;&#x540E;&#x5C06;&#x6240;&#x6C42;&#x68AF;&#x5EA6;&#x52A0;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x635F;&#x5931;&#x51FD;&#x6570;&#x662F;&#x8FD9;&#x4E00;&#x5757;&#x4EE3;&#x7801;&#xFF0C;&#x5B83;&#x5305;&#x542B;&#x4E86;&#x5411;&#x524D;&#x4F20;&#x64AD;&#x548C;&#x5411;&#x540E;&#x4F20;&#x64AD;&#x4E24;&#x90E8;&#x5206;&#x65B9;&#x6CD5;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6BD4;&#x8F83;&#x4E00;&#x4E0B;&#x5411;&#x524D;&#x4F20;&#x64AD;&#x548C;&#x5411;&#x540E;&#x4F20;&#x64AD;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div><div class="line">17</div></pre></td><td class="code"><pre><div class="line">def lossFun(inputs, targets, hprev):</div><div class="line">  &quot;&quot;&quot;</div><div class="line">  inputs,targets are both list of integers.</div><div class="line">  hprev is Hx1 array of initial hidden state</div><div class="line">  returns the loss, gradients on model parameters, and last hidden state</div><div class="line">  &quot;&quot;&quot;</div><div class="line">  xs, hs, ys, ps = {}, {}, {}, {}</div><div class="line">  hs[-1] = np.copy(hprev)</div><div class="line">  loss = 0</div><div class="line">  # forward pass</div><div class="line">  for t in xrange(len(inputs)):</div><div class="line">    xs[t] = np.zeros((vocab_size,1)) # encode in 1-of-k representation</div><div class="line">    xs[t][inputs[t]] = 1</div><div class="line">    hs[t] = np.tanh(np.dot(Wxh, xs[t]) + np.dot(Whh, hs[t-1]) + bh) # hidden state</div><div class="line">    ys[t] = np.dot(Why, hs[t]) + by # unnormalized log probabilities for next chars</div><div class="line">    ps[t] = np.exp(ys[t]) / np.sum(np.exp(ys[t])) # probabilities for next chars</div><div class="line">    loss += -np.log(ps[t][targets[t],0]) # softmax (cross-entropy loss)</div></pre></td></tr></table></figure>
<p>&#x5728;&#x5411;&#x524D;&#x4F20;&#x64AD;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x57FA;&#x672C;&#x8BA4;&#x8BC6;&#x5230;&#xFF0C;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x7684;&#x4E8F;&#x635F;&#x76EE;&#x6807;&#x548C;&#x6211;&#x4EEC;&#x88AB;&#x7B49;&#x5F85;&#x63A5;&#x53D7;&#x7684;&#x8FD9; 25 &#x4E2A;&#x7D22;&#x5F15;&#x5E76;&#x4E0D;&#x662F;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x4ED6;&#x4EEC;&#x7684;&#x4F20;&#x9012;&#x4ECE; 1 &#x5230; 25&#xFF0C;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E86;&#x6587;&#x672C;&#x7684;&#x8F93;&#x5165;&#x5411;&#x91CF;&#xFF0C;&#x867D;&#x7136;&#x53EA;&#x662F;&#x4E00;&#x4E9B; 0&#xFF0C;&#x5E76;&#x4E14;&#x6211;&#x4EEC;&#x8BBE;&#x7F6E;&#x4E86;&#x4E00;&#x4E2A; one-hot &#x7F16;&#x7801;&#xFF0C;&#x65E0;&#x8BBA;&#x4ED6;&#x7684;&#x6307;&#x6570;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x5B83;&#x96C6;&#x6210;&#x4E00;&#x4E2A;&#x7F16;&#x7801;&#x3002;&#x5728;&#x8BA1;&#x7B97;&#x4E2D;&#xFF0C;&#x5FAA;&#x73AF;&#x516C;&#x5F0F;&#x7528;&#x7684;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x65B9;&#x7A0B;&#x3002;hs[t]&#xFF0C;&#x5728;&#x8FD9;&#x91CC; h &#x5C31;&#x662F;&#x8DDF;&#x8E2A;&#x4E0D;&#x540C;&#x6B65;&#x9AA4;&#x4E2D;&#x7ED3;&#x679C;&#x7684;&#x91CF;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x5FAA;&#x73AF;&#x516C;&#x5F0F;&#x8BA1;&#x7B97;&#x9690;&#x542B;&#x5C42;&#x7684;&#x5411;&#x91CF;&#x4EE5;&#x53CA;&#x8F93;&#x51FA;&#x5411;&#x91CF;&#x3002;&#x63A5;&#x7740;&#x4F7F;&#x7528; softmax &#x516C;&#x5F0F;&#xFF0C;&#x5F97;&#x5230;&#x5F52;&#x4E00;&#x5316;&#x7684;&#x6982;&#x7387;&#xFF0C;&#x635F;&#x5931;&#x503C;&#x5219;&#x7B49;&#x4E8E; -log&#xFF08;&#x6B63;&#x786E;&#x7C7B;&#x7684;&#x6982;&#x7387;&#xFF09;&#x3002;</p>
<p><img src="/2017/11/01/&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;-RNN/16.png" alt=""></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div><div class="line">17</div><div class="line">18</div></pre></td><td class="code"><pre><div class="line"># backward pass: compute gradients going backwards</div><div class="line">  dWxh, dWhh, dWhy = np.zeros_like(Wxh), np.zeros_like(Whh), np.zeros_like(Why)</div><div class="line">  dbh, dby = np.zeros_like(bh), np.zeros_like(by)</div><div class="line">  dhnext = np.zeros_like(hs[0])</div><div class="line">  for t in reversed(xrange(len(inputs))):</div><div class="line">    dy = np.copy(ps[t])</div><div class="line">    dy[targets[t]] -= 1 # backprop into y. see http://cs231n.github.io/neural-networks-case-study/#grad if confused here</div><div class="line">    dWhy += np.dot(dy, hs[t].T)</div><div class="line">    dby += dy</div><div class="line">    dh = np.dot(Why.T, dy) + dhnext # backprop into h</div><div class="line">    dhraw = (1 - hs[t] * hs[t]) * dh # backprop through tanh nonlinearity</div><div class="line">    dbh += dhraw</div><div class="line">    dWxh += np.dot(dhraw, xs[t].T)</div><div class="line">    dWhh += np.dot(dhraw, hs[t-1].T)</div><div class="line">    dhnext = np.dot(Whh.T, dhraw)</div><div class="line">  for dparam in [dWxh, dWhh, dWhy, dbh, dby]:</div><div class="line">    np.clip(dparam, -5, 5, out=dparam) # clip to mitigate exploding gradients</div><div class="line">  return loss, dWxh, dWhh, dWhy, dbh, dby, hs[len(inputs)-1]</div></pre></td></tr></table></figure>
<p>&#x5728;&#x5411;&#x540E;&#x4F20;&#x64AD;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x7B2C; 25 &#x5C42;&#x7A7F;&#x8FC7;&#x9690;&#x85CF;&#x5C42;&#xFF0C;&#x76F4;&#x5230;&#x7B2C;&#x4E00;&#x5C42;&#xFF0C;&#x4F60;&#x6216;&#x8BB8;&#x5DF2;&#x7ECF;&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#x6211;&#x9700;&#x8981;&#x5904;&#x7406;&#x591A;&#x5C11;&#x7EC6;&#x8282;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x91CC;&#x53CD;&#x5411;&#x901A;&#x8FC7;&#x4E86;&#x4E00;&#x4E2A; softmax &#x51FD;&#x6570;&#xFF0C;&#x53CD;&#x5411;&#x901A;&#x8FC7;&#x4E86;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x5BF9;&#x6240;&#x6709;&#x7684;&#x68AF;&#x5EA6;&#x548C;&#x53C2;&#x6570;&#x8FDB;&#x884C;&#x52A0;&#x548C;&#x3002;&#x503C;&#x5F97;&#x4E00;&#x63D0;&#x7684;&#x662F;&#xFF0C;&#x68AF;&#x5EA6;&#x662F;&#x4E0E;&#x6743;&#x503C;&#x540C;&#x5C3A;&#x5BF8;&#x7684;&#x7684;&#x77E9;&#x9635;&#xFF0C;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x4F7F;&#x7528;&#x4E86; &#x201C;+=&#x201D;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x8FC7;&#x7A0B;&#x4E2D;&#x6743;&#x503C;&#x77E9;&#x9635;&#x4F1A;&#x6C42;&#x5F97;&#x591A;&#x4E2A;&#x68AF;&#x5EA6;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;&#x8FD9;&#x4E9B;&#x68AF;&#x5EA6;&#x53E0;&#x52A0;&#x8D77;&#x6765;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5411;&#x524D;&#x7684;&#x6BCF;&#x4E00;&#x6B65;&#x90FD;&#x7528;&#x5230;&#x4E86;&#x6743;&#x503C;&#x77E9;&#x9635;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x53CD;&#x5411;&#x6C42;&#x5BFC;&#x662F;&#x4E5F;&#x8981;&#x4E0D;&#x65AD;&#x7684;&#x53E0;&#x52A0;&#x68AF;&#x5EA6;&#x3002;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x6C42;&#x51FA;&#x4E86;&#x68AF;&#x5EA6;&#xFF0C;&#x73B0;&#x5728;&#x5C31;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x635F;&#x5931;&#x51FD;&#x6570;&#x5BF9;&#x521D;&#x503C;&#x8FDB;&#x884C;&#x66F4;&#x65B0;&#x4E86;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div><div class="line">17</div></pre></td><td class="code"><pre><div class="line">def sample(h, seed_ix, n):</div><div class="line">  &quot;&quot;&quot; </div><div class="line">  sample a sequence of integers from the model </div><div class="line">  h is memory state, seed_ix is seed letter for first time step</div><div class="line">  &quot;&quot;&quot;</div><div class="line">  x = np.zeros((vocab_size, 1))</div><div class="line">  x[seed_ix] = 1</div><div class="line">  ixes = []</div><div class="line">  for t in xrange(n):</div><div class="line">    h = np.tanh(np.dot(Wxh, x) + np.dot(Whh, h) + bh)</div><div class="line">    y = np.dot(Why, h) + by</div><div class="line">    p = np.exp(y) / np.sum(np.exp(y))</div><div class="line">    ix = np.random.choice(range(vocab_size), p=p.ravel())</div><div class="line">    x = np.zeros((vocab_size, 1))</div><div class="line">    x[ix] = 1</div><div class="line">    ixes.append(ix)</div><div class="line">  return ixes</div></pre></td></tr></table></figure>
<p>&#x6700;&#x540E;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x6709;&#x4E2A;&#x91C7;&#x6837;&#x65B9;&#x6CD5;&#x3002;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x57FA;&#x4E8E;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x8BAD;&#x7EC3;&#x51FA;&#x6765;&#x7684;&#x6A21;&#x578B;&#xFF08;&#x5982;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x8854;&#x63A5;&#xFF09;&#x6765;&#x751F;&#x6210;&#x65B0;&#x7684;&#x6587;&#x672C;&#x3002;&#x6211;&#x4EEC;&#x968F;&#x673A;&#x83B7;&#x5F97;&#x4E00;&#x4E9B;&#x5B57;&#x7B26;&#xFF0C;&#x5E76;&#x7528;&#x8BAD;&#x7EC3;&#x597D;&#x7684;&#x6A21;&#x578B;&#x5BF9;&#x8FD9;&#x4E2A;&#x5B57;&#x7B26;&#x8FDB;&#x884C;&#x6269;&#x5C55;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x5FAA;&#x73AF;&#x516C;&#x5F0F;&#xFF0C;&#x83B7;&#x5F97;&#x5B57;&#x7B26;&#x7684;&#x6982;&#x7387;&#x5206;&#x5E03;&#xFF0C;&#x7136;&#x540E;&#x4ECE;&#x4E2D;&#x53D6;&#x6837;&#xFF0C;&#x53D6;&#x51FA;&#x6700;&#x6709;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;&#x5B57;&#x7B26;&#x3002;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x53D6;&#x4E0B;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x4F9D;&#x6B21;&#x8FED;&#x4EE3;&#xFF0C;&#x76F4;&#x5230;&#x6211;&#x4EEC;&#x83B7;&#x5F97;&#x8DB3;&#x591F;&#x957F;&#x7684;&#x6587;&#x672C;&#x3002;</p>
<p>&#x5171;&#x6709; 25 &#x4E2A; softmax &#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x8FD9; 25 &#x4E2A;&#x7AEF;&#x540C;&#x65F6;&#x8FDB;&#x884C;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x6240;&#x6C42;&#x68AF;&#x5EA6;&#x52A0;&#x8D77;&#x6765;</p>
<p><a href="https://gist.github.com/karpathy/d4dee566867f8291f086" target="_blank" rel="external">&#x6E90;&#x7801;&#x5730;&#x5740;</a></p>
<h2 id="&#x8BAD;&#x7EC3;&#x6210;&#x679C;"><a href="#&#x8BAD;&#x7EC3;&#x6210;&#x679C;" class="headerlink" title="&#x8BAD;&#x7EC3;&#x6210;&#x679C;"></a>&#x8BAD;&#x7EC3;&#x6210;&#x679C;</h2><p>&#x4E0B;&#x9762;&#x662F; Andrej Karpathy &#x548C; Justin Johnson &#x505A;&#x7684;&#x4E00;&#x4E9B;&#x8BAD;&#x7EC3;&#x3002;</p>
<p>&#x4ED6;&#x4EEC;&#x7528; Char-RNN &#x53BB;&#x5B66;&#x4E60;&#x4E00;&#x4E9B;&#x6587;&#x672C;&#xFF0C;RNN &#x53BB;&#x8BFB;&#x8FD9;&#x4E9B;&#x6587;&#x672C;&#x3001;&#x5C0F;&#x6BB5;&#x4EE3;&#x7801;&#xFF0C;&#x6211;&#x4EEC;&#x6CE8;&#x610F;&#x5230;&#x67D0;&#x4E9B;&#x7279;&#x5B9A;&#x7684;&#x5355;&#x5143;&#x4EE5;&#x53CA; RNN &#x9690;&#x85CF;&#x5C42;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x989C;&#x8272;&#x6765;&#x6807;&#x6CE8;&#x8FD9;&#x4E9B;&#x5355;&#x5143;&#xFF0C;&#x6765;&#x8868;&#x793A;&#x8FD9;&#x4E9B;&#x5355;&#x5143;&#x662F;&#x5426;&#x201C;&#x5174;&#x594B;&#x201D;&#x3002;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x9690;&#x85CF;&#x5C42;&#x7684;&#x72B6;&#x6001;&#x5F88;&#x96BE;&#x53BB;&#x7406;&#x89E3;&#xFF0C;&#x4ED6;&#x4EEC;&#x65F6;&#x800C;&#x5174;&#x594B;&#x65F6;&#x800C;&#x6C89;&#x9ED8;&#xFF0C;&#x663E;&#x5F97;&#x5F88;&#x5947;&#x602A;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x5173;&#x6CE8;&#x7684;&#x662F;&#x5B57;&#x7B26;&#x7EA7;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x4F8B;&#x5982;&#x5728; ah &#x4E4B;&#x540E;&#x63A5; e &#x7684;&#x60C5;&#x51B5;&#x6709;&#x591A;&#x5C11;&#x7B49;&#x3002;</p>
<p><img src="/2017/11/01/&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;-RNN/14.png" alt=""></p>
<p>&#x4F46;&#x662F;&#x6709;&#x4E9B;&#x5355;&#x5143;&#x8868;&#x8FBE;&#x7684;&#x4FE1;&#x606F;&#x662F;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x7684;&#x3002;&#x5BF9;&#x4E8E;&#x50CF;&#x5F15;&#x53F7;&#x68C0;&#x6D4B;&#x8FD9;&#x6837;&#x7684;&#x5355;&#x5143;&#x800C;&#x8A00;&#xFF0C;&#x5F53;&#x524D;&#x4E00;&#x4E2A;&#x5F15;&#x53F7;&#x51FA;&#x73B0;&#xFF0C;&#x5B83;&#x4EEC;&#x5373;&#x5904;&#x4E8E;&#x201C;&#x5F00;&#x542F;&#x72B6;&#x6001;&#x201D;&#xFF0C;&#x4E00;&#x76F4;&#x5230;&#x540E;&#x4E00;&#x4E2A;&#x5F15;&#x53F7;&#x51FA;&#x73B0;&#x3002;&#x8DDF;&#x8E2A;&#x8FD9;&#x6837;&#x7684;&#x5355;&#x5143;&#x6BD4;&#x8F83;&#x53EF;&#x9760;&#xFF0C;&#x8FD9;&#x662F;&#x4ECE;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x4E2D;&#x5F97;&#x5230;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x5F88;&#x660E;&#x663E;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x7EA7;&#x6A21;&#x578B;&#xFF0C;&#x5F15;&#x5BFC;&#x5185;&#x5916;&#x4FE1;&#x53F7;&#x5F3A;&#x5EA6;&#x7684;&#x5DEE;&#x522B;&#x5F88;&#x5927;&#xFF0C;&#x8FD9;&#x662F;&#x503C;&#x5F97;&#x5B66;&#x4E60;&#x7684;&#x6709;&#x7528;&#x7279;&#x5F81;&#xFF0C;&#x4E8E;&#x662F; RNN &#x7528;&#x4E00;&#x90E8;&#x5206;&#x9690;&#x85CF;&#x5C42;&#x6765;&#x5BF9;&#x5F15;&#x53F7;&#x8FDB;&#x884C;&#x8DDF;&#x8E2A;&#xFF0C;&#x4EE5;&#x5206;&#x8FA8;&#x76EE;&#x524D;&#x662F;&#x5728;&#x5F15;&#x53F7;&#x4E2D;&#x8FD8;&#x662F;&#x5F15;&#x53F7;&#x5916;&#x3002;</p>
<p><img src="/2017/11/01/&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;-RNN/15.png" alt=""></p>
<p>&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x91CC;&#x7684; RNN &#x4F7F;&#x7528;&#x4E86;&#x5305;&#x542B; 100 &#x4E2A;&#x5B57;&#x7B26;&#x7684;&#x5E8F;&#x5217;&#x8FDB;&#x884C;&#x5B66;&#x4E60;&#xFF0C;&#x5373;&#x6211;&#x4EEC;&#x53EA;&#x5728; 100 &#x5C42;&#x4E0A;&#x8FDB;&#x884C;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#xFF0C;&#x8FD9; 100 &#x5C42;&#x624D;&#x662F;&#x8FD9;&#x4E2A;&#x5355;&#x5143;&#x7684;&#x5B66;&#x4E60;&#x533A;&#x95F4;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4E0D;&#x77E5;&#x9053;&#x957F;&#x4E8E; 100 &#x5B57;&#x7B26;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x91CC;&#x7684;&#x5F15;&#x53F7;&#x4E4B;&#x95F4;&#x7684;&#x957F;&#x5EA6;&#x660E;&#x663E;&#x5927;&#x4E8E; 100&#xFF0C;&#x8FD9;&#x4E2A;&#x60C5;&#x51B5;&#x8868;&#x660E;&#x4F60;&#x53EF;&#x4EE5;&#x5BF9;&#x5C0F;&#x4E8E; 100 &#x957F;&#x5EA6;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x60C5;&#x51B5;&#x5408;&#x7406;&#x7684;&#x63A8;&#x5E7F;&#x5230;&#x66F4;&#x957F;&#x7684;&#x5E8F;&#x5217;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x957F;&#x5EA6;&#x957F;&#x4E8E; 100 &#x5B57;&#x7B26;&#x7684;&#x5E8F;&#x5217;&#xFF0C;&#x6A21;&#x578B;&#x4F9D;&#x7136;&#x6709;&#x6548;</p>
<h2 id="&#x8865;&#x5145;"><a href="#&#x8865;&#x5145;" class="headerlink" title="&#x8865;&#x5145;"></a>&#x8865;&#x5145;</h2><ul>
<li>&#x5728; RNN &#x4E2D;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x4F7F;&#x7528;&#x6B63;&#x5219;&#x5316;&#xFF1F;</li>
</ul>
<p>&#x56E0;&#x4E3A;&#x5728; RNN &#x4E2D;&#x4F7F;&#x7528;&#x6B63;&#x5219;&#x5316;&#x5E76;&#x4E0D;&#x5E38;&#x89C1;&#xFF0C;&#x751A;&#x81F3;&#x6709;&#x65F6;&#x5019;&#x6B63;&#x5219;&#x5316;&#x53CD;&#x800C;&#x4F1A;&#x5F97;&#x51FA;&#x66F4;&#x5DEE;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x6709;&#x65F6;&#x5019;&#x4E0D;&#x8003;&#x8651;&#x4ED6;&#xFF0C;&#x4ED6;&#x5C5E;&#x4E8E;&#x4E00;&#x79CD;&#x8D85;&#x53C2;&#x6570;</p>
<p>===</p>
<ul>
<li>&#x6211;&#x4EEC;&#x662F;&#x5426;&#x8981;&#x53BB;&#x5B66;&#x4E60;&#x8FD9;&#x4E9B;&#x8F93;&#x5165;&#x7684;&#x5355;&#x8BCD;&#x672C;&#x8EAB;&#x542B;&#x4E49;&#xFF1F;</li>
</ul>
<p>&#x5BF9;&#x4E8E;&#x8FD9; 25 &#x4E2A;&#x8FDE;&#x7EED;&#x7684;&#x5355;&#x8BCD;&#xFF0C;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x5173;&#x5FC3;&#x4E00;&#x4E2A;&#x8BCD;&#x662F;&#x5426;&#x5B58;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x5173;&#x5FC3;&#x7684;&#x662F;&#x5B57;&#x7B26;&#x6240;&#x5904;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x4E2D;&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x5B57;&#x7B26;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x8BED;&#x8A00;&#xFF0C;&#x6A21;&#x578B;&#x6240;&#x5B66;&#x4E60;&#x7684;&#x662F;&#x5B57;&#x7B26;&#x7684;&#x5E8F;&#x5217;</p>
<p>===</p>
<p>&#x7ECF;&#x8FC7;&#x8BAD;&#x7EC3;&#x540E;&#x7684; RNN &#x5F88;&#x5C11;&#x4F1A;&#x72AF;&#x8BED;&#x6CD5;&#x9519;&#x8BEF;&#xFF0C;&#x6BD4;&#x5982;&#x62EC;&#x53F7;&#x7684;&#x5339;&#x914D;&#x4E00;&#x7C7B;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x6240;&#x751F;&#x6210;&#x7684;&#x6587;&#x7AE0;&#x7684;&#x610F;&#x601D;&#x4F1A;&#x968F;&#x7740;&#x8BAD;&#x7EC3;&#x7684;&#x8FDB;&#x884C;&#x800C;&#x9010;&#x6E10;&#x660E;&#x6717;&#x3002;</p>

      
    </div><!-- .entry-content -->

    <footer class="entry-meta">
    <a href="/2017/11/01/循环神经网络-RNN/">
    <time datetime="2017-10-31T17:47:43.000Z" class="entry-date">
        2017-11-01
    </time>
</a>
    
  <span class="article-delim">&#8226;</span>
  <div class="article-category">
  <a class="article-category-link" href="/categories/ML/">ML</a>
  </div>

    
  <span class="article-delim">&#8226;</span>
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/Neural-Networks/">Neural Networks</a></li></ul>

    </footer>
</article>


    
<nav class="nav-single">
    <h3 class="assistive-text">文章导航</h3>
    
    
        <span class="nav-next"><a href="/2017/10/31/CNN之定位检测/" rel="next">卷积神经网络之定位检测 <span class="meta-nav">→</span></a></span>
    
</nav><!-- .nav-single -->







</div></div>
        <div id="secondary" class="widget-area" role="complementary">
  
    <aside id="search" class="widget widget_search"><form role="search" method="get" accept-charset="utf-8" id="searchform" class="searchform" action="//google.com/search">
    <div>
        <input type="text" value="" name="s" id="s" />
        <input type="submit" id="searchsubmit" value="搜索" />
    </div>
</form></aside>
  
    
  
    
  <aside class="widget">
    <h3 class="widget-title">Categories</h3>
    <div class="widget-content">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/LIFE/">LIFE</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/MAC/">MAC</a><span class="category-list-count">3</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/ML/">ML</a><span class="category-list-count">24</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/PGM/">PGM</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/iOS/">iOS</a><span class="category-list-count">22</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/御宅文化/">御宅文化</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/编程/">编程</a><span class="category-list-count">58</span></li></ul>
    </div>
  </aside>

  
    
<div class="widget tag">
<h3 class="title">blogroll</h3>
<ul class="entry">


<li><a href="https://github.com/" target="_blank">我的github</a></li>


<li><a href="http://www.jianshu.com/users/41cd7711ed44/latest_articles" target="_blank">我的简书主页</a></li>


<li><a href="http://uuzdaisuki.com" target="_blank">leticia’s blog</a></li>


<li><a href="http://www.helloyzy.cn" target="_blank">acery</a></li>


<li><a href="http://wxjackie.com" target="_blank">WXJACKIE</a></li>


<li><a href="http://www.stephenzhang.me" target="_blank">stephenzhang</a></li>


<li><a href="blog.keybrl.com" target="_blank">keybrl</a></li>


<li><a href="http://www.ciaran.cn/" target="_blank">Ciaran</a></li>

</ul>
</div>

  
    
  <aside class="widget">
    <h3 class="widget-title">Recents</h3>
    <div class="widget-content">
      <ul>
        
          <li>
            <a href="/2017/11/01/循环神经网络-RNN/">循环神经网络_RNN</a>
          </li>
        
          <li>
            <a href="/2017/10/31/CNN之定位检测/">卷积神经网络之定位检测</a>
          </li>
        
          <li>
            <a href="/2017/10/27/CNN-Structure-2/">CNN_Structure_2</a>
          </li>
        
          <li>
            <a href="/2017/10/25/CNN-Structure/">CNN Structure -- 1</a>
          </li>
        
          <li>
            <a href="/2017/10/16/MapReduce-RDBMs/">MapReduce VS RDBMs</a>
          </li>
        
      </ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Tags</h3>
    <div class="widget-content">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/Cloud-Computing/">Cloud Computing</a><span class="tag-list-count">3</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Cocoapods/">Cocoapods</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/HTML/">HTML</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Linux/">Linux</a><span class="tag-list-count">15</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Machine-Learning/">Machine Learning</a><span class="tag-list-count">17</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Matlab/">Matlab</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Neural-Networks/">Neural Networks</a><span class="tag-list-count">4</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Probabilistic-Graphical-Models/">Probabilistic Graphical Models</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIColor/">UIColor</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView/">UIView</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView-圆角/">UIView-圆角</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Vim/">Vim</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/bug/">bug</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/hexo/">hexo</a><span class="tag-list-count">4</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/openCV/">openCV</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/二维码/">二维码</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/指针/">指针</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/操作系统/">操作系统</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/数据库/">数据库</a><span class="tag-list-count">3</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/数据结构/">数据结构</a><span class="tag-list-count">20</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/算法/">算法</a><span class="tag-list-count">9</span></li></ul>
    </div>
  </aside>

  
</div>
      </div>
      <footer id="colophon" role="contentinfo">
    <p>&copy; 2017 SaberDa
    All rights reserved.</p>
    <p>Powered by <a href="http://hexo.io/" target="_blank">Hexo</a></p>
</footer>
    <script>window._bd_share_config={"common":{"bdSnsKey":{},"bdText":"","bdMini":"1","bdMiniList":false,"bdPic":"","bdStyle":"2","bdSize":"16"},"share":{}};with(document)0[(getElementsByTagName('head')[0]||body).appendChild(createElement('script')).src='http://bdimg.share.baidu.com/static/api/js/share.js?v=89860593.js?cdnversion='+~(-new Date()/36e5)];</script>

<script src="/js/jquery-2.0.3.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

<script src="/js/navigation.js"></script>

<div id="bg"></div>

  </div>
</body>
</html>