<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  
  <meta name="description" content="一个神奇的地方" />
  

  
  
  
  
  
  
  <title>SaberDa的幻想乡</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="一个神奇的地方">
<meta property="og:type" content="website">
<meta property="og:title" content="SaberDa的幻想乡">
<meta property="og:url" content="https://saberda.github.io/page/3/index.html">
<meta property="og:site_name" content="SaberDa的幻想乡">
<meta property="og:description" content="一个神奇的地方">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="SaberDa的幻想乡">
<meta name="twitter:description" content="一个神奇的地方">
  
  
    <link rel="icon" href="/css/images/favicon.ico">
  
  <link rel="stylesheet" href="/css/style.css">
  

  
  <!-- baidu webmaster push -->
  <script src='//push.zhanzhang.baidu.com/push.js'></script>
</head>
<body class="home blog custom-background custom-font-enabled single-author">
  <div id="page" class="hfeed site">
      <header id="masthead" class="site-header" role="banner">
    <hgroup>
      <h1 class="site-title">
        <a href="/" title="SaberDa的幻想乡" rel="home">SaberDa的幻想乡</a>
      </h1>
      
        <h2 class="site-description">
          <a href="/" id="subtitle">iOS |　　Mac　　|　　二次元　　|　　最近喜欢上了一个妹子～</a>
        </h2>
      
    </hgroup>

    <nav id="site-navigation" class="main-navigation" role="navigation">
            <button class="menu-toggle">菜单</button>
            <a class="assistive-text" href="/#content" title="跳至内容">跳至内容</a><!--TODO-->
            <div class="menu-main-container">
                <ul id="menu-main" class="nav-menu">
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/archives">所有文章</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/">主页</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/编程/">编程</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/iOS/">iOS</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/MAC/">MAC</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/御宅文化/">御宅文化</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/LIFE/">LIFE</a></li>
                
                </ul>
            </div>
    </nav>
</header>
      <div id="main" class="wrapper">
        <div id="primary" class="site-content"><div id="content" role="main">
  
    <article id="post-First-day-in-Europe" class="post-First-day-in-Europe post type-post status-publish format-standard hentry">
    <!---->

      <header class="entry-header">
        
        
  
    <h1 class="entry-title">
      <a class="article-title" href="/2016/07/22/First-day-in-Europe/">阿姆斯特丹--旧世纪的浪漫</a>
    </h1>
  

        
        <div class="comments-link">
            
            <a href="javascript:void(0);" data-url="https://saberda.github.io/2016/07/22/First-day-in-Europe/" data-id="citjybtrh000ab9b3ayeuzusf" class="leave-reply bdsharebuttonbox" data-cmd="more">Share</a>
        </div><!-- .comments-link -->
      </header><!-- .entry-header -->

    <div class="entry-content">
      
        <h2 id="First-day-in-Europe"><a href="#First-day-in-Europe" class="headerlink" title="First_day_in_Europe"></a>First_day_in_Europe</h2><pre><code>&#x4ECE;&#x65F6;&#x95F4;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x4ECA;&#x5929;&#x662F;&#x5230;&#x6B27;&#x6D32;&#x7684;&#x7B2C;&#x4E8C;&#x5929;&#xFF0C;&#x4F46;&#x662F;&#x6628;&#x5929;&#x6309;&#x9053;&#x7406;&#x6765;&#x8BB2;&#x5E94;&#x8BE5;&#x7B97;&#x662F;&#x884C;&#x7A0B;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5C31;&#x5F3A;&#x884C;&#x7B2C;&#x4E00;&#x5929;&#x4E86;&#x3002;
</code></pre><p>&#x6628;&#x5929;&#x4ECE;&#x673A;&#x573A;&#x51FA;&#x53D1;&#x5230;&#x6211;&#x5728;&#x8377;&#x5170;&#x7684;&#x5C45;&#x6240;&#x65F6;&#x2013;&#x6211;&#x7684;&#x4E8C;&#x59E8;&#x5BB6;&#xFF0C;&#x5DF2;&#x7ECF;&#x662F;&#x5F53;&#x5730;&#x65F6;&#x95F4;5&#x70B9;&#x5DE6;&#x53F3;&#x4E86;&#x3002;&#x7531;&#x4E8E;&#x8BCA;&#x6240;&#x7684;&#x60A3;&#x8005;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x5148;&#x548C;Edwin(&#x6211;&#x4E8C;&#x59E8;&#x592B;)&#x5171;&#x8FDB;&#x4E86;&#x665A;&#x9910;&#x3002;</p>
<p>&#x5728;&#x6B64;&#x4E4B;&#x524D;&#xFF0C;&#x987A;&#x4FBF;&#x53C2;&#x89C2;&#x4E86;&#x4E00;&#x4E0B;&#x623F;&#x5B50;&#xFF0C;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4E09;&#x5C42;&#x5C0F;&#x522B;&#x5885;&#x9644;&#x5E26;&#x4E00;&#x4E2A;&#x5730;&#x4E0B;&#x505C;&#x8F66;&#x5E93;&#xFF0C;&#x5728;&#x5C4B;&#x5B50;&#x540E;&#x9762;&#x6709;&#x4E00;&#x4E2A;&#x540E;&#x82B1;&#x56ED;&#xFF0C;&#x91CC;&#x9762;&#x653E;&#x6EE1;&#x4E86;Abgelique&#x7684;&#x73A9;&#x5177;&#x3002;</p>
<p>&#x5403;&#x5B8C;&#x665A;&#x9910;&#x540E;&#xFF0C;&#x5929;&#x8FD8;&#x6CA1;&#x6709;&#x9ED1;&#xFF0C;&#x6211;&#x4EEC;&#x51B3;&#x5B9A;&#x51FA;&#x53BB;&#x5728;&#x623F;&#x5B50;&#x5468;&#x56F4;&#x8F6C;&#x4E00;&#x8F6C;&#x3002;&#x5468;&#x56F4;&#x7684;&#x666F;&#x8272;&#x5F88;&#x7F8E;&#xFF0C;&#x771F;&#x7684;&#x5F88;&#x7F8E;&#xFF0C;&#x623F;&#x5B50;&#x6B63;&#x5BF9;&#x9762;&#x4E0D;&#x8FDC;&#x5904;&#x5C31;&#x662F;&#x4E00;&#x6761;&#x4E0D;&#x5BBD;&#x4F46;&#x662F;&#x6C34;&#x5F88;&#x6E05;&#x6F88;&#x7684;&#x5C0F;&#x6CB3;&#xFF0C;&#x6CB3;&#x4E2D;&#x9760;&#x5CB8;&#x8FB9;&#x505C;&#x653E;&#x7740;&#x5F88;&#x591A;&#x522B;&#x4EBA;&#x5BB6;&#x7684;&#x5C0F;&#x8239;&#xFF0C;&#x6CB3;&#x4E0A;&#x53C8;&#x6709;&#x6210;&#x7FA4;&#x7684;&#x9E2D;&#x4E0E;&#x9E45;&#x5728;&#x6E38;&#x5F0B;&#x3002;</p>
<p><img src="/2016/07/22/First-day-in-Europe/6.JPG" alt=""></p>
<p><img src="/2016/07/22/First-day-in-Europe/10.JPG" alt=""></p>
<p>&#x4E0A;&#x9762;&#x90A3;&#x5F20;&#x7167;&#x7247;&#x91CC;&#x8FDC;&#x5904;&#x662F;&#x4E00;&#x8258;&#x76AE;&#x5212;&#x8247;&#xFF0C;&#x662F;&#x7684;&#xFF0C;&#x5728;&#x8FD9;&#x6761;&#x6CB3;&#x7684;&#x4E0A;&#x6E38;&#x6709;&#x4E00;&#x4E2A;&#x76AE;&#x5212;&#x8247;&#x4FF1;&#x4E50;&#x90E8;&#xFF0C;&#x7ECF;&#x8FC7;&#x54A8;&#x8BE2;&#xFF0C;&#x5E73;&#x5E38;&#x6709;&#x5F88;&#x591A;&#x7684;&#x76AE;&#x5212;&#x8247;&#x7231;&#x597D;&#x8005;&#x5728;&#x8FD9;&#x91CC;&#x5212;&#x8239;&#x3002;</p>
<p>&#x6CB3;&#x4E24;&#x5CB8;&#x662F;&#x81EA;&#x884C;&#x8F66;&#x9053;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x4F9B;&#x884C;&#x4EBA;&#x884C;&#x8D70;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5728;&#x5CB8;&#x65C1;&#x6563;&#x6B65;&#x65F6;&#xFF0C;&#x6709;&#x4E2A;&#x5916;&#x56FD;&#x5C0F;&#x54E5;&#x8D70;&#x8FC7;&#x6765;&#x95EE;&#x6211;&#x4EEC;&#xFF0C;&#x6765;&#x4E00;&#x8D77;Pokemon Go&#x554A;&#xFF01;&#x56E0;&#x4E3A;&#x6211;&#x8BA4;&#x4E3A;Pokemon Go&#x4E27;&#x5931;&#x4E86;&#x4E00;&#x4E2A;&#x4F5C;&#x4E3A;&#x53E3;&#x888B;&#x5996;&#x602A;&#x6E38;&#x620F;&#x8BE5;&#x6709;&#x7684;&#x4E50;&#x8DA3;&#xFF0C;&#x5A49;&#x62D2;&#x4E86;&#x5C0F;&#x54E5;&#x7684;&#x9080;&#x8BF7;&#xFF0C;&#x987A;&#x4FBF;&#x4E00;&#x63D0;&#x7684;&#x662F;&#x8FD9;&#x4E2A;&#x5916;&#x56FD;&#x5C0F;&#x54E5;&#x8D64;&#x88F8;&#x7740;&#x4E0A;&#x8EAB;&#xFF0C;&#x90A3;&#x4E00;&#x8EAB;&#x7684;&#x808C;&#x8089;&#x554A;&#xFF0C;&#x5567;&#x5567;&#x5567;&#xFF0C;&#x5E78;&#x597D;&#x54E5;&#x662F;&#x76F4;&#x7537;&#xFF0C;&#x55EF;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5728;&#x6CB3;&#x5BF9;&#x5CB8;&#x53D1;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;&#x4E8E;&#x539F;&#x59CB;&#x68EE;&#x6797;&#x7684;&#x5C0F;&#x516C;&#x56ED;&#xFF0C;&#x8BF4;&#x662F;&#x5C0F;&#x4F46;&#x662F;&#x5176;&#x5B9E;&#x4E00;&#x70B9;&#x90FD;&#x4E0D;&#x5C0F;&#xFF0C;&#x6211;&#x4E0A;&#x6B21;&#x770B;&#x89C1;&#x8FD9;&#x4E48;&#x8302;&#x76DB;&#x7684;&#x6811;&#x6797;&#x8FD8;&#x662F;&#x5728;&#x957F;&#x767D;&#x5C71;&#xFF0C;&#x771F;&#x7684;&#x3002;</p>
<p><img src="/2016/07/22/First-day-in-Europe/17.JPG" alt=""></p>
<p><img src="/2016/07/22/First-day-in-Europe/20.JPG" alt=""></p>
<p>&#x5728;&#x5916;&#x9762;&#x6E9C;&#x8FBE;&#x4E86;&#x4E00;&#x4E2A;&#x5C0F;&#x65F6;&#x5DE6;&#x53F3;&#x5C31;&#x56DE;&#x5BB6;&#x4E86;&#xFF0C;&#x6536;&#x62FE;&#x6536;&#x62FE;&#x884C;&#x674E;&#x5C31;&#x63A5;&#x8FD1;&#x665A;&#x4E0A;8&#x70B9;&#x4E86;&#xFF0C;&#x5E94;&#x8BE5;&#x662F;&#x9AD8;&#x7EAC;&#x5EA6;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x590F;&#x5B63;&#x6709;&#x6BD4;&#x8F83;&#x660E;&#x663E;&#x7684;&#x6781;&#x663C;&#x73B0;&#x8C61;&#xFF0C;&#x5916;&#x9762;&#x7684;&#x9633;&#x5149;&#x5F3A;&#x5EA6;&#x8DDF;&#x56FD;&#x5185;&#x4E0B;&#x5348;3&#x3001;4&#x70B9;&#x5DE6;&#x53F3;&#x7684;&#x5DEE;&#x4E0D;&#x591A;&#x3002;&#x6211;&#x65E0;&#x6240;&#x4E8B;&#x4E8B;&#x7684;&#x8EBA;&#x5728;&#x5E8A;&#x4E0A;&#x901B;b&#x7AD9;&#xFF0C;&#x672C;&#x610F;&#x60F3;&#x5728;qq&#x91CC;&#x6C34;&#x7FA4;&#x7684;&#xFF0C;&#x7136;&#x800C;&#x6B64;&#x65F6;&#x662F;&#x56FD;&#x5185;&#x7684;&#x51CC;&#x6668;&#x4E24;&#x70B9;&#xFF0C;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x4EBA;&#x80FD;&#x966A;&#x6211;&#x5520;&#x55D1;&#xFF0C;&#x55EF;&#x3002;</p>
<p>&#x5341;&#x70B9;&#x5DE6;&#x53F3;&#x6D17;&#x4E86;&#x4E2A;&#x6FA1;&#x5306;&#x5306;&#x7761;&#x4E86;&#x3002;</p>
<p>&#x4ECA;&#x5929;&#x65E9;&#x4E0A;6&#x70B9;&#x5DE6;&#x53F3;&#x5C31;&#x9192;&#x4E86;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x56FD;&#x5185;&#x7684;&#x6B63;&#x5348;&#x5341;&#x5206;(&#x5348;&#x65F6;&#x5DF2;&#x5230;2333&#x6ED1;&#x7A3D;&#x8138;)&#xFF0C;&#x770B;&#x6765;&#x65F6;&#x5DEE;&#x8FD8;&#x662F;&#x4E0D;&#x80FD;&#x8FD9;&#x4E48;&#x5FEB;&#x7684;&#x9002;&#x5E94;&#xFF0C;&#x5728;&#x5E8A;&#x4E0A;&#x8D56;&#x5230;8&#x70B9;&#x5DE6;&#x53F3;&#xFF0C;&#x51B2;&#x4E86;&#x4E2A;&#x6FA1;&#x4E0B;&#x697C;&#x5543;&#x4E86;&#x51E0;&#x5757;&#x9762;&#x5305;&#x5F53;&#x65E9;&#x996D;&#xFF0C;&#x5403;&#x5B8C;&#x996D;&#x4E0A;&#x697C;&#x540E;&#x88AB;&#x5C0F;&#x59B9;&#x53EB;&#x4F4F;&#x966A;&#x5979;&#x73A9;&#x4E86;&#x4E00;&#x4F1A;&#x6E38;&#x620F;&#x3002;</p>
<p>&#x5341;&#x4E00;&#x70B9;&#x5DE6;&#x53F3;&#x5427;&#xFF0C;Edwin&#x6309;&#x7167;&#x539F;&#x8BA1;&#x5212;&#x8F7D;&#x6211;&#x4EEC;&#x53BB;&#x4E86;&#x963F;&#x59C6;&#x65AF;&#x7279;&#x4E39;&#x6700;&#x5927;&#x7684;&#x7535;&#x5B50;&#x5668;&#x6750;&#x5546;&#x573A;&#xFF0C;&#x8BF4;&#x662F;&#x7535;&#x5B50;&#x5668;&#x6750;&#x5546;&#x573A;&#x7136;&#x800C;&#x6211;&#x611F;&#x89C9;&#x91CC;&#x9762;&#x4EC0;&#x4E48;&#x90FD;&#x6709;&#x3002;&#x6211;&#x662F;&#x8981;&#x53BB;&#x4E70;&#x663E;&#x5361;&#x7684;&#xFF0C;&#x8FD9;&#x4E1C;&#x897F;&#x5728;&#x56FD;&#x5185;&#x4E70;&#x592A;&#x8D35;&#xFF0C;&#x6240;&#x4EE5;&#x76F4;&#x5954;&#x4E8C;&#x697C;&#x3002;&#x521A;&#x5230;&#x4E8C;&#x697C;&#x6211;&#x5C31;&#x770B;&#x89C1;&#x4E86;&#x4E70;ps4&#x6E38;&#x620F;&#x7684;&#x67DC;&#x53F0;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x524D;&#x9762;&#x6211;&#x8BF4;&#x611F;&#x89C9;&#x8FD9;&#x91CC;&#x9762;&#x4EC0;&#x4E48;&#x90FD;&#x6709;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<p>&#x6211;&#x662F;&#x4EC0;&#x4E48;&#x4EBA;&#x554A;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#xFF0C;2333&#xFF0C;&#x7ACB;&#x5373;&#x5C06;&#x4E70;&#x663E;&#x5361;&#x6392;&#x5230;&#x4E86;&#x7B2C;&#x4E8C;&#x540D;&#xFF0C;&#x7136;&#x540E;&#x76F4;&#x51B2;&#x51B2;&#x7684;&#x5954;ps4&#x67DC;&#x53F0;&#x53BB;&#x4E86;&#xFF0C;&#x8FB9;&#x770B;&#x6E38;&#x620F;&#x7684;&#x4EF7;&#x683C;&#x8FB9;&#x8BA1;&#x7B97;&#x7740;&#x6C47;&#x7387;&#xFF0C;&#x53D1;&#x73B0;&#x5728;&#x56FD;&#x5185;&#x53EA;&#x80FD;&#x4E70;&#x4E00;&#x4E2A;&#x6E38;&#x620F;&#x7684;&#x94B1;&#x5728;&#x8FD9;&#x91CC;&#x80FD;&#x4E70;&#x4E24;&#x4E2A;&#x751A;&#x81F3;&#x4E09;&#x4E2A;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x662F;&#x5206;&#x6E38;&#x620F;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x300A;&#x5200;&#x5251;&#x795E;&#x57DF;&#x300B;&#x7CFB;&#x5217;&#x5C31;&#x6CA1;&#x6709;&#x56FD;&#x5185;&#x4FBF;&#x5B9C;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x56E0;&#x4E3A;&#x65E5;&#x672C;&#x91CC;&#x5927;&#x9646;&#x8FDB;&#x5427;2333.&#x4E8C;&#x8BDD;&#x4E0D;&#x8BF4;&#x5241;&#x4E86;&#x4E00;&#x53EA;&#x624B;&#xFF0C;&#x5165;&#x624B;&#x4E86;&#x4E24;&#x4E2A;&#x6E38;&#x620F;&#xFF0C;&#x867D;&#x7136;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x5728;&#x91CC;&#x5356;&#x7684;&#x6709;&#x6CA1;&#x6709;&#x6C49;&#x5316;&#xFF0C;&#x4E0D;&#x8FC7;&#x5C31;&#x7B97;&#x6CA1;&#x6709;&#x4E5F;&#x6CA1;&#x6709;&#x591A;&#x5927;&#x5173;&#x7CFB;&#xFF0C;&#x6BD5;&#x7ADF;&#x73A9;&#x8FC7;&#x5F88;&#x591A;&#x6CA1;&#x6709;&#x6C49;&#x5316;&#x7684;&#x6E38;&#x620F;&#x4E86;&#x3002;</p>
<p>&#x5C31;&#x5728;&#x6211;&#x5BFB;&#x627E;&#x663E;&#x5361;&#x7684;&#x8DEF;&#x4E0A;&#x8FD8;&#x7ECF;&#x8FC7;&#x4E86;&#x96F7;&#x86C7;&#x7684;&#x5C55;&#x53F0;&#xFF0C;&#x8BA1;&#x7B97;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x4E5F;&#x6BD4;&#x56FD;&#x5185;&#x7684;&#x4FBF;&#x5B9C;&#x5F88;&#x591A;&#xFF0C;&#x4F46;&#x672C;&#x7740;&#x6211;&#x5DF2;&#x7ECF;&#x6709;&#x4E0D;&#x9519;&#x7684;&#x952E;&#x76D8;&#x548C;&#x8033;&#x673A;&#xFF0C;&#x8FD9;&#x6CE2;&#x5FCD;&#x4F4F;&#x4E86;&#x5E76;&#x6CA1;&#x6709;&#x5241;&#x624B;&#x3002;&#x55EF;&#xFF0C;&#x54E5;&#x8FD8;&#x662F;&#x4E00;&#x5982;&#x65E2;&#x5F80;&#x7684;&#x660E;&#x667A;&#xFF0C;23333.</p>
<p>&#x6700;&#x540E;&#x5F53;&#x7136;&#x987A;&#x5229;&#x7684;&#x4E70;&#x5230;&#x4E86;&#x663E;&#x5361;&#xFF0C;&#x4E00;&#x822C;&#xFF0C;&#x4F46;&#x662F;&#x8DB3;&#x591F;&#x5F00;mc&#x9AD8;&#x6E05;&#x5149;&#x5F71;&#x4E86;&#xFF0C;&#x5F88;&#x5F00;&#x5FC3;&#x3002;</p>
<p>&#x4E0B;&#x5348;Edwin&#x5E26;&#x7740;&#x6211;&#x4EEC;&#x56DB;&#x5904;&#x6E9C;&#x8FBE;&#x770B;&#x770B;&#x963F;&#x59C6;&#x65AF;&#x7279;&#x4E39;&#xFF0C;&#x56E0;&#x4E3A;&#x8377;&#x5170;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x6B27;&#x6D32;&#x7684;&#x8D77;&#x59CB;&#x7AD9;&#x4E5F;&#x662F;&#x7EC8;&#x70B9;&#x7AD9;&#xFF0C;&#x6240;&#x4EE5;&#x4ECA;&#x5929;&#x53EA;&#x662F;&#x770B;&#x4E00;&#x770B;&#xFF0C;&#x5E76;&#x4E0D;&#x505A;&#x6DF1;&#x5165;&#x3002;</p>
<p>&#x5F53;&#x4F60;&#x8FDB;&#x5165;&#x963F;&#x59C6;&#x65AF;&#x7279;&#x4E39;&#x7684;&#x90A3;&#x4E00;&#x5239;&#x90A3;&#x5C31;&#x4F1A;&#x4F53;&#x9A8C;&#x5230;&#x4E00;&#x80A1;&#x4E2D;&#x4E16;&#x7EAA;&#x7684;&#x98CE;&#x683C;&#xFF0C;&#x7ED9;&#x6211;&#x7684;&#x7B2C;&#x4E00;&#x611F;&#x53D7;&#x5C31;&#x662F;&#x8FD9;&#x91CC;&#x5230;&#x5904;&#x90FD;&#x662F;&#x662F;&#x523A;&#x5BA2;&#x4FE1;&#x6761;&#x7684;&#x5730;&#x56FE;&#xFF0C;&#x9053;&#x8DEF;&#x4E24;&#x65C1;&#x90FD;&#x662F;3&#x3001;4&#x5C42;&#x697C;&#x9AD8;&#x7684;&#x5C0F;&#x516C;&#x5BD3;&#xFF0C;&#x697C;&#x623F;&#x4E5F;&#x662F;&#x5178;&#x578B;&#x7684;&#x4E2D;&#x4E16;&#x7EAA;&#x5EFA;&#x7B51;&#x3002;&#x8FD9;&#x5E76;&#x4E0D;&#x662F;&#x523B;&#x610F;&#x76D6;&#x7684;&#xFF0C;&#x800C;&#x662F;&#x5386;&#x53F2;&#x4FDD;&#x7559;&#x4E0B;&#x6765;&#x7684;&#xFF0C;&#x662F;&#x7684;&#xFF0C;&#x963F;&#x59C6;&#x65AF;&#x7279;&#x4E39;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x5EFA;&#x7B51;&#x90FD;&#x662F;&#x5728;&#x5341;&#x516B;&#x4E16;&#x7EAA;&#x5EFA;&#x7B51;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x4E00;&#x76F4;&#x4FDD;&#x7559;&#x5230;&#x73B0;&#x5728;&#x4ECD;&#x7136;&#x5F53;&#x4F5C;&#x5C45;&#x6C11;&#x697C;&#x6216;&#x8005;&#x529E;&#x516C;&#x697C;&#x4F7F;&#x7528;&#x3002;&#x8BFB;&#x5230;&#x8FD9;&#x91CC;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x95EE;&#xFF0C;&#x5C31;&#x6CA1;&#x6709;&#x65B0;&#x7684;&#x697C;&#x623F;&#x5417;&#xFF1F;&#x6709;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x51E0;&#x4E4E;&#x90FD;&#x662F;&#x4EE5;&#x536B;&#x661F;&#x57CE;&#x4E00;&#x6837;&#x56F4;&#x7ED5;&#x963F;&#x59C6;&#x65AF;&#x7279;&#x4E39;&#x7684;&#x90CA;&#x533A;&#x3002;</p>
<p><img src="/2016/07/22/First-day-in-Europe/28.JPG" alt=""></p>
<p>&#x963F;&#x59C6;&#x65AF;&#x7279;&#x4E39;&#x8857;&#x62CD;</p>
<p>&#x751F;&#x6D3B;&#x5728;&#x5E02;&#x533A;&#x4E2D;&#x7684;&#x4EBA;&#x4EEC;&#x5176;&#x4E3B;&#x8981;&#x4EA4;&#x901A;&#x5DE5;&#x5177;&#x662F;&#x81EA;&#x884C;&#x8F66;&#x548C;&#x6709;&#x8F68;&#x7535;&#x8F66;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x5F97;&#x4E0D;&#x5410;&#x69FD;&#x4E00;&#x4E0B;&#xFF0C;&#x8377;&#x5170;&#x90FD;&#x662F;&#x8001;&#x53F8;&#x673A;&#xFF0C;&#x5728;&#x516C;&#x8DEF;&#x4E0A;&#x8F66;&#x901F;&#x57FA;&#x672C;&#x90FD;&#x8D85;&#x8FC7;&#x4E86;120km/h&#xFF0C;&#x6362;&#x5728;&#x957F;&#x6625;&#x8FD9;&#x79CD;&#x8F66;&#x6D41;&#x5BC6;&#x5EA6;&#x57FA;&#x672C;&#x4E0D;&#x4F1A;&#x4E0A;60km/h&#x3002;&#x9664;&#x4E86;&#x5F00;&#x8F66;&#x7684;&#x662F;&#x8001;&#x53F8;&#x673A;&#xFF0C;&#x9A91;&#x81EA;&#x884C;&#x8F66;&#x7684;&#x4E5F;&#x90FD;&#x662F;&#x8001;&#x53F8;&#x673A;&#xFF0C;&#x4E00;&#x4E2A;&#x4E2A;&#x90FD;&#x5728;&#x5168;&#x662F;&#x4EBA;&#x7684;&#x8857;&#x9053;&#x4E0A;&#x98D9;&#x8F66;&#xFF0C;&#x6211;&#x6562;&#x8BF4;&#x88AB;&#x4ED6;&#x4EEC;&#x649E;&#x5230;&#xFF0C;&#x57FA;&#x672C;&#x5C31;&#x662F;&#x9AA8;&#x6298;(&#x6211;&#x6562;&#x8FD9;&#x4E48;&#x8BF4;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x5C31;&#x662F;&#x4ED6;&#x4EEC;&#x7684;&#x81EA;&#x884C;&#x8F66;&#x5F88;&#x91CD;&#x5F88;&#x91CD;)&#x3002;</p>
<p><img src="/2016/07/22/First-day-in-Europe/33.JPG" alt=""></p>
<p>&#x6211;&#x4EEC;&#x5728;&#x8857;&#x4E0A;&#x8D70;&#x4E86;&#x534A;&#x5929;&#x540E;&#xFF0C;&#x5C31;&#x91C7;&#x53D6;&#x4E86;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x7279;&#x522B;&#x7684;&#x53C2;&#x89C2;&#x65B9;&#x5F0F;&#x2014;-&#x5750;&#x8239;&#xFF0C;&#x662F;&#x7684;&#xFF0C;&#x6211;&#x611F;&#x89C9;&#x8FD9;&#x91CC;&#x7684;&#x6CB3;&#x9053;&#x53EF;&#x4EE5;&#x8DDF;&#x5A01;&#x5C3C;&#x65AF;&#x6BD4;&#x4E00;&#x6BD4;&#x4E86;&#xFF0C;&#x6CB3;&#x9053;&#x9519;&#x7EFC;&#x590D;&#x6742;&#x8D2F;&#x7A7F;&#x4E86;&#x6574;&#x4E2A;&#x963F;&#x59C6;&#x65AF;&#x7279;&#x4E39;&#xFF0C;&#x5728;&#x5CB8;&#x8FB9;&#x8D70;&#x8DEF;&#x65F6;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x89C1;&#x6709;&#x5F88;&#x591A;&#x79C1;&#x5BB6;&#x7684;&#x516C;&#x5BB6;&#x7684;&#x8239;&#x505C;&#x5728;&#x6CB3;&#x9053;&#x4E0A;&#xFF0C;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x76F4;&#x63A5;&#x5C45;&#x4F4F;&#x5728;&#x6CB3;&#x9053;&#x4E0A;&#x3002;</p>
<p><img src="/2016/07/22/First-day-in-Europe/35.JPG" alt=""></p>
<p><img src="/2016/07/22/First-day-in-Europe/51.JPG" alt=""></p>
<p>&#x8239;&#x884C;&#x9A76;&#x4E86;&#x63A5;&#x8FD1;&#x4E00;&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;&#x5C06;&#x963F;&#x59C6;&#x65AF;&#x7279;&#x4E39;&#x57FA;&#x672C;&#x7ED5;&#x4E86;&#x4E00;&#x5708;&#xFF0C;&#x6CBF;&#x9014;&#x7ECF;&#x8FC7;&#x4E86;&#x5F88;&#x591A;&#x8457;&#x540D;&#x7684;&#x5EFA;&#x7B51;&#xFF0C;&#x4E0D;&#x5F97;&#x4E0D;&#x8BF4;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x5EFA;&#x7B51;&#x771F;&#x7684;&#x662F;&#x5F88;&#x7F8E;&#x554A;&#x3002;</p>
<p>&#x8FD9;&#x5EA7;&#x540A;&#x6865;&#x662F;&#x5168;&#x963F;&#x59C6;&#x65AF;&#x7279;&#x4E39;&#x6700;&#x65E9;&#x7684;&#x540A;&#x6865;&#x4E4B;&#x4E00;&#xFF0C;&#x4FDD;&#x7559;&#x4E86;&#x5FEB;4&#x4E2A;&#x4E16;&#x7EAA;&#x4E86;&#x4ECD;&#x7136;&#x5728;&#x4F7F;&#x7528;&#x3002;</p>
<p><img src="/2016/07/22/First-day-in-Europe/39.JPG" alt=""></p>
<p>&#x8FD9;&#x5EA7;&#x949F;&#x697C;&#x662F;&#x5728;1620&#x5E74;&#x5EFA;&#x9020;&#x7684;&#xFF0C;&#x6BCF;&#x9694;&#x5341;&#x5206;&#x949F;&#x5C31;&#x4F1A;&#x54CD;&#x8D77;&#x4E00;&#x6BB5;&#x949F;&#x58F0;&#x3002;</p>
<p><img src="/2016/07/22/First-day-in-Europe/48.JPG" alt=""></p>
<p><img src="/2016/07/22/First-day-in-Europe/30.JPG" alt=""></p>
<p>&#x5728;&#x6211;&#x4EEC;&#x9A76;&#x51FA;&#x8001;&#x57CE;&#x533A;&#x540E;&#x5C31;&#x6765;&#x5230;&#x4E86;&#x8FD1;&#x6D77;&#xFF0C;&#x8FDC;&#x5904;&#x90A3;&#x4E2A;&#x5EFA;&#x7B51;&#x662F;&#x963F;&#x59C6;&#x65AF;&#x7279;&#x4E39;&#x535A;&#x7269;&#x9986;&#x3002;</p>
<p><img src="/2016/07/22/First-day-in-Europe/54.JPG" alt=""></p>
<p>&#x8FD9;&#x8258;&#x6728;&#x8239;&#x662F;&#x4EFF;&#x5EFA;&#x7684;&#x2026;&#x53F7;&#xFF0C;&#x7EAF;&#x624B;&#x5DE5;&#x6253;&#x9020;&#xFF0C;&#x5386;&#x65F6;5&#x5E74;&#x3002;</p>
<p><img src="/2016/07/22/First-day-in-Europe/56.JPG" alt=""></p>
<p><img src="/2016/07/22/First-day-in-Europe/59.JPG" alt=""></p>
<p>&#x4E00;&#x4E2A;&#x5C0F;&#x65F6;&#x5DE6;&#x53F3;&#x5427;&#xFF0C;&#x8239;&#x9760;&#x5CB8;&#x4E86;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x628A;&#x6574;&#x4E2A;&#x963F;&#x59C6;&#x65AF;&#x7279;&#x4E39;&#x770B;&#x4E2A;&#x5927;&#x6982;&#x4E86;&#x3002;Edwin&#x5E26;&#x7740;&#x6211;&#x4EEC;&#x524D;&#x5F80;&#x963F;&#x59C6;&#x65AF;&#x7279;&#x4E39;&#x706B;&#x8F66;&#x7AD9;&#x505A;&#x6709;&#x8F68;&#x7535;&#x8F66;&#x56DE;&#x5BB6;&#xFF0C;&#x8FD9;&#x4E00;&#x5929;&#x7684;&#x65C5;&#x7A0B;&#x4E5F;&#x57FA;&#x672C;&#x7ED3;&#x675F;&#x4E86;&#x3002;</p>
<p>&#x4E0B;&#x56FE;&#x5206;&#x522B;&#x662F;&#x706B;&#x8F66;&#x7AD9;&#x8FDC;&#x666F;&#x4E0E;&#x8FD1;&#x666F;&#x3002;</p>
<p><img src="/2016/07/22/First-day-in-Europe/68.JPG" alt=""></p>
<p><img src="/2016/07/22/First-day-in-Europe/73.JPG" alt=""></p>
<p>&#x6211;&#x6444;&#x5F71;&#x6280;&#x672F;&#x4E00;&#x822C;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x4E0D;&#x600E;&#x4E48;&#x597D;&#xFF0C;&#x5927;&#x5BB6;&#x5C06;&#x5C31;&#x7740;&#x770B;&#x5427;23333&#x2026;</p>

      
    </div><!-- .entry-content -->

    <footer class="entry-meta">
    <a href="/2016/07/22/First-day-in-Europe/">
    <time datetime="2016-07-22T15:00:45.000Z" class="entry-date">
        2016-07-22
    </time>
</a>
    
  <span class="article-delim">&#8226;</span>
  <div class="article-category">
  <a class="article-category-link" href="/categories/LIFE/">LIFE</a>
  </div>

    
    </footer>
</article>






  
    <article id="post-UIView-设置指定几个角为圆角" class="post-UIView-设置指定几个角为圆角 post type-post status-publish format-standard hentry">
    <!---->

      <header class="entry-header">
        
        
  
    <h1 class="entry-title">
      <a class="article-title" href="/2016/07/21/UIView-设置指定几个角为圆角/">UIView 设置指定几个角为圆角</a>
    </h1>
  

        
        <div class="comments-link">
            
            <a href="javascript:void(0);" data-url="https://saberda.github.io/2016/07/21/UIView-设置指定几个角为圆角/" data-id="citjybtrq000hb9b3xyz30txq" class="leave-reply bdsharebuttonbox" data-cmd="more">Share</a>
        </div><!-- .comments-link -->
      </header><!-- .entry-header -->

    <div class="entry-content">
      
        <h2 id="&#x521D;&#x59CB;&#x5316;UIView"><a href="#&#x521D;&#x59CB;&#x5316;UIView" class="headerlink" title="&#x521D;&#x59CB;&#x5316;UIView"></a>&#x521D;&#x59CB;&#x5316;UIView</h2><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br></pre></td><td class="code"><pre><span class="line">UIView * view = [UIView alloc]initWithFrame:CGRectMake(0,0,[UIScreen mainScreen].bounds.size.width,[UIScreen mainScreen].bounds.size.height)];</span><br><span class="line">[view setBackgroundColor:[UIColor White]];</span><br><span class="line">[self.view addSubview:view];</span><br></pre></td></tr></table></figure>
<h2 id="&#x8BBE;&#x7F6E;view&#x5DE6;&#x4FA7;&#x4E0A;UIRectCornerTopLeft-&#x548C;-&#x5DE6;&#x4FA7;&#x4E0B;UIRectCornerBottomLeft&#x4E3A;5&#x7684;&#x5706;&#x89D2;"><a href="#&#x8BBE;&#x7F6E;view&#x5DE6;&#x4FA7;&#x4E0A;UIRectCornerTopLeft-&#x548C;-&#x5DE6;&#x4FA7;&#x4E0B;UIRectCornerBottomLeft&#x4E3A;5&#x7684;&#x5706;&#x89D2;" class="headerlink" title="&#x8BBE;&#x7F6E;view&#x5DE6;&#x4FA7;&#x4E0A;UIRectCornerTopLeft &#x548C; &#x5DE6;&#x4FA7;&#x4E0B;UIRectCornerBottomLeft&#x4E3A;5&#x7684;&#x5706;&#x89D2;"></a>&#x8BBE;&#x7F6E;view&#x5DE6;&#x4FA7;&#x4E0A;UIRectCornerTopLeft &#x548C; &#x5DE6;&#x4FA7;&#x4E0B;UIRectCornerBottomLeft&#x4E3A;5&#x7684;&#x5706;&#x89D2;</h2><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br></pre></td><td class="code"><pre><span class="line">UIBezierPath * path = [UIBezierPath bezierPathWithRoundedRect:view.bounds byRoundingCorners:UIRectCornerTopLeft|UIRectCornerBottomLeft cornerRadii:CGSizeMake(5, 5)];</span><br><span class="line">CAShapeLayer * layer = [[CAShapeLayer alloc]init];</span><br><span class="line">layer.frame = view.bounds;</span><br><span class="line">layer.path = path.CGPath;</span><br><span class="line">view.layer.mask = layer;</span><br></pre></td></tr></table></figure>
<h2 id="&#x8BBE;&#x7F6E;view-&#x5168;&#x90E8;&#x89D2;&#x4E3A;&#x5706;&#x89D2;"><a href="#&#x8BBE;&#x7F6E;view-&#x5168;&#x90E8;&#x89D2;&#x4E3A;&#x5706;&#x89D2;" class="headerlink" title="&#x8BBE;&#x7F6E;view &#x5168;&#x90E8;&#x89D2;&#x4E3A;&#x5706;&#x89D2;"></a>&#x8BBE;&#x7F6E;view &#x5168;&#x90E8;&#x89D2;&#x4E3A;&#x5706;&#x89D2;</h2><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">//&#x8BBE;&#x7F6E;&#x90A3;&#x4E2A;&#x5706;&#x89D2;&#x5927;&#x5C0F;</span><br><span class="line">viewT.layer.cornerRadius = 10;</span><br><span class="line">//&#x8BBE;&#x7F6E;YES&#x662F;&#x4FDD;&#x8BC1;&#x6DFB;&#x52A0;&#x7684;&#x56FE;&#x7247;&#x8986;&#x76D6;&#x89C6;&#x56FE;&#x7684;&#x6548;&#x679C;</span><br><span class="line">viewT.layer.masksToBounds = YES;</span><br></pre></td></tr></table></figure>

      
    </div><!-- .entry-content -->

    <footer class="entry-meta">
    <a href="/2016/07/21/UIView-设置指定几个角为圆角/">
    <time datetime="2016-07-21T10:50:29.000Z" class="entry-date">
        2016-07-21
    </time>
</a>
    
  <span class="article-delim">&#8226;</span>
  <div class="article-category">
  <a class="article-category-link" href="/categories/iOS/">iOS</a>
  </div>

    
  <span class="article-delim">&#8226;</span>
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/UIView-圆角/">UIView-圆角</a></li></ul>

    </footer>
</article>






  
    <article id="post-UIColor" class="post-UIColor post type-post status-publish format-standard hentry">
    <!---->

      <header class="entry-header">
        
        
  
    <h1 class="entry-title">
      <a class="article-title" href="/2016/07/19/UIColor/">UIColor</a>
    </h1>
  

        
        <div class="comments-link">
            
            <a href="javascript:void(0);" data-url="https://saberda.github.io/2016/07/19/UIColor/" data-id="citjybtrd0007b9b3m9rt8017" class="leave-reply bdsharebuttonbox" data-cmd="more">Share</a>
        </div><!-- .comments-link -->
      </header><!-- .entry-header -->

    <div class="entry-content">
      
        <pre><code>&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4E3B;&#x8981;&#x662F;&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;UIColor
</code></pre><p>&#x5728;&#x4F7F;&#x7528;UIColor&#x65F6;&#x4E0D;&#x9700;&#x8981;&#x6307;&#x51FA;&#x4ED6;&#x7684;&#x73AF;&#x5883;&#x3002;</p>
<p>&#x5F53;&#x4F60;&#x5728;&#x4F7F;&#x7528;&#x5BF9;&#x8C61;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x4F60;&#x53EA;&#x7528;&#x5230;UICOlor&#x3001;UIFont&#x3001;NSString&#x3002;&#x8FD9;&#x91CC;&#x4F60;&#x662F;&#x7528;&#x5BF9;&#x8C61;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E0D;&#x7528;&#x6307;&#x51FA;&#x4ED6;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x5B83;&#x4F1A;&#x5047;&#x8BBE;&#x4F60;&#x7528;&#x7684;&#x662F;&#x5F53;&#x524D;&#x73AF;&#x5883;&#xFF0C;&#x53EA;&#x8981;&#x7528;&#x524D;&#x9762;&#x7684;CGContext&#x8868;&#x9762;&#x73AF;&#x5883;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;</p>
<p>UIColor&#x6709;&#x5F88;&#x591A;&#x7C7B;&#x65B9;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;redColor&#xFF0C;&#x4F1A;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x6807;&#x51C6;&#x8272;&#x3002;</p>
<p>UIColor&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x521D;&#x59CB;&#x5316;&#x65B9;&#x6CD5;&#x6765;&#x81EA;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x989C;&#x8272;&#xFF0C;&#x6BD4;&#x5982;initWithRGB&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">UIColor *color = [[UIColor alloc] initWithRed:(CGFloat)red</span><br><span class="line">					blue:(CGFloat)blue</span><br><span class="line">					green:(CGFloat)green</span><br><span class="line">					alpha:(CHFloat)alpha];//0.0 to 1.0</span><br></pre></td></tr></table></figure>
<h2 id="Alpha"><a href="#Alpha" class="headerlink" title="Alpha"></a>Alpha</h2><p>&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x6765;&#x8BB2;&#x4E00;&#x4E0B;&#x900F;&#x660E;&#x5EA6;(alpha)&#x3002;</p>
<p>UIView&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x900F;&#x660E;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p>0.0&#x662F;&#x5B8C;&#x5168;&#x900F;&#x660E;&#xFF0C;1.0&#x662F;&#x4E0D;&#x900F;&#x660E; &#x3002;</p>
<p>&#x8981;&#x900F;&#x660E;&#x5316;&#x9700;&#x8981;&#x8BBE;&#x7F6E;property opaque&#x4E3A;NO&#x3002;</p>
<p>UI&#x8FD8;&#x53EF;&#x4EE5;&#x5BF9;&#x6574;&#x4E2A;view&#x8BBE;&#x7F6E;&#x900F;&#x660E;&#x5EA6;</p>

      
    </div><!-- .entry-content -->

    <footer class="entry-meta">
    <a href="/2016/07/19/UIColor/">
    <time datetime="2016-07-19T14:24:03.000Z" class="entry-date">
        2016-07-19
    </time>
</a>
    
  <span class="article-delim">&#8226;</span>
  <div class="article-category">
  <a class="article-category-link" href="/categories/iOS/">iOS</a>
  </div>

    
  <span class="article-delim">&#8226;</span>
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/UIColor/">UIColor</a></li></ul>

    </footer>
</article>






  
    <article id="post-绘图" class="post-绘图 post type-post status-publish format-standard hentry">
    <!---->

      <header class="entry-header">
        
        
  
    <h1 class="entry-title">
      <a class="article-title" href="/2016/07/19/绘图/">DrawRect</a>
    </h1>
  

        
        <div class="comments-link">
            
            <a href="javascript:void(0);" data-url="https://saberda.github.io/2016/07/19/绘图/" data-id="citjybtsw001wb9b3at198kdb" class="leave-reply bdsharebuttonbox" data-cmd="more">Share</a>
        </div><!-- .comments-link -->
      </header><!-- .entry-header -->

    <div class="entry-content">
      
        <p>&#x7ED8;&#x56FE;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x524D;&#x63D0;&#x662F;&#x4F60;&#x6709;&#x4E86;view&#x7684;&#x5B50;&#x7C7B;&#xFF0C;&#x53EA;&#x9700;&#x91CD;&#x8F7D;&#x8FD9;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;<strong>drawRect</strong>&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">- (void)drawRect:(CGRect *)name;</span><br></pre></td></tr></table></figure>
<p>&#x4ED6;&#x7684;&#x53C2;&#x6570;&#x662F;&#x4E2A;&#x77E9;&#x5F62;&#xFF0C;&#x8FD9;&#x4E2A;&#x77E9;&#x5F62;&#x5C31;&#x662F;&#x4F60;&#x8981;&#x91CD;&#x7ED8;&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x53C2;&#x6570;&#xFF0C;&#x5B83;&#x53EA;&#x662F;&#x4E3A;&#x4E86;&#x6027;&#x80FD;&#x4F18;&#x5316;&#xFF0C;&#x53EA;&#x5728;&#x89C4;&#x5B9A;&#x7684;&#x533A;&#x57DF;&#x7ED8;&#x56FE;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;<strong>&#x6C38;&#x8FDC;&#x4E0D;&#x8981;&#x53BB;&#x8C03;&#x7528;drawRect</strong>&#x3002;&#x56E0;&#x4E3A;drawRect&#x4E0D;&#x662F;&#x8BA9;&#x4F60;&#x8C03;&#x7528;&#x7684;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x53BB;&#x8C03;&#x7528;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x95EE;&#x9898;&#x6765;&#x4E86;&#xFF0C;&#x6211;&#x600E;&#x4E48;&#x53BB;&#x544A;&#x8BC9;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x91CD;&#x7ED8;&#x5462;&#xFF1F;</p>
<p>&#x4F60;&#x4F7F;&#x7528;&#x8FD9;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">- (void)setNeedsDisplay;</span><br><span class="line">- (void)setNeedsDisplayInRect:(CGRect)name;</span><br></pre></td></tr></table></figure>
<p>&#x4F60;&#x4EEC;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x521D;&#x59CB;&#x5316;&#x7684;&#x65F6;&#x5019;&#x7684;&#x8BBE;&#x7F6E;&#x662F;&#x4E00;&#x4E2A;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x665A;&#x4E9B;&#x7CFB;&#x7EDF;&#x67E5;&#x770B;&#x6240;&#x6709;&#x9700;&#x8981;&#x91CD;&#x7ED8;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x4ED6;&#x4EEC;&#x987A;&#x5E8F;&#x6392;&#x5217;&#xFF08;&#x56E0;&#x4E3A;&#x6709;&#x4E9B;&#x4E1C;&#x897F;&#x53EF;&#x80FD;&#x4F1A;&#x91CD;&#x53E0;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x975E;&#x5E38;&#x9AD8;&#x6548;&#x7684;&#x628A;&#x9700;&#x8981;&#x7684;&#x4E1C;&#x897F;&#x91CD;&#x7ED8;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x8FD9;&#x6837;&#x505A;&#x6709;&#x4E24;&#x4E2A;&#x597D;&#x5904;&#xFF0C;&#x4E00;&#x662F;&#x8BA9;&#x7CFB;&#x7EDF;&#x4F9D;&#x636E;&#x5C42;&#x7684;&#x60C5;&#x51B5;&#x6700;&#x4F18;&#x5316;&#x6027;&#x80FD;&#xFF1B;&#x4E8C;&#x662F;&#x5982;&#x679C;&#x4F60;&#x7684;property&#x6709;&#x4E00;&#x4E9B;setter&#xFF0C;&#x5F53;&#x4F60;&#x8BBE;&#x7F6E;&#x7684;&#x65F6;&#x5019;&#x9700;&#x8981;&#x91CD;&#x7ED8;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E5F;&#x88AB;&#x6700;&#x4F18;&#x5316;&#x4E86;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x4F60;&#x6240;&#x6709;&#x7684;setter&#x90FD;&#x4F1A;&#x8C03;&#x7528;self&#x7684;setNeedsDisplay&#x6765;&#x91CD;&#x7ED8;&#x3002;&#x5982;&#x679C;&#x6709;&#x4EBA;&#x7528;&#x4E86;&#x4F60;&#x7684;view&#xFF0C;&#x7136;&#x540E;&#x8C03;&#x7528;&#x4E86;&#x597D;&#x51E0;&#x904D;&#x8FD9;&#x4E9B;setter&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x91CD;&#x7ED8;&#x4E00;&#x6B21;&#xFF0C;&#xFF0C;&#x6BCF;&#x4E2A;setNeedsDisplay&#x90FD;&#x88AB;&#x4E00;&#x8D77;&#x4F20;&#x8FC7;&#x53BB;&#xFF0C;&#x7136;&#x540E;&#x4E00;&#x6B21;&#x6027;&#x753B;&#x51FA;&#x6765;&#x3002;&#x800C;&#x4E0D;&#x662F;&#x6BCF;&#x6B21;&#x90FD;&#x91CD;&#x7ED8;&#xFF0C;&#x5BFC;&#x81F4;&#x4E0D;&#x505C;&#x7684;&#x7ED8;&#x56FE;&#xFF0C;&#x7ED8;&#x56FE;&#x7684;&#x5F00;&#x9500;&#x53EF;&#x662F;&#x76F8;&#x5F53;&#x5927;&#x7684;&#x3002;</p>

      
    </div><!-- .entry-content -->

    <footer class="entry-meta">
    <a href="/2016/07/19/绘图/">
    <time datetime="2016-07-19T08:17:44.000Z" class="entry-date">
        2016-07-19
    </time>
</a>
    
  <span class="article-delim">&#8226;</span>
  <div class="article-category">
  <a class="article-category-link" href="/categories/iOS/">iOS</a>
  </div>

    
    </footer>
</article>






  
    <article id="post-views" class="post-views post type-post status-publish format-standard hentry">
    <!---->

      <header class="entry-header">
        
        
  
    <h1 class="entry-title">
      <a class="article-title" href="/2016/07/19/views/">浅谈iOS中的Views</a>
    </h1>
  

        
        <div class="comments-link">
            
            <a href="javascript:void(0);" data-url="https://saberda.github.io/2016/07/19/views/" data-id="citjybts2000xb9b38xd0w1w1" class="leave-reply bdsharebuttonbox" data-cmd="more">Share</a>
        </div><!-- .comments-link -->
      </header><!-- .entry-header -->

    <div class="entry-content">
      
        <pre><code>&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x54B1;&#x4EEC;&#x6765;&#x7B80;&#x5355;&#x8C08;&#x8C08;Views&#x3002;
</code></pre><p>&#x4F60;&#x4EEC;&#x53EF;&#x80FD;&#x751A;&#x81F3;&#x90FD;&#x6CA1;&#x6709;&#x610F;&#x8BC6;&#x5230;&#x5DF2;&#x7ECF;&#x5728;&#x7528;Views&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;UILable&#x3001;UIButton&#x90FD;&#x662F;Views&#x3002;</p>
<p>View&#x5C31;&#x662F;&#x5C4F;&#x5E55;&#x4E0A;&#x7684;&#x4E00;&#x4E2A;&#x77E9;&#x5F62;&#x7A7A;&#x95F4;&#xFF0C;&#x5B83;&#x975E;&#x5E38;&#x5F3A;&#x5927;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x7A7A;&#x95F4;&#x91CC;&#x6709;&#x5F88;&#x591A;&#x597D;&#x7528;&#x7684;&#x4E1C;&#x897F;&#x3002;iOS&#x7684;&#x8BBE;&#x8BA1;&#x8303;&#x4F8B;&#x5C31;&#x662F;&#x628A;&#x590D;&#x6742;&#x7684;&#x90E8;&#x5206;&#x90FD;&#x653E;&#x5728;&#x7CFB;&#x7EDF;&#x91CC;&#xFF0C;&#x4F60;&#x6240;&#x80FD;&#x770B;&#x5230;&#x7684;&#x90FD;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x3002;(That&#x2019;s good for you!)</p>
<pre><code>View&#x662F;&#x5E72;&#x4EC0;&#x4E48;&#x7684;&#xFF1F;
</code></pre><p>Draws and handles events in that rectangle</p>
<p>&#x5B83;&#x753B;&#x51FA;&#x90A3;&#x4E2A;&#x77E9;&#x5F62;&#x7A7A;&#x95F4;&#xFF0C;&#x5E76;&#x5904;&#x7406;&#x5176;&#x4E2D;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x8FD9;&#x4E24;&#x4EF6;&#x4E8B;&#x90FD;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x3002;</p>
<p>View&#x7684;&#x7ED3;&#x6784;&#x662F;&#x5206;&#x5C42;&#x7684;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#x4E00;&#x4E2A;view&#x5728;&#x53E6;&#x4E00;&#x4E2A;view&#x91CC;&#xFF0C;<strong>&#x4E00;&#x4E2A;view&#x53EA;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x7236;view</strong>&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x6709;&#x5F88;&#x591A;&#x5B50;view&#x3002;</p>
<p>&#x5B50;view&#x7684;&#x987A;&#x5E8F;&#x662F;&#x6709;&#x5173;&#x7CFB;&#x7684;&#xFF0C;&#x5728;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x6570;&#x5B57;&#x4F4D;&#x7F6E;&#x8D8A;&#x9AD8;&#x6216;&#x8005;&#x6570;&#x5B57;&#x8D8A;&#x5927;&#xFF0C;&#x5C31;&#x663E;&#x793A;&#x5728;&#x540E;&#x9762;&#xFF1B;&#x4F4D;&#x7F6E;&#x4F4E;&#x7684;&#x5C31;&#x5728;&#x524D;&#x9762;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x8BF4;&#x4E00;&#x4E0B;&#xFF0C;UIWindow&#x5176;&#x5B9E;&#x662F;UIView&#x7684;&#x5B50;&#x7C7B;&#x3002;&#x56E0;&#x4E3A;&#x5728;iOS&#x91CC;UIWindow&#x975E;&#x5E38;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x4F60;&#x51E0;&#x4E4E;&#x4E0D;&#x4F1A;&#x7EE7;&#x627F;UIWindow(<strong>Only have one UIWindow(generally) in an iOS application</strong>)&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x5728;&#x5176;&#x4ED6;&#x7684;&#x7CFB;&#x7EDF;&#x7F16;&#x7A0B;&#xFF0C;UIWindow&#x53EF;&#x80FD;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x4F46;&#x5728;iOS&#x91CC;&#x90FD;&#x662F;view&#x5728;&#x5904;&#x7406;,&#x6700;&#x5E95;&#x5C42;&#x7684;View&#x662F;&#x7BA1;&#x7406;&#x5C4F;&#x5E55;&#x7684;controller&#x7684;view&#xFF0C;&#x8FD9;&#x4E2A;view&#x7684;&#x5C42;&#x7EA7;&#x7ED3;&#x6784;&#x4E00;&#x70B9;&#x8981;&#x5728;Xcode&#x91CC;&#x56FE;&#x5F62;&#x5316;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x4F60;&#x8FD8;&#x53EF;&#x4EE5;&#x7528;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x5206;&#x5C42;&#x3002;&#x8FD9;&#x6709;&#x4E24;&#x4E2A;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x4EE3;&#x7801;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">- (void)addSubview:(UIView *)viewName;</span><br><span class="line">- (void)removeFromSuperview;</span><br></pre></td></tr></table></figure>
<p>addSubview&#x662F;&#x5F80;&#x4E00;&#x4E2A;view&#x91CC;&#x6DFB;&#x52A0;&#x5B50;view&#x3002;</p>
<p>&#x4F46;&#x662F;&#x628A;&#x4E00;&#x4E2A;view&#x62FF;&#x51FA;&#x6765;&#x5C31;&#x4E0D;&#x662F;&#x8FD9;&#x4E48;&#x56DE;&#x4E8B;&#x4E86;&#xFF0C;&#x4F60;&#x4E0D;&#x80FD;&#x8981;&#x6C42;&#x540C;&#x4E00;&#x4E2A;view&#x79FB;&#x9664;&#x521A;&#x521A;&#x6DFB;&#x52A0;&#x7684;view&#xFF0C;&#x4F60;&#x8981;&#x53BB;&#x5230;&#x90A3;&#x4E2A;view&#xFF0C;&#x8BA9;&#x5B83;&#x79FB;&#x9664;&#x5B83;&#x81EA;&#x5DF1;&#x3002;</p>
<p>&#x5E38;&#x5E38;&#x6709;&#x4EBA;&#x641E;&#x4E0D;&#x6E05;&#x8FD9;&#x91CC;&#xFF0C;&#x8FD9;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x6A21;&#x5F0F;&#x3002;&#x901A;&#x8FC7;&#x7236;view&#x6765;&#x6DFB;&#x52A0;&#x5B50;view&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x79FB;&#x9664;&#x5B50;view&#x8981;&#x901A;&#x8FC7;&#x5B50;view&#x81EA;&#x5DF1;&#x3002;</p>
<h2 id="View-Coordinates"><a href="#View-Coordinates" class="headerlink" title="View Coordinates"></a>View Coordinates</h2><pre><code>&#x6211;&#x8BF4;&#x8FC7;view&#x662F;&#x4E00;&#x4E2A;&#x5750;&#x6807;&#x7CFB;&#x7EDF;&#xFF0C;&#x90A3;&#x4E48;&#x9700;&#x8981;&#x6709;&#x4E1C;&#x897F;&#x6765;&#x63CF;&#x7ED8;&#x5750;&#x6807;&#x3002;
</code></pre><p>&#x6700;&#x57FA;&#x7840;&#x7684;&#x662F;CGFloat&#xFF0C;&#x4E00;&#x4E2A;&#x9ED8;&#x8BA4;&#x7684;float&#x6216;&#x8005;double&#x7C7B;&#x578B;&#xFF0C;&#x5177;&#x4F53;&#x662F;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x4E0D;&#x7528;&#x7BA1;&#x3002;<strong>&#x56FE;&#x5F62;&#x5316;&#x7F16;&#x7A0B;&#x7684;&#x65F6;&#x5019;&#x4E00;&#x5B9A;&#x8981;&#x7528;CGFloat&#x800C;&#x4E0D;&#x662F;float&#x548C;double</strong>&#x3002;</p>
<p>&#x7136;&#x540E;&#x662F;CGPoint&#x3002;&#x4ED6;&#x662F;&#x4E00;&#x4E2A;C&#x7ED3;&#x6784;&#x4F53;&#xFF0C;&#x542B;&#x6709;&#x4E24;&#x4E2A;CGFloat&#x6570;x&#x548C;y&#x3002;</p>
<p>&#x8FD8;&#x6709;CGSize&#x3002;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;C&#x7ED3;&#x6784;&#x4F53;&#xFF0C;&#x542B;&#x6709;&#x4E24;&#x4E2A;CGFloat&#x6570;width&#x548C;height&#x3002;</p>
<p>CGRect&#x5C31;&#x662F;&#x542B;&#x6709;&#x4E00;&#x4E2A;CGPoint&#x548C;&#x4E00;&#x4E2A;CGSize&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x5C31;&#x662F;&#x7528;&#x6765;&#x63CF;&#x7ED8;view&#x89C6;&#x56FE;&#x7684;&#x56DB;&#x4E2A;&#x4E3B;&#x8981;&#x7C7B;&#x578B;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">CGPoint point = CGPointMake(x, y);</span><br><span class="line">point.x = 20;</span><br></pre></td></tr></table></figure>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">CGSize size = CGSizeMake(width, height);</span><br><span class="line">size.height = 80;</span><br></pre></td></tr></table></figure>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br></pre></td><td class="code"><pre><span class="line">CGRect view = CGRectMake(x, y, width, height);</span><br><span class="line">view.size.height = 80;</span><br><span class="line">view.origin.x = 20;</span><br></pre></td></tr></table></figure>
<h2 id="Coordinates"><a href="#Coordinates" class="headerlink" title="Coordinates"></a>Coordinates</h2><pre><code>&#x73B0;&#x5728;&#x8BB2;&#x4E00;&#x4E0B;&#x5750;&#x6807;&#x7CFB;&#x7EDF;&#x3002;
</code></pre><p><strong>iOS&#x7684;&#x5750;&#x6807;&#x539F;&#x70B9;&#x662F;&#x5728;&#x5DE6;&#x4E0A;&#x89D2;</strong>&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6570;&#x5B66;&#x4E2D;&#x5E38;&#x7528;&#x7684;&#x5DE6;&#x4E0B;&#x89D2;&#x3002;</p>
<p>&#x5750;&#x6807;&#x5355;&#x4F4D;&#x662F;&#x70B9;&#x800C;&#x4E0D;&#x662F;&#x50CF;&#x7D20;&#x3002;</p>
<p>&#x70B9;&#x662F;&#x79CD;&#x56FE;&#x5F62;&#x4E0A;&#x7684;&#x672F;&#x8BED;&#xFF0C;&#x4E0E;&#x50CF;&#x7D20;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x7531;&#x4E8E;iPhone&#x7684;&#x5206;&#x8FA8;&#x7387;&#x5F88;&#x9AD8;&#xFF0C;&#x5982;&#x679C;&#x70B9;&#x7B49;&#x4E8E;&#x50CF;&#x7D20;&#x7684;&#x8BDD;&#x4F1A;&#x5BFC;&#x81F4;&#x505A;&#x56FE;&#x65F6;&#x53D1;&#x751F;&#x9519;&#x8BEF;&#x3002;</p>
<p>&#x6240;&#x4EE5;UIView&#x6709;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;(property)&#x53EB;contentScaleFactor&#xFF0C;&#x4ED6;&#x4F1A;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x70B9;&#x6709;&#x591A;&#x5C11;&#x50CF;&#x7D20;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x7528;&#x70B9;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;</p>
<p>views&#x6709;&#x4E09;&#x4E2A;&#x548C;&#x4F4D;&#x7F6E;&#x5927;&#x5C0F;&#x76F8;&#x5173;&#x7684;property&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br></pre></td><td class="code"><pre><span class="line">@property CGRect bounds;</span><br><span class="line">@property CGPoint center;</span><br><span class="line">@property CHRect frame;</span><br></pre></td></tr></table></figure>
<p><strong>bounds</strong>:&#x4ED6;&#x662F;&#x4E2A;&#x77E9;&#x5F62;&#xFF0C;&#x662F;view&#x81EA;&#x5DF1;&#x7684;&#x5750;&#x6807;&#x7CFB;&#x7EDF;&#x4E0B;&#x7684;&#x7ED8;&#x753B;&#x533A;&#x57DF;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x7ED8;&#x753B;&#x5B9E;&#x73B0;&#x4E2D;&#xFF0C;&#x4F60;&#x521B;&#x5EFA;&#x4E86;&#x4E2A;&#x81EA;&#x5B9A;&#x4E49;&#x7684;view&#xFF0C;&#x5F53;&#x4F60;&#x7ED8;&#x56FE;&#x7684;&#x65F6;&#x5019;&#x53EA;&#x4F1A;&#x7528;&#x5230;bounds&#xFF0C;&#x4E0D;&#x8981;&#x5728;view&#x7684;&#x5B9E;&#x73B0;&#x91CC;&#x9762;&#x7528;&#x53E6;&#x5916;&#x4E24;&#x4E2A;&#xFF0C;&#x522B;&#x7BA1;&#x539F;&#x56E0;&#x8FD9;&#x4E48;&#x505A;&#x5C31;&#x597D;&#x4E86;&#x3002;</p>
<p><strong>center</strong>:&#x5728;&#x7236;view&#x5750;&#x6807;&#x7CFB;&#x7EDF;&#x4E2D;&#x4F60;&#x7684;view&#x7684;&#x4E2D;&#x5FC3;&#x70B9;</p>
<p><strong>frame</strong>:&#x5728;&#x7236;view&#x5750;&#x6807;&#x7CFB;&#x7EDF;&#x4E2D;&#x5BB9;&#x7EB3;&#x4F60;&#x7684;view&#x7684;&#x6846;</p>
<p>center&#x548C;frame&#x53EA;&#x7528;&#x6765;&#x5728;&#x7236;view&#x4E2D;&#x5B9A;&#x4F4D;&#x4F60;&#x7684;view&#xFF0C;&#x4E24;&#x8005;&#x662F;&#x8054;&#x52A8;&#x7684;&#x3002;&#x5F53;&#x4F60;center&#x4F1A;&#x79FB;&#x52A8;frame&#xFF1B;&#x8BBE;&#x7F6E;frame&#x4E5F;&#x5C31;&#x8BBE;&#x7F6E;&#x4E86;center&#x3002;</p>
<p><strong>&#x6C38;&#x8FDC;&#x4E0D;&#x8981;&#x5728;view&#x7684;&#x5B9E;&#x73B0;&#x91CC;&#x7528;frame&#x548C;center&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x662F;&#x7528;&#x6765;&#x5B9A;&#x4F4D;&#x7684;</strong></p>
<h2 id="Creating-Views"><a href="#Creating-Views" class="headerlink" title="Creating Views"></a>Creating Views</h2><pre><code>&#x4E00;&#x662F;&#x901A;&#x8FC7;storyboard&#x8FDB;&#x884C;&#x62D6;&#x62FD;&#xFF1B;&#x4E8C;&#x662F;&#x4F7F;&#x7528;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x5316;&#x3002;
</code></pre><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br></pre></td><td class="code"><pre><span class="line">UILabel *labei = [[UILabel alloc] initWithFrame:CGRectMake(x, y, width, height)];</span><br><span class="line">label.text = @&quot;HelloWorld&quot;;</span><br><span class="line">[self.view addSubview: label];</span><br></pre></td></tr></table></figure>
<h2 id="Custom-View"><a href="#Custom-View" class="headerlink" title="Custom View"></a>Custom View</h2><pre><code>&#x90A3;&#x4E48;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x81EA;&#x5DF1;&#x7684;UIView&#x5B50;&#x7C7B;&#x5462;&#xFF1F;
</code></pre><p>&#x6211;&#x6307;&#x7684;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x7C7B;&#xFF0C;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x4F1A;&#x88AB;&#x7528;&#x5230;&#x3002;</p>
<p>view&#x662F;&#x7528;&#x6765;&#x63A7;&#x5236;&#x7ED8;&#x56FE;&#x548C;&#x89E6;&#x6478;&#x4E8B;&#x4EF6;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x662F;&#x5F53;&#x4F60;&#x9700;&#x8981;&#x7ED8;&#x5236;&#x7279;&#x6B8A;&#x56FE;&#x5F62;&#x6216;&#x8005;&#x60F3;&#x8981;&#x63A7;&#x5236;&#x89E6;&#x6478;&#x4E8B;&#x4EF6;&#x7684;&#x65F6;&#x5019;&#x3002;</p>
<p>&#x6B64;&#x65F6;&#x4E5F;&#x8BB8;&#x4F1A;&#x6709;&#x4EBA;&#x95EE;&#xFF0C;&#x201C;&#x90A3;&#x6211;&#x7EE7;&#x627F;UIButton&#x53EF;&#x4EE5;&#x5417;&#xFF1F;&#x56E0;&#x4E3A;&#x6211;&#x4E3B;&#x8981;&#x9700;&#x8981;&#x7684;&#x5C31;&#x662F;UIButton&#x90A3;&#x6837;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x53EA;&#x662F;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#x7684;&#x5904;&#x7406;&#x4E0D;&#x540C;&#x3002;&#x201D;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x5EFA;&#x8BAE;&#x662F;&#x4E0D;&#x8981;&#x7EE7;&#x627F;&#x8FD9;&#x4E9B;&#x5185;&#x7F6E;&#x7C7B;&#x578B;&#xFF0C;&#x5B83;&#x4EEC;&#x53EA;&#x88AB;&#x4F18;&#x5316;&#x4E3A;&#x62D6;&#x51FA;&#x6765;&#x4F7F;&#x7528;&#xFF0C;&#x800C;&#x6CA1;&#x6709;&#x4F18;&#x5316;&#x8FC7;&#x7EE7;&#x627F;&#x548C;&#x91CD;&#x8F7D;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x53EA;&#x662F;&#x4E0D;&#x5EFA;&#x8BAE;&#x8FD9;&#x4E48;&#x505A;&#x7F62;&#x4E86;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x4F1A;&#x7528;&#x5230;&#x4E00;&#x4E9B;drawRect&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x5173;&#x4E8E;&#x8FD9;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x8BE6;&#x89C1;&#x6211;&#x7684;&#x53E6;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x3002;</p>
<p>&#x6211;&#x6709;&#x4E86;drawRect&#xFF0C;&#x90A3;&#x4E48;&#x63A5;&#x4E0B;&#x6765;&#x5982;&#x4F55;&#x53BB;&#x91CD;&#x8F7D;&#x5B83;&#x6765;&#x7ED8;&#x5236;&#x6211;&#x7684;&#x81EA;&#x5B9A;&#x4E49;view&#xFF1F;</p>
<p>&#x7B54;&#x6848;&#x662F;&#x7528;CGFramework&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E3B;&#x8981;&#x4F1A;&#x7528;&#x5230;&#x7684;&#x975E;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;framework&#x3002;&#x4ED6;&#x662F;C-APIs&#xFF0C;&#x4F46;&#x662F;&#x7528;&#x8D77;&#x6765;&#x7B80;&#x5355;&#x591A;&#x4E86;&#x3002;</p>
<p>CGFramework&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x662F;&#x4F60;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x73AF;&#x5883;&#xFF0C;&#x7136;&#x540E;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E9B;&#x8F68;&#x8FF9;&#x6BD4;&#x5982;&#x76F4;&#x7EBF;&#x548C;&#x5F27;&#x7EBF;&#xFF0C;&#x518D;&#x8BBE;&#x7F6E;&#x4ED6;&#x4EEC;&#x7684;&#x5B57;&#x4F53;&#x989C;&#x8272;&#x6837;&#x5F0F;&#x7B49;&#x5E76;&#x63CF;&#x8FB9;&#x6216;&#x586B;&#x5145;&#x5230;&#x8F68;&#x8FF9;&#x91CC;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x7ED8;&#x56FE;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x8981;&#x8BB2;&#x4E00;&#x4E2A;&#x7ED8;&#x5236;&#x56FE;&#x7247;&#x548C;&#x6587;&#x5B57;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x624D;&#x662F;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x3002;&#x6587;&#x5B57;&#x548C;&#x8F68;&#x8FF9;&#x662F;&#x4E00;&#x56DE;&#x4E8B;&#xFF0C;&#x5C31;&#x662F;&#x5F88;&#x591A;&#x7CBE;&#x7EC6;&#x7684;&#x5F27;&#x7EBF;&#x7EC4;&#x6210;&#x7684;&#xFF0C;&#x8FD9;&#x4E9B;&#x5F53;&#x7136;&#x90FD;&#x662F;&#x7CFB;&#x7EDF;&#x5E2E;&#x4F60;&#x505A;&#x597D;&#x7684;&#x3002;&#x7ED8;&#x5236;&#x56FE;&#x7247;&#x5C31;&#x662F;&#x590D;&#x5236;&#x4E8C;&#x8FDB;&#x5236;&#x7801;&#x3002;</p>
<h2 id="Context"><a href="#Context" class="headerlink" title="Context"></a>Context</h2><pre><code>&#x73AF;&#x5883;&#x51B3;&#x5B9A;&#x4E86;&#x4F60;&#x5728;&#x54EA;&#x7ED8;&#x56FE;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x521B;&#x5EFA;&#x73AF;&#x5883;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x51B3;&#x5B9A;&#x4E86;&#x8981;&#x5728;&#x90A3;&#x7ED8;&#x56FE;&#x3002;
</code></pre><p>&#x4F7F;&#x7528;drawRect&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x68D2;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5C31;&#x662F;&#x4F60;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x8FD9;&#x4E2A;&#x3002;&#x56E0;&#x4E3A;&#x4F60;&#x8FDB;&#x5165;drawRect&#x540E;&#x4F1A;&#x8C03;&#x7528;&#x4E00;&#x4E2A;C&#x51FD;&#x6570;&#xFF0C;&#x4ED6;&#x4F1A;&#x7ED9;&#x4F60;&#x7CFB;&#x7EDF;&#x51C6;&#x5907;&#x7ED8;&#x56FE;&#x7684;&#x73AF;&#x5883;&#x3002;</p>
<p>&#x7CFB;&#x7EDF;&#x53EF;&#x80FD;&#x662F;&#x8981;&#x6253;&#x5370; &#xFF0C;&#x5F53;&#x6253;&#x5370;&#x7684;&#x65F6;&#x5019;&#x4F60;&#x4F1A;&#x5728;drawRect&#x91CC;&#x53D1;&#x73B0;&#x6253;&#x5370;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x8981;&#x6253;&#x5370;&#x4E2A;&#x5927;&#x4E1C;&#x897F;&#xFF0C;&#x4F46;&#x662F;&#x5F97;&#x5230;&#x7684;&#x73AF;&#x5883;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;</p>
<p>&#x5173;&#x4E8E;&#x8FD9;&#x4E2A;&#x73AF;&#x5883;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x6709;&#x4E00;&#x70B9;&#xFF0C;&#x5C31;&#x662F;&#x6BCF;&#x6B21;&#x8C03;&#x7528;drawRect&#x73AF;&#x5883;&#x90FD;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x8981;&#x628A;&#x4ED6;&#x4FDD;&#x5B58;&#x8D77;&#x6765;&#xFF0C;&#x800C;&#x662F;&#x53BB;&#x83B7;&#x53D6;&#x65B0;&#x7684;&#x73AF;&#x5883;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">CGContextRef context = UIGraphicsGetCurrentContext();</span><br></pre></td></tr></table></figure>
<p>&#x8FD9;&#x662F;&#x8C03;&#x7528;drawRect&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E5F;&#x51E0;&#x4E4E;&#x662F;&#x6BCF;&#x4E2A;drawRect&#x7684;&#x7B2C;&#x4E00;&#x884C;&#x3002;CGContextRef&#x662F;&#x4E00;&#x4E2A;cookie&#xFF0C;&#x4F60;&#x4E0D;&#x77E5;&#x9053;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x4ED6;&#x4E0D;&#x662F;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;*&#x3002;&#x8C03;&#x7528;&#x4E0A;&#x9762;&#x7684;&#x90A3;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x4F60;&#x5C31;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;context&#x3002;</p>
<p>&#x5F53;&#x4F60;&#x6709;&#x4E86;&#x73AF;&#x5883;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x7ED8;&#x5236;&#x8F68;&#x8FF9;&#x4E86;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br></pre></td><td class="code"><pre><span class="line">//Begin the path</span><br><span class="line">CGContextBeginPath(context);</span><br><span class="line"></span><br><span class="line">//Move around,add lines or arcs to the path</span><br><span class="line">CGContextMoveToPoint(context, 75, 10);</span><br><span class="line">CGContextAddLineToPoint(context, 160, 150);</span><br><span class="line">CGContextAddLineToPoint(context, 10, 150);</span><br><span class="line"></span><br><span class="line">//Close the path(connects the last point to the first)</span><br><span class="line">CGContextClosePath(context);</span><br></pre></td></tr></table></figure>
<p>&#x4E0A;&#x9762;&#x770B;&#x4E0A;&#x53BB;&#x6211;&#x753B;&#x4E86;&#x4E00;&#x4E2A;&#x4E09;&#x89D2;&#x5F62;&#xFF0C;&#x4F46;&#x662F;&#x53EA;&#x6709;&#x4E0A;&#x9762;&#x51E0;&#x884C;&#x4EE3;&#x7801;&#x7684;&#x8BDD;&#x5176;&#x5B9E;&#x4EC0;&#x4E48;&#x4E5F;&#x6CA1;&#x753B;&#xFF0C;&#x867D;&#x7136;&#x8F68;&#x8FF9;&#x88AB;&#x521B;&#x5EFA;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x771F;&#x7684;&#x753B;&#x5230;&#x5C4F;&#x5E55;&#x4E0A;&#x53BB;&#x3002;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x8FD9;&#x6837;&#xFF1F;</p>
<p>&#x90A3;&#x662F;&#x56E0;&#x4E3A;&#x4F60;&#x9700;&#x8981;&#x63CF;&#x8FB9;(stroke)&#x6216;&#x8005;&#x586B;&#x5145;(fill)&#x6765;&#x663E;&#x793A;&#x8F68;&#x8FF9;&#x3002;</p>
<p>&#x5728;&#x63CF;&#x8FB9;&#x6216;&#x586B;&#x5145;&#x4E4B;&#x524D;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x56FE;&#x5F62;&#x5C5E;&#x6027;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x7528;&#x4E86;UIColor&#x6765;&#x8BBE;&#x7F6E;&#x989C;&#x8272;&#x3002;&#x5173;&#x4E8E;UIColor&#xFF0C;&#x6211;&#x7684;&#x53E6;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x4F1A;&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x5230;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">[[UIColor greenColor] setfill];</span><br><span class="line">[[UIColor redColor] setStroke];</span><br></pre></td></tr></table></figure>
<p>&#x6211;&#x5728;&#x8FD9;&#x91CC;&#x8BBE;&#x7F6E;&#x4E86;&#x63CF;&#x8FB9;&#x548C;&#x586B;&#x5145;&#xFF0C;&#x8FD8;&#x662F;&#x4EC0;&#x4E48;&#x90FD;&#x6CA1;&#x753B;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x8C03;&#x7528;CGContextDrawPath&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">CGContextDrawPath(context, kCGPathFillStroke);</span><br><span class="line">//&#x8FD9;&#x4E2A;&#x53C2;&#x6570;kCGPathFillStroke&#x662F;&#x5E38;&#x4EAE;&#x6807;&#x5FD7;&#xFF0C;&#x8868;&#x793A;&#x63CF;&#x8FB9;&#x548C;&#x586B;&#x5145;&#x8FD8;&#x662F;&#x4EC5;&#x63CF;&#x8FB9;&#x6216;&#x4EC5;&#x586B;&#x5145;&#x3002;</span><br></pre></td></tr></table></figure>
<p>&#x5176;&#x5B9E;&#x8FD8;&#x53EF;&#x4EE5;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x8F68;&#x8FF9;&#xFF0C;&#x4FDD;&#x5B58;&#x5230;&#x4E00;&#x4E2A;&#x8F68;&#x8FF9;&#x53D8;&#x91CF;CGPath&#xFF0C;&#x4F60;&#x7528;&#x5B8C;&#x4E86;&#x4E4B;&#x540E;&#x8FD8;&#x53EF;&#x4EE5;&#x4EA4;&#x7ED9;&#x5176;&#x4ED6;&#x73AF;&#x5883;&#x7EE7;&#x7EED;&#x7528;&#x3002;</p>

      
    </div><!-- .entry-content -->

    <footer class="entry-meta">
    <a href="/2016/07/19/views/">
    <time datetime="2016-07-19T06:30:11.000Z" class="entry-date">
        2016-07-19
    </time>
</a>
    
  <span class="article-delim">&#8226;</span>
  <div class="article-category">
  <a class="article-category-link" href="/categories/iOS/">iOS</a>
  </div>

    
  <span class="article-delim">&#8226;</span>
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/UIView/">UIView</a></li></ul>

    </footer>
</article>






  
  
    <nav id="pagination">
      <nav id="page-nav">
        <a class="extend prev" rel="prev" href="/page/2/">&laquo; Prev</a><a class="page-number" href="/">1</a><a class="page-number" href="/page/2/">2</a><span class="page-number current">3</span><a class="page-number" href="/page/4/">4</a><a class="page-number" href="/page/5/">5</a><a class="page-number" href="/page/6/">6</a><a class="extend next" rel="next" href="/page/4/">Next &raquo;</a>
      </nav>
    </nav>
  

</div></div>
        <div id="secondary" class="widget-area" role="complementary">
  
    <aside id="search" class="widget widget_search"><form role="search" method="get" accept-charset="utf-8" id="searchform" class="searchform" action="//google.com/search">
    <div>
        <input type="text" value="" name="s" id="s" />
        <input type="submit" id="searchsubmit" value="搜索" />
    </div>
</form></aside>
  
    
  
    
  <aside class="widget">
    <h3 class="widget-title">Categories</h3>
    <div class="widget-content">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/LIFE/">LIFE</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/MAC/">MAC</a><span class="category-list-count">2</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/iOS/">iOS</a><span class="category-list-count">7</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/御宅文化/">御宅文化</a><span class="category-list-count">2</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/编程/">编程</a><span class="category-list-count">15</span></li></ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Recents</h3>
    <div class="widget-content">
      <ul>
        
          <li>
            <a href="/2016/09/25/栈基础函数C语言实现/">栈基础函数C语言实现</a>
          </li>
        
          <li>
            <a href="/2016/09/24/栈，队列，数组/">栈，队列，数组</a>
          </li>
        
          <li>
            <a href="/2016/09/23/素数筛C-实现/">素数筛C++实现</a>
          </li>
        
          <li>
            <a href="/2016/09/22/线性表基础函数C语言实现/">线性表基础函数C语言实现</a>
          </li>
        
          <li>
            <a href="/2016/09/21/O-n-解决三维数组赋值/">O(n)解决三维数组赋值</a>
          </li>
        
      </ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Tags</h3>
    <div class="widget-content">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/Cocoapods/">Cocoapods</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/HTML/">HTML</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Matlab/">Matlab</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIColor/">UIColor</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView/">UIView</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView-圆角/">UIView-圆角</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/bug/">bug</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/hexo/">hexo</a><span class="tag-list-count">4</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/指针/">指针</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/数据结构/">数据结构</a><span class="tag-list-count">3</span></li></ul>
    </div>
  </aside>

  
    
<div class="widget tag">
<h3 class="title">blogroll</h3>
<ul class="entry">


<li><a href="https://github.com/" target="_blank">github</a></li>


<li><a href="http://www.jianshu.com/users/41cd7711ed44/latest_articles" target="_blank">我的简书主页</a></li>

</ul>
</div>

  
</div>
      </div>
      <footer id="colophon" role="contentinfo">
    <p>&copy; 2016 SaberDa
    All rights reserved.</p>
    <p>Powered by <a href="http://hexo.io/" target="_blank">Hexo</a></p>
</footer>
    <script>window._bd_share_config={"common":{"bdSnsKey":{},"bdText":"","bdMini":"1","bdMiniList":false,"bdPic":"","bdStyle":"2","bdSize":"16"},"share":{}};with(document)0[(getElementsByTagName('head')[0]||body).appendChild(createElement('script')).src='http://bdimg.share.baidu.com/static/api/js/share.js?v=89860593.js?cdnversion='+~(-new Date()/36e5)];</script>

<script src="/js/jquery-2.0.3.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

<script src="/js/navigation.js"></script>

<div id="bg"></div>

  </div>
</body>
</html>