<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  
  <meta name="description" content="阿尔托利亚是我老婆~" />
  

  
  
  
  
  
  
  <title>模拟退火 | SaberDa的幻想乡</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x6A21;&amp;#x62DF;&amp;#x9000;&amp;#x706B;&amp;#x662F;&amp;#x4E00;&amp;#x79CD;&amp;#x901A;&amp;#x7528;&amp;#x6982;&amp;#x7387;&amp;#x7B97;&amp;#x6CD5;&amp;#xFF0C;&amp;#x7528;&amp;#x6765;&amp;#x5728;&amp;#x56FA;&amp;#x5B9A;&amp;#x65F6;&amp;#x95F4;&amp;#x5185;&amp;#x5BFB;&amp;#x6C42;&amp;#x4E00;">
<meta property="og:type" content="article">
<meta property="og:title" content="模拟退火">
<meta property="og:url" content="https://saberda.github.io/2017/04/21/模拟退火/index.html">
<meta property="og:site_name" content="SaberDa的幻想乡">
<meta property="og:description" content="&amp;#x6A21;&amp;#x62DF;&amp;#x9000;&amp;#x706B;&amp;#x662F;&amp;#x4E00;&amp;#x79CD;&amp;#x901A;&amp;#x7528;&amp;#x6982;&amp;#x7387;&amp;#x7B97;&amp;#x6CD5;&amp;#xFF0C;&amp;#x7528;&amp;#x6765;&amp;#x5728;&amp;#x56FA;&amp;#x5B9A;&amp;#x65F6;&amp;#x95F4;&amp;#x5185;&amp;#x5BFB;&amp;#x6C42;&amp;#x4E00;">
<meta property="og:image" content="https://saberda.github.io/2017/04/21/模拟退火/1.png">
<meta property="og:updated_time" content="2017-04-21T15:22:03.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="模拟退火">
<meta name="twitter:description" content="&amp;#x6A21;&amp;#x62DF;&amp;#x9000;&amp;#x706B;&amp;#x662F;&amp;#x4E00;&amp;#x79CD;&amp;#x901A;&amp;#x7528;&amp;#x6982;&amp;#x7387;&amp;#x7B97;&amp;#x6CD5;&amp;#xFF0C;&amp;#x7528;&amp;#x6765;&amp;#x5728;&amp;#x56FA;&amp;#x5B9A;&amp;#x65F6;&amp;#x95F4;&amp;#x5185;&amp;#x5BFB;&amp;#x6C42;&amp;#x4E00;">
<meta name="twitter:image" content="https://saberda.github.io/2017/04/21/模拟退火/1.png">
  
  
    <link rel="icon" href="/css/images/favicon.ico">
  
  <link rel="stylesheet" href="/css/style.css">
  

  
  <!-- baidu webmaster push -->
  <script src='//push.zhanzhang.baidu.com/push.js'></script>
</head>
<body class="home blog custom-background custom-font-enabled single-author">
  <div id="page" class="hfeed site">
      <header id="masthead" class="site-header" role="banner">
    <hgroup>
      <h1 class="site-title">
        <a href="/" title="SaberDa的幻想乡" rel="home">SaberDa的幻想乡</a>
      </h1>
      
        <h2 class="site-description">
          <a href="/" id="subtitle">　　iOS/ ML　　|　　二次元　　|　　saberda@qq.com　　|　　从花时间省钱到花钱省时间</a>
        </h2>
      
    </hgroup>

    <nav id="site-navigation" class="main-navigation" role="navigation">
            <button class="menu-toggle">菜单</button>
            <a class="assistive-text" href="/#content" title="跳至内容">跳至内容</a><!--TODO-->
            <div class="menu-main-container">
                <ul id="menu-main" class="nav-menu">
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/archives">所有文章</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/">主页</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/编程/">编程</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/iOS/">iOS</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/ML/">ML</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/PGM/">PGM</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/MAC/">MAC</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/御宅文化/">御宅文化</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/LIFE/">LIFE</a></li>
                
                </ul>
            </div>
    </nav>
</header>
      <div id="main" class="wrapper">
        <div id="primary" class="site-content"><div id="content" role="main"><article id="post-模拟退火" class="post-模拟退火 post type-post status-publish format-standard hentry">
    <!---->

      <header class="entry-header">
        
        
  
    <h1 class="entry-title article-title">
      模拟退火
    </h1>
  

        
        <div class="comments-link">
            
            <a href="javascript:void(0);" data-url="https://saberda.github.io/2017/04/21/模拟退火/" data-id="cja3xch5q008j19b3admxmdhz" class="leave-reply bdsharebuttonbox" data-cmd="more">Share</a>
        </div><!-- .comments-link -->
      </header><!-- .entry-header -->

    <div class="entry-content">
      
        <p>&#x6A21;&#x62DF;&#x9000;&#x706B;&#x662F;&#x4E00;&#x79CD;&#x901A;&#x7528;&#x6982;&#x7387;&#x7B97;&#x6CD5;&#xFF0C;&#x7528;&#x6765;&#x5728;&#x56FA;&#x5B9A;&#x65F6;&#x95F4;&#x5185;&#x5BFB;&#x6C42;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x5BFB;&#x627E;&#x7A7A;&#x95F4;&#x5185;&#x627E;&#x5230;&#x7684;&#x6700;&#x4F18;&#x89E3;&#x3002;</p>
<h2 id="&#x7B80;&#x4ECB;"><a href="#&#x7B80;&#x4ECB;" class="headerlink" title="&#x7B80;&#x4ECB;"></a>&#x7B80;&#x4ECB;</h2><p>&#x6A21;&#x62DF;&#x9000;&#x706B;&#x6765;&#x81EA;&#x51B6;&#x91D1;&#x5B66;&#x7684;&#x4E13;&#x6709;&#x540D;&#x8BCD;&#x9000;&#x706B;&#x3002;&#x9000;&#x706B;&#x662F;&#x5C06;&#x6750;&#x6599;&#x52A0;&#x70ED;&#x540E;&#x518D;&#x7ECF;&#x7279;&#x5B9A;&#x901F;&#x7387;&#x51B7;&#x5374;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x589E;&#x5927;&#x6676;&#x7C92;&#x4F53;&#x79EF;&#xFF0C;&#x5E76;&#x4E14;&#x51CF;&#x5C11;&#x6676;&#x683C;&#x4E2D;&#x7684;&#x7F3A;&#x9677;&#x3002;&#x6750;&#x6599;&#x4E2D;&#x7684;&#x539F;&#x5B50;&#x539F;&#x6765;&#x4F1A;&#x505C;&#x7559;&#x5728;&#x4F7F;&#x5185;&#x80FD;&#x6709;&#x5C40;&#x90E8;&#x6700;&#x5C0F;&#x503C;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x800C;&#x968F;&#x673A;&#x5728;&#x5176;&#x4ED6;&#x4F4D;&#x7F6E;&#x4E2D;&#x79FB;&#x52A8;&#x3002;&#x9000;&#x706B;&#x51B7;&#x5374;&#x65F6;&#x901F;&#x5EA6;&#x8F83;&#x6162;&#xFF0C;&#x4F7F;&#x5F97;&#x539F;&#x5B50;&#x6709;&#x8F83;&#x591A;&#x53EF;&#x80FD;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x5185;&#x80FD;&#x6BD4;&#x539F;&#x6765;&#x66F4;&#x4F4E;&#x7684;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x6A21;&#x62DF;&#x9000;&#x706B;&#x7684;&#x539F;&#x7406;&#x4E5F;&#x548C;&#x91D1;&#x5C5E;&#x9000;&#x706B;&#x7684;&#x539F;&#x7406;&#x8FD1;&#x4F3C;&#xFF1A;&#x6211;&#x4EEC;&#x5C06;&#x70ED;&#x529B;&#x5B66;&#x7684;&#x7406;&#x8BBA;&#x5957;&#x7528;&#x5230;&#x7EDF;&#x8BA1;&#x5B66;&#x4E0A;&#xFF0C;&#x5C06;&#x641C;&#x5BFB;&#x7A7A;&#x95F4;&#x5185;&#x6BCF;&#x4E00;&#x70B9;&#x60F3;&#x50CF;&#x6210;&#x7A7A;&#x6C14;&#x5185;&#x7684;&#x5206;&#x5B50;&#xFF1B;&#x5206;&#x5B50;&#x7684;&#x80FD;&#x91CF;&#xFF0C;&#x5C31;&#x662F;&#x5B83;&#x672C;&#x8EAB;&#x7684;&#x52A8;&#x80FD;&#xFF1B;&#x800C;&#x641C;&#x5BFB;&#x7A7A;&#x95F4;&#x5185;&#x7684;&#x6BCF;&#x4E00;&#x70B9;&#xFF0C;&#x4E5F;&#x50CF;&#x7A7A;&#x6C14;&#x5206;&#x5B50;&#x4E00;&#x6837;&#x5E26;&#x6709;&#x201C;&#x80FD;&#x91CF;&#x201D;&#xFF0C;&#x4EE5;&#x8868;&#x793A;&#x8BE5;&#x70B9;&#x5BF9;&#x547D;&#x9898;&#x7684;&#x5408;&#x9002;&#x7A0B;&#x5EA6;&#x3002;&#x7B97;&#x6CD5;&#x5148;&#x4EE5;&#x641C;&#x5BFB;&#x7A7A;&#x95F4;&#x5185;&#x4E00;&#x4E2A;&#x4EFB;&#x610F;&#x70B9;&#x4F5C;&#x8D77;&#x59CB;&#xFF1A;&#x6BCF;&#x4E00;&#x6B65;&#x5148;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x201C;&#x90BB;&#x5C45;&#x201D;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x8BA1;&#x7B97;&#x4ECE;&#x73B0;&#x6709;&#x4F4D;&#x7F6E;&#x5230;&#x8FBE;&#x201C;&#x90BB;&#x5C45;&#x201D;&#x7684;&#x6982;&#x7387;&#x3002;</p>
<a id="more"></a>
<p>&#x6A21;&#x62DF;&#x9000;&#x706B;&#x95EE;&#x9898;&#x5927;&#x65B9;&#x5411;&#x662F;&#x5C5E;&#x4E8E;&#x8D2A;&#x5FC3;&#x7B97;&#x6CD5;&#x4E00;&#x7C7B;&#xFF0C;&#x5173;&#x4E8E;&#x8D2A;&#x5FC3;&#x7B97;&#x6CD5;&#x7684;&#x4ECB;&#x7ECD;&#xFF0C;&#x8BE6;&#x89C1;&#x6211;&#x7684;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;</p>
<p><a href="http://www.saberismywife.com/2016/11/08/&#x8BE6;&#x63A2;&#x8D2A;&#x5FC3;&#x7B97;&#x6CD5;/" target="_blank" rel="external">&#x8BE6;&#x63A2;&#x8D2A;&#x5FC3;&#x7B97;&#x6CD5;</a></p>
<h2 id="&#x6A21;&#x62DF;&#x9000;&#x706B;"><a href="#&#x6A21;&#x62DF;&#x9000;&#x706B;" class="headerlink" title="&#x6A21;&#x62DF;&#x9000;&#x706B;"></a>&#x6A21;&#x62DF;&#x9000;&#x706B;</h2><p>&#x8003;&#x8651;&#x5BFB;&#x627E;&#x4E00;&#x4E2A;&#x4F4E;&#x80FD;&#x91CF;&#x7CFB;&#x7EDF;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5176;&#x72B6;&#x6001;&#x7531;&#x4E00;&#x4E2A;&#x9A6C;&#x5C14;&#x79D1;&#x592B;&#x94FE;&#x6392;&#x5E8F;&#x3002;</p>
<center>F = &lt; E &gt; - TH</center>

<p>&#x5176;&#x4E2D; F &#x8868;&#x793A;&#x7684;&#x662F;&#x7269;&#x7406;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x81EA;&#x7531;&#x80FD;&#x91CF;&#x3002;</p>
<p>&#x6E29;&#x5EA6; T &#x53EF;&#x89C6;&#x4E3A;&#x4E00;&#x79CD;&#x4F2A;&#x6E29;&#x5EA6;&#xFF0C;&#x5B83;&#x63A7;&#x5236;&#x8868;&#x793A;&#x795E;&#x7ECF;&#x5143;&#x201C;&#x7A81;&#x89E6;&#x566A;&#x58F0;&#x201D;&#x7684;&#x70ED;&#x6CE2;&#x52A8;&#x3002;&#x5B83;&#x7684;&#x7CBE;&#x786E;&#x6807;&#x5EA6;&#x56E0;&#x800C;&#x65E0;&#x5173;&#x7D27;&#x8981;&#x3002;&#x76F8;&#x5E94;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x6982;&#x7387; p<sub>i</sub> &#x548C;&#x629B;&#x5206;&#x51FD;&#x6570;(partition&#x51FD;&#x6570;) Z &#x5982;&#x4E0B;&#xFF1A;</p>
<center>p<sub>i</sub> = Z<sup>-1</sup>(-E<sub>i</sub> / T)</center>

<p>&#x548C;</p>
<center>Z = &#x2211; exp(-E<sub>i</sub> / T)</center>

<p>&#x7531;F = &lt; E &gt; - TH&#x89C2;&#x5BDF;&#x5230;&#x5F53;&#x6E29;&#x5EA6; T &#x8D8B;&#x8FD1;&#x4E8E;&#x96F6;&#xFF0C;&#x7CFB;&#x7EDF;&#x7684;&#x81EA;&#x7531;&#x80FD;&#x91CF;F&#x8D8B;&#x8FD1;&#x5E73;&#x5747;&#x80FD;&#x91CF; <e>&#x3002;&#x7531; F -&gt; &lt; E &gt;&#xFF0C;&#x6211;&#x4EEC;&#x89C2;&#x5BDF;&#x5230;&#x7531;&#x81EA;&#x7531;&#x80FD;&#x91CF;&#x6700;&#x5C0F;&#x5316;&#x539F;&#x5219;&#xFF0C;&#x8BE5;&#x9A6C;&#x5C14;&#x79D1;&#x592B;&#x94FE;&#x7684;&#x5E73;&#x7A33;&#x5206;&#x5E03;(&#x5373;Gibbs&#x5206;&#x5E03;)&#xFF0C;&#x5F53; T -&gt; 0 &#x65F6;&#x584C;&#x9677;&#x5230;&#x5E73;&#x5747;&#x80FD;&#x91CF; &lt; E &gt; &#x7684;&#x5168;&#x5C40;&#x6700;&#x5C0F;&#x70B9;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5E8F;&#x5217;&#x4E2D;&#x7684;&#x4F4E;&#x80FD;&#x72B6;&#x6001;&#x5728;&#x4F4E;&#x6E29;&#x65F6;&#x53D7;&#x5230;&#x66F4;&#x5F3A;&#x7684;&#x652F;&#x6301;&#x3002;&#x8FD9;&#x4E9B;&#x89C2;&#x5BDF;&#x4FC3;&#x4F7F;&#x6211;&#x4EEC;&#x63D0;&#x51FA;&#x95EE;&#x9898;&#xFF1A;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x7B80;&#x5355;&#x5E94;&#x7528; Metropolis &#x7B97;&#x6CD5;&#x4EA7;&#x751F;&#x5927;&#x91CF;&#x7684;&#x4EE3;&#x8868;&#x8BE5;&#x968F;&#x673A;&#x7CFB;&#x7EDF;&#x5728;&#x4F4E;&#x6E29;&#x4E0B;&#x7684;&#x6784;&#x6210;(Configuration)&#xFF1F;&#x6211;&#x4EEC;&#x4E0D;&#x63D0;&#x5021;&#x4F7F;&#x7528;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x7B56;&#x7565;&#x662F;&#x56E0;&#x4E3A;&#x5728;&#x5F88;&#x4F4E;&#x6E29;&#x5EA6;&#x4E0B;&#x9A6C;&#x5C14;&#x79D1;&#x592B;&#x94FE;&#x5230;&#x70ED;&#x5E73;&#x8861;&#x7684;&#x6536;&#x655B;&#x901F;&#x5EA6;&#x7279;&#x522B;&#x6162;&#x3002;&#x800C;&#x63D0;&#x9AD8;&#x8BA1;&#x7B97;&#x6548;&#x7387;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5728;&#x8F83;&#x9AD8;&#x6E29;&#x5EA6;&#x8FD0;&#x884C;&#x968F;&#x673A;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD9;&#x662F;&#x8FBE;&#x5230;&#x5E73;&#x8861;&#x72B6;&#x6001;&#x7684;&#x6536;&#x655B;&#x76F8;&#x5F53;&#x5FEB;&#xFF0C;&#x63A5;&#x7740;&#x968F;&#x6E29;&#x5EA6;&#x7684;&#x7CBE;&#x7EC6;&#x4E0B;&#x964D;&#x4FDD;&#x6301;&#x7CFB;&#x7EDF;&#x7684;&#x5E73;&#x8861;&#x6001;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x76F8;&#x5173;&#x6210;&#x5206;&#x7684;&#x7EC4;&#x5408;&#xFF1A;</e></p>
<ul>
<li>&#x4E00;&#x4E2A;&#x51B3;&#x5B9A;&#x6E29;&#x5EA6;&#x4E0B;&#x964D;&#x901F;&#x5EA6;&#x7684;&#x8C03;&#x5EA6;&#x8868;</li>
<li>&#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#x8FED;&#x4EE3;&#x6C42;&#x89E3;&#x6BCF;&#x4E2A;&#x6E29;&#x5EA6;&#x8868;&#x7ED9;&#x51FA;&#x7684;&#x65B0;&#x7684;&#x6E29;&#x5EA6;&#x4E0B;&#x7684;&#x5E73;&#x8861;&#x5206;&#x5E03;&#xFF0C;&#x8FD9;&#x662F;&#x5229;&#x7528;&#x524D;&#x9762;&#x6E29;&#x5EA6;&#x65F6;&#x7684;&#x6700;&#x7EC8;&#x72B6;&#x6001;&#x4F5C;&#x4E3A;&#x65B0;&#x6E29;&#x5EA6;&#x65F6;&#x7684;&#x8D77;&#x59CB;&#x70B9;</li>
</ul>
<p>&#x6211;&#x4EEC;&#x521A;&#x624D;&#x63D0;&#x5230;&#x7684;&#x4E24;&#x6B65;&#x683C;&#x5F0F;&#x662F;&#x88AB;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x7684;&#x4EE5;&#x6A21;&#x62DF;&#x9000;&#x706B;&#x8457;&#x79F0;&#x7684;&#x968F;&#x673A;&#x677E;&#x5F1B;&#x6280;&#x672F;&#x7684;&#x7CBE;&#x534E;&#x3002;</p>
<p>&#x6A21;&#x62DF;&#x9000;&#x706B;&#x7684;&#x6700;&#x521D;&#x7684;&#x76EE;&#x7684;&#x662F;&#x5BFB;&#x627E;&#x523B;&#x753B;&#x590D;&#x6742;&#x5927;&#x7CFB;&#x7EDF;&#x7684;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x7684;&#x5168;&#x5C40;&#x6700;&#x5C0F;&#x70B9;&#x3002;&#x6B63;&#x5F0F;&#x56E0;&#x4E3A;&#x5982;&#x6B64;&#xFF0C;&#x4ED6;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x6C42;&#x89E3;&#x975E;&#x51F8;&#x6700;&#x4F18;&#x5316;&#x95EE;&#x9898;&#x7684;&#x6709;&#x529B;&#x5DE5;&#x5177;</p>
<blockquote>
<p>&#x5F53;&#x4F18;&#x5316;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5E9E;&#x5927;&#x7684;&#x5927;&#x7CFB;&#x7EDF;&#xFF08;&#x5373;&#x5177;&#x6709;&#x8BB8;&#x591A;&#x81EA;&#x7531;&#x5EA6;&#x7684;&#x7CFB;&#x7EDF;&#xFF09;&#x65F6;&#x4E0D;&#x8981;&#x6C42;&#x603B;&#x662F;&#x4E0B;&#x964D;&#x800C;&#x662F;&#x8BD5;&#x56FE;&#x8981;&#x6C42;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#x5728;&#x4E0B;&#x964D;</p>
</blockquote>
<p>&#x6A21;&#x62DF;&#x9000;&#x706B;&#x5728;&#x4E24;&#x65B9;&#x9762;&#x4E0E;&#x4F20;&#x7EDF;&#x7684;&#x8FED;&#x4EE3;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#x4E0D;&#x540C;&#xFF1A;</p>
<ul>
<li>&#x7B97;&#x6CD5;&#x4E0D;&#x4F1A;&#x9677;&#x5165;&#x5C40;&#x90E8;&#x6700;&#x5C0F;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x7CFB;&#x7EDF;&#x5728;&#x975E;&#x96F6;&#x5EA6;&#x6E29;&#x5EA6;&#x4E0A;&#x8FD0;&#x884C;&#x65F6;&#x8131;&#x79BB;&#x5C40;&#x90E8;&#x6700;&#x5C0F;&#x603B;&#x662F;&#x53EF;&#x80FD;&#x7684;</li>
<li>&#x6A21;&#x62DF;&#x9000;&#x706B;&#x662F;&#x81EA;&#x9002;&#x5E94;&#x7684;&#xFF0C;&#x5728;&#x9AD8;&#x6E29;&#x65F6;&#x770B;&#x89C1;&#x7CFB;&#x7EDF;&#x7684;&#x7EC8;&#x6001;&#x7684;&#x5927;&#x81F4;&#x8F6E;&#x5ED3;&#xFF0C;&#x800C;&#x5B83;&#x7684;&#x5177;&#x4F53;&#x7EC6;&#x8282;&#x5728;&#x4F4E;&#x6E29;&#x5EA6;&#x65F6;&#x624D;&#x5448;&#x73B0;&#x51FA;&#x6765;&#x3002;</li>
</ul>
<h2 id="&#x6F14;&#x7B97;&#x6B65;&#x9AA4;"><a href="#&#x6F14;&#x7B97;&#x6B65;&#x9AA4;" class="headerlink" title="&#x6F14;&#x7B97;&#x6B65;&#x9AA4;"></a>&#x6F14;&#x7B97;&#x6B65;&#x9AA4;</h2><p><strong><u>&#x521D;&#x59CB;&#x5316;</u></strong></p>
<p>&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x53EF;&#x884C;&#x7684;&#x89E3;&#x4F5C;&#x4E3A;&#x5F53;&#x524D;&#x89E3;&#x8F93;&#x5165;&#x8FED;&#x4EE3;&#x8FC7;&#x7A0B;&#xFF0C;&#x5E76;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x8DB3;&#x591F;&#x5927;&#x7684;&#x6570;&#x503C;&#x4F5C;&#x4E3A;&#x521D;&#x59CB;&#x6E29;&#x5EA6;&#x3002;</p>
<p><strong><u>&#x8FED;&#x4EE3;&#x8FC7;&#x7A0B;</u></strong></p>
<p>&#x8FED;&#x4EE3;&#x8FC7;&#x7A0B;&#x662F;&#x6A21;&#x62DF;&#x9000;&#x706B;&#x7B97;&#x6CD5;&#x7684;&#x6838;&#x5FC3;&#x6B65;&#x9AA4;&#xFF0C;&#x5206;&#x4E3A;&#x65B0;&#x89E3;&#x7684;&#x4EA7;&#x751F;&#x548C;&#x63A5;&#x53D7;&#x65B0;&#x89E3;&#x4E24;&#x90E8;&#x5206;&#xFF1A;</p>
<ul>
<li>&#x7531;&#x4E00;&#x4E2A;&#x4EA7;&#x751F;&#x51FD;&#x6570;&#x4ECE;&#x5F53;&#x524D;&#x89E3;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x4F4D;&#x4E8E;&#x89E3;&#x7A7A;&#x95F4;&#x7684;&#x65B0;&#x89E3;&#xFF1B;&#x4E3A;&#x4FBF;&#x4E8E;&#x540E;&#x7EED;&#x7684;&#x8BA1;&#x7B97;&#x548C;&#x63A5;&#x53D7;&#xFF0C;&#x51CF;&#x5C11;&#x7B97;&#x6CD5;&#x8017;&#x65F6;&#xFF0C;&#x901A;&#x5E38;&#x9009;&#x62E9;&#x7531;&#x5F53;&#x524D;&#x65B0;&#x89E3;&#x7ECF;&#x8FC7;&#x7B80;&#x5355;&#x5730;&#x53D8;&#x6362;&#x5373;&#x53EF;&#x4EA7;&#x751F;&#x65B0;&#x89E3;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5982;&#x5BF9;&#x6784;&#x6210;&#x65B0;&#x89E3;&#x7684;&#x5168;&#x90E8;&#x6216;&#x90E8;&#x5206;&#x5143;&#x7D20;&#x8FDB;&#x884C;&#x7F6E;&#x6362;&#x3001;&#x4E92;&#x6362;&#x7B49;&#xFF0C;&#x6CE8;&#x610F;&#x5230;&#x4EA7;&#x751F;&#x65B0;&#x89E3;&#x7684;&#x53D8;&#x6362;&#x65B9;&#x6CD5;&#x51B3;&#x5B9A;&#x4E86;&#x5F53;&#x524D;&#x65B0;&#x89E3;&#x7684;&#x90BB;&#x57DF;&#x7ED3;&#x6784;&#xFF0C;&#x56E0;&#x800C;&#x5BF9;&#x51B7;&#x5374;&#x8FDB;&#x5EA6;&#x8868;&#x7684;&#x9009;&#x53D6;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x5F71;&#x54CD;&#x3002;</li>
<li>&#x8BA1;&#x7B97;&#x4E0E;&#x65B0;&#x89E3;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x5DEE;&#x3002;&#x56E0;&#x4E3A;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x5DEE;&#x4EC5;&#x7531;&#x53D8;&#x6362;&#x90E8;&#x5206;&#x4EA7;&#x751F;&#xFF0C;&#x6240;&#x4EE5;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x5DEE;&#x7684;&#x8BA1;&#x7B97;&#x6700;&#x597D;&#x6309;&#x589E;&#x91CF;&#x8BA1;&#x7B97;&#x3002;&#x4E8B;&#x5B9E;&#x8868;&#x660E;&#xFF0C;&#x5BF9;&#x5927;&#x591A;&#x6570;&#x5E94;&#x7528;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x662F;&#x8BA1;&#x7B97;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x5DEE;&#x7684;&#x6700;&#x5FEB;&#x65B9;&#x6CD5;&#x3002;</li>
<li>&#x5224;&#x65AD;&#x65B0;&#x89E3;&#x662F;&#x5426;&#x88AB;&#x63A5;&#x53D7;&#xFF0C;&#x5224;&#x65AD;&#x7684;&#x4F9D;&#x636E;&#x662F;&#x4E00;&#x4E2A;&#x63A5;&#x53D7;&#x51C6;&#x5219;&#xFF0C;&#x6700;&#x5E38;&#x7528;&#x7684;&#x63A5;&#x53D7;&#x51C6;&#x5219;&#x662F;Metropolis&#x51C6;&#x5219;&#xFF1A;&#x82E5;&#x394;t&#x2032;&lt;0&#x5219;&#x63A5;&#x53D7;S&#x2032;&#x4F5C;&#x4E3A;&#x65B0;&#x7684;&#x5F53;&#x524D;&#x89E3;S&#xFF0C;&#x5426;&#x5219;&#x4EE5;&#x6982;&#x7387;exp&#xFF08;-&#x394;t&#x2032;/T&#xFF09;&#x63A5;&#x53D7;S&#x2032;&#x4F5C;&#x4E3A;&#x65B0;&#x7684;&#x5F53;&#x524D;&#x89E3;S&#x3002;</li>
<li>&#x5F53;&#x65B0;&#x89E3;&#x88AB;&#x786E;&#x5B9A;&#x63A5;&#x53D7;&#x65F6;&#xFF0C;&#x7528;&#x65B0;&#x89E3;&#x4EE3;&#x66FF;&#x5F53;&#x524D;&#x89E3;&#xFF0C;&#x8FD9;&#x53EA;&#x9700;&#x5C06;&#x5F53;&#x524D;&#x89E3;&#x4E2D;&#x5BF9;&#x5E94;&#x4E8E;&#x4EA7;&#x751F;&#x65B0;&#x89E3;&#x65F6;&#x7684;&#x53D8;&#x6362;&#x90E8;&#x5206;&#x4E88;&#x4EE5;&#x5B9E;&#x73B0;&#xFF0C;&#x540C;&#x65F6;&#x4FEE;&#x6B63;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x503C;&#x5373;&#x53EF;&#x3002;&#x6B64;&#x65F6;&#xFF0C;&#x5F53;&#x524D;&#x89E3;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x6B21;&#x8FED;&#x4EE3;&#x3002;&#x53EF;&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#x5F00;&#x59CB;&#x4E0B;&#x4E00;&#x8F6E;&#x8BD5;&#x9A8C;&#x3002;&#x800C;&#x5F53;&#x65B0;&#x89E3;&#x88AB;&#x5224;&#x5B9A;&#x4E3A;&#x820D;&#x5F03;&#x65F6;&#xFF0C;&#x5219;&#x5728;&#x539F;&#x5F53;&#x524D;&#x89E3;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x7EE7;&#x7EED;&#x4E0B;&#x4E00;&#x8F6E;&#x8BD5;&#x9A8C;&#x3002;</li>
</ul>
<p>&#x6A21;&#x62DF;&#x9000;&#x706B;&#x7B97;&#x6CD5;&#x4E0E;&#x521D;&#x59CB;&#x503C;&#x65E0;&#x5173;&#xFF0C;&#x7B97;&#x6CD5;&#x6C42;&#x5F97;&#x7684;&#x89E3;&#x4E0E;&#x521D;&#x59CB;&#x89E3;&#x72B6;&#x6001;S&#xFF08;&#x662F;&#x7B97;&#x6CD5;&#x8FED;&#x4EE3;&#x7684;&#x8D77;&#x70B9;&#xFF09;&#x65E0;&#x5173;&#xFF1B;&#x6A21;&#x62DF;&#x9000;&#x706B;&#x7B97;&#x6CD5;&#x5177;&#x6709;&#x6E10;&#x8FD1;&#x6536;&#x655B;&#x6027;&#xFF0C;&#x5DF2;&#x5728;&#x7406;&#x8BBA;&#x4E0A;&#x88AB;&#x8BC1;&#x660E;&#x662F;&#x4E00;&#x79CD;&#x4EE5;&#x6982;&#x7387;1&#x6536;&#x655B;&#x4E8E;&#x5168;&#x5C40;&#x6700;&#x4F18;&#x89E3;&#x7684;&#x5168;&#x5C40;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#xFF1B;&#x6A21;&#x62DF;&#x9000;&#x706B;&#x7B97;&#x6CD5;&#x5177;&#x6709;&#x5E76;&#x884C;&#x6027;&#x3002;</p>
<p><strong><u>&#x505C;&#x6B62;&#x51C6;&#x5219;</u></strong></p>
<p>&#x6E29;&#x5EA6;T&#x964D;&#x81F3;&#x67D0;&#x6700;&#x4F4E;&#x503C;&#x65F6;&#xFF0C;&#x5B8C;&#x6210;&#x7ED9;&#x5B9A;&#x6570;&#x91CF;&#x8FED;&#x4EE3;&#x4E2D;&#x65E0;&#x6CD5;&#x63A5;&#x53D7;&#x65B0;&#x89E3;&#xFF0C;&#x505C;&#x6B62;&#x8FED;&#x4EE3;&#xFF0C;&#x63A5;&#x53D7;&#x5F53;&#x524D;&#x5BFB;&#x627E;&#x7684;&#x6700;&#x4F18;&#x89E3;&#x4E3A;&#x6700;&#x7EC8;&#x89E3;&#x3002;</p>
<p><strong><u>&#x9000;&#x706B;&#x65B9;&#x6848;</u></strong></p>
<p>&#x5728;&#x67D0;&#x4E2A;&#x6E29;&#x5EA6;&#x72B6;&#x6001;T&#x4E0B;&#xFF0C;&#x5F53;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x8FED;&#x4EE3;&#x64CD;&#x4F5C;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x964D;&#x4F4E;&#x6E29;&#x5EA6;T&#xFF0C;&#x5728;&#x65B0;&#x7684;&#x6E29;&#x5EA6;&#x72B6;&#x6001;&#x4E0B;&#x6267;&#x884C;&#x4E0B;&#x4E00;&#x4E2A;&#x6279;&#x6B21;&#x7684;&#x8FED;&#x4EE3;&#x64CD;&#x4F5C;&#x3002;</p>
<h2 id="&#x9000;&#x706B;&#x8FDB;&#x5EA6;&#x8868;"><a href="#&#x9000;&#x706B;&#x8FDB;&#x5EA6;&#x8868;" class="headerlink" title="&#x9000;&#x706B;&#x8FDB;&#x5EA6;&#x8868;"></a>&#x9000;&#x706B;&#x8FDB;&#x5EA6;&#x8868;</h2><p>&#x5982;&#x524D;&#x9762;&#x6240;&#x63D0;&#x5230;&#x7684;&#xFF0C;&#x6A21;&#x62DF;&#x9000;&#x706B;&#x8FC7;&#x7A0B;&#x7684;&#x57FA;&#x7840;&#x662F; Metropolis &#x7B97;&#x6CD5;&#xFF0C;&#x5176;&#x95F4;&#x6E29;&#x5EA6; T &#x6162;&#x6162;&#x4E0B;&#x964D;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x6E29;&#x5EA6; T &#x8D77;&#x8C03;&#x8282;&#x4F5C;&#x7528;&#x3002;&#x5047;&#x5B9A;&#x6E29;&#x5EA6;&#x4E0B;&#x964D;&#x6CA1;&#x6709;&#x5BF9;&#x6570;&#x5FEB;&#xFF0C;&#x5219;&#x6A21;&#x62DF;&#x9000;&#x706B;&#x8FC7;&#x7A0B;&#x5C06;&#x624B;&#x94FE;&#x4E8E;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x6700;&#x5C0F;&#x80FD;&#x91CF;&#x7684;&#x6784;&#x578B;&#x3002;&#x9057;&#x61BE;&#x7684;&#x662F;&#x8FD9;&#x79CD;&#x9000;&#x706B;&#x8FDB;&#x5EA6;&#x592A;&#x6162;&#x4E86;&#x2013;&#x6162;&#x7684;&#x4E0D;&#x5207;&#x5B9E;&#x9645;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x6C42;&#x8BF8;&#x4E8E;&#x7B97;&#x6CD5;&#x7684;&#x6E10;&#x8FDB;&#x6536;&#x655B;&#x7684;&#x6709;&#x9650;&#x65F6;&#x95F4;&#x903C;&#x8FD1;&#x3002;&#x8FD9;&#x79CD;&#x903C;&#x8FD1;&#x6240;&#x4ED8;&#x51FA;&#x7684;&#x4EE3;&#x4EF7;&#x662F;&#x7B97;&#x6CD5;&#x4E0D;&#x518D;&#x4EE5;&#x6982;&#x7387; 1 &#x4FDD;&#x8BC1;&#x627E;&#x5230;&#x5168;&#x5C40;&#x6700;&#x5C0F;&#x70B9;&#x3002;&#x7136;&#x800C;&#x7B97;&#x6CD5;&#x7684;&#x903C;&#x8FD1;&#x7ED3;&#x679C;&#x5728;&#x8BB8;&#x591A;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#x80FD;&#x4EA7;&#x751F;&#x8FD1;&#x4F3C;&#x6700;&#x4F18;&#x89E3;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x6A21;&#x62DF;&#x9000;&#x706B;&#x7B97;&#x6CD5;&#x7684;&#x6709;&#x9650;&#x65F6;&#x95F4;&#x63A5;&#x8FD1;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x8BBE;&#x5B9A;&#x4E00;&#x7CFB;&#x5217;&#x63A7;&#x5236;&#x7B97;&#x6CD5;&#x7684;&#x6709;&#x9650;&#x5E8F;&#x5217;&#x503C;&#xFF0C;&#x4EE5;&#x53CA;&#x6BCF;&#x4E00;&#x6E29;&#x5EA6;&#x503C;&#x4E0B;&#x6709;&#x9650;&#x7684;&#x8F6C;&#x79FB;&#x5C1D;&#x8BD5;&#x6B21;&#x6570;&#x3002;Kirlpatrick &#x7B49;&#x7ED9;&#x51FA;&#x7684;&#x9000;&#x706B;&#x8FDB;&#x5EA6;&#x8868;&#x7684;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x53C2;&#x6570;&#x8BBE;&#x5B9A;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li><strong>&#x6E29;&#x5EA6;&#x7684;&#x521D;&#x59CB;&#x503C;</strong>&#x3002;&#x6E29;&#x5EA6;&#x7684;&#x521D;&#x59CB;&#x503C; T<sub>0</sub> &#x9009;&#x7684;&#x8DB3;&#x591F;&#x9AD8;&#x4F7F;&#x5F97;&#x6240;&#x6709;&#x63D0;&#x51FA;&#x7684;&#x8F6C;&#x79FB;&#x5B9E;&#x9645;&#x90FD;&#x80FD;&#x88AB;&#x6A21;&#x62DF;&#x9000;&#x706B;&#x7B97;&#x6CD5;&#x6240;&#x63A5;&#x53D7;</li>
<li><strong>&#x6E29;&#x5EA6;&#x7684;&#x4E0B;&#x964D;</strong>&#x3002;&#x4E00;&#x822C;&#x5730;&#x8BF4;&#xFF0C;&#x51B7;&#x5374;&#x662F;&#x6309;&#x6307;&#x6570;&#x5F62;&#x5F0F;&#x5B8C;&#x6210;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x6E29;&#x5EA6;&#x503C;&#x7684;&#x6539;&#x53D8;&#x91CF;&#x90FD;&#x5F88;&#x5C0F;&#x3002;&#x7279;&#x522B;&#x5730;&#xFF0C;&#x4E0B;&#x964D;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x4E3A;&#xFF1A; T<sub>k</sub> = &#x3B1; * T<sub>k-1</sub>, k = 1,2,3&#x2026; &#x5176;&#x4E2D; &#x3B1; &#x5C0F;&#x4E8E;&#x4F46;&#x63A5;&#x8FD1;&#x4E8E;1&#x3002;&#x3B1; &#x7684;&#x5178;&#x578B;&#x503C;&#x4ECB;&#x4E8E; 0.8 &#x5230; 0.99 &#x4E4B;&#x95F4;&#x3002;&#x5BF9;&#x6BCF;&#x4E00;&#x6E29;&#x5EA6;&#xFF0C;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x8F6C;&#x79FB;&#x7684;&#x5C1D;&#x8BD5;&#xFF0C;&#x4F7F;&#x5F97;&#x5E73;&#x5747;&#x6BCF;&#x6B21;&#x5B9E;&#x9A8C;&#x6709; 10 &#x6B21;&#x8F6C;&#x79FB;&#x88AB;&#x63A5;&#x53D7;&#x3002;</li>
<li><strong>&#x6E29;&#x5EA6;&#x7684;&#x6700;&#x540E;&#x503C;</strong>&#x3002;&#x5982;&#x679C;&#x5728;&#x4E09;&#x6B21;&#x76F8;&#x8FDE;&#x7684;&#x6E29;&#x5EA6;&#x4E0B;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x9884;&#x671F;&#x7684;&#x63A5;&#x6536;&#x6B21;&#x6570;&#xFF0C;&#x5219;&#x7CFB;&#x7EDF;&#x88AB;&#x51BB;&#x7ED3;&#x4E14;&#x9000;&#x706B;&#x505C;&#x6B62;&#x3002;</li>
</ul>
<p>&#x540E;&#x4E00;&#x4E2A;&#x6807;&#x51C6;&#x53EF;&#x4EE5;&#x6539;&#x8FDB;&#xFF0C;&#x8981;&#x6C42;&#x63A5;&#x53D7;&#x7387;&#x5C0F;&#x4E8E;&#x4E00;&#x9884;&#x5B9A;&#x503C;&#xFF0C;&#x800C;&#x63A5;&#x53D7;&#x7387;&#x5B9A;&#x4E49;&#x4E3A;&#x8F6C;&#x79FB;&#x63A5;&#x53D7;&#x7684;&#x6B21;&#x6570;&#x9664;&#x4EE5;&#x63D0;&#x51FA;&#x8F6C;&#x79FB;&#x7684;&#x6B21;&#x6570;&#x3002;</p>
<h2 id="&#x6A21;&#x62DF;&#x9000;&#x706B;&#x7528;&#x4E8E;&#x7EC4;&#x5408;&#x4F18;&#x5316;"><a href="#&#x6A21;&#x62DF;&#x9000;&#x706B;&#x7528;&#x4E8E;&#x7EC4;&#x5408;&#x4F18;&#x5316;" class="headerlink" title="&#x6A21;&#x62DF;&#x9000;&#x706B;&#x7528;&#x4E8E;&#x7EC4;&#x5408;&#x4F18;&#x5316;"></a>&#x6A21;&#x62DF;&#x9000;&#x706B;&#x7528;&#x4E8E;&#x7EC4;&#x5408;&#x4F18;&#x5316;</h2><p>&#x6A21;&#x62DF;&#x9000;&#x706B;&#x7279;&#x522B;&#x9002;&#x7528;&#x4E8E;&#x89E3;&#x7EC4;&#x5408;&#x4F18;&#x5316;&#x95EE;&#x9898;&#x3002;&#x7EC4;&#x5408;&#x4F18;&#x5316;&#x7684;&#x76EE;&#x6807;&#x662F;&#x9488;&#x5BF9;&#x6709;&#x5F88;&#x591A;&#x53EF;&#x80FD;&#x89E3;&#x7684;&#x6709;&#x9650;&#x79BB;&#x6563;&#x7CFB;&#x7EDF;&#xFF0C;&#x6700;&#x5C0F;&#x5316;&#x5B83;&#x7684;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x3002;&#x672C;&#x8D28;&#x4E0A;&#x8BB2;&#x6A21;&#x62DF;&#x9000;&#x706B;&#x5229;&#x7528; Metropolis &#x7B97;&#x6CD5;&#x901A;&#x8FC7;&#x591A;&#x7C92;&#x5B50;&#x7269;&#x7406;&#x7CFB;&#x7EDF;&#x548C;&#x7EC4;&#x5408;&#x4F18;&#x5316;&#x95EE;&#x9898;&#x95F4;&#x7684;&#x7C7B;&#x6BD4;&#x4E00;&#x4E9B;&#x5217;&#x89E3;&#x3002;</p>
<p>&#x5728;&#x6A21;&#x62DF;&#x9000;&#x706B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x4E0A;&#x9762;&#x5F0F;&#x5B50;&#x4E2D;&#x7684; p<sub>i</sub> &#x7684; Gibbs &#x5206;&#x5E03;&#x4E2D;&#x7684;&#x80FD;&#x91CF; E<sub>i</sub> &#x89E3;&#x91CA;&#x6210;&#x80FD;&#x91CF;&#x7684;&#x4EE3;&#x4EF7;&#xFF0C;&#x800C;&#x6E29;&#x5EA6; T &#x89E3;&#x91CA;&#x4E3A;&#x63A7;&#x5236;&#x53C2;&#x6570;&#x3002;&#x5728;&#x7EC4;&#x5408;&#x4F18;&#x5316;&#x95EE;&#x9898;&#x4E2D;&#x5BF9;&#x6BCF;&#x4E00;&#x6784;&#x578B;&#x8D4B;&#x4E88;&#x4E00;&#x6570;&#x503C;&#x7684;&#x4EE3;&#x4EF7;&#x4EE5;&#x63CF;&#x8FF0;&#x8FD9;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x6784;&#x578B;&#x548C;&#x89E3;&#x7684;&#x5DEE;&#x5F02;&#x3002;&#x6A21;&#x62DF;&#x9000;&#x706B;&#x7A0B;&#x5E8F;&#x4E2D;&#x4E0B;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x8003;&#x8651;&#x7684;&#x95EE;&#x9898;&#x662F;&#x786E;&#x8BA4;&#x6784;&#x578B;&#x548C;&#x4ECE;&#x5DF2;&#x6709;&#x6784;&#x578B;&#x4EE5;&#x5C40;&#x90E8;&#x65B9;&#x5F0F;&#x4EA7;&#x751F;&#x65B0;&#x7684;&#x6784;&#x578B;&#x3002;&#x8FD9;&#x5C31;&#x662F; Metropolis &#x7B97;&#x6CD5;&#x53D1;&#x6325;&#x4F5C;&#x7528;&#x4E4B;&#x5904;&#x3002;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x6982;&#x62EC;&#x7EDF;&#x8BA1;&#x7269;&#x7406;&#x7684;&#x672F;&#x8BED;&#x548C;&#x7EC4;&#x5408;&#x4F18;&#x5316;&#x672F;&#x8BED;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x5982;&#x4E0B;&#x8868;&#x6240;&#x793A;&#x3002;</p>
<p><img src="/2017/04/21/&#x6A21;&#x62DF;&#x9000;&#x706B;/1.png" alt=""></p>
<h2 id="&#x4F2A;&#x4EE3;&#x7801;"><a href="#&#x4F2A;&#x4EE3;&#x7801;" class="headerlink" title="&#x4F2A;&#x4EE3;&#x7801;"></a>&#x4F2A;&#x4EE3;&#x7801;</h2><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div><div class="line">17</div><div class="line">18</div><div class="line">19</div><div class="line">20</div><div class="line">21</div><div class="line">22</div><div class="line">23</div><div class="line">24</div><div class="line">25</div><div class="line">26</div></pre></td><td class="code"><pre><div class="line">/*</div><div class="line"> *  J(y)&#xFF1A;&#x5728;&#x72B6;&#x6001;y&#x65F6;&#x7684;&#x8BC4;&#x4EF7;&#x51FD;&#x6570;&#x503C;</div><div class="line"> *  Y(i)&#xFF1A;&#x8868;&#x793A;&#x5F53;&#x524D;&#x72B6;&#x6001;</div><div class="line"> *  Y(i+1)&#xFF1A;&#x8868;&#x793A;&#x65B0;&#x7684;&#x72B6;&#x6001;</div><div class="line"> *  r&#xFF1A; &#x7528;&#x4E8E;&#x63A7;&#x5236;&#x964D;&#x6E29;&#x7684;&#x5FEB;&#x6162;</div><div class="line"> *  T&#xFF1A; &#x7CFB;&#x7EDF;&#x7684;&#x6E29;&#x5EA6;&#xFF0C;&#x7CFB;&#x7EDF;&#x521D;&#x59CB;&#x5E94;&#x8BE5;&#x8981;&#x5904;&#x4E8E;&#x4E00;&#x4E2A;&#x9AD8;&#x6E29;&#x7684;&#x72B6;&#x6001;</div><div class="line"> *  T_min &#xFF1A;&#x6E29;&#x5EA6;&#x7684;&#x4E0B;&#x9650;&#xFF0C;&#x82E5;&#x6E29;&#x5EA6;T&#x8FBE;&#x5230;T_min&#xFF0C;&#x5219;&#x505C;&#x6B62;&#x641C;&#x7D22;</div><div class="line">*/</div><div class="line">while( T &gt; T_min ) {</div><div class="line">&#x3000;&#x3000;dE = J( Y(i+1) ) - J( Y(i) ) ;  </div><div class="line">	 //&#x8868;&#x8FBE;&#x79FB;&#x52A8;&#x540E;&#x5F97;&#x5230;&#x66F4;&#x4F18;&#x89E3;&#xFF0C;&#x5219;&#x603B;&#x662F;&#x63A5;&#x53D7;&#x79FB;&#x52A8;</div><div class="line">&#x3000;&#x3000;if ( dE &gt;= 0 ) </div><div class="line">&#x3000;&#x3000;		//&#x63A5;&#x53D7;&#x4ECE;Y(i)&#x5230;Y(i+1)&#x7684;&#x79FB;&#x52A8;</div><div class="line">        Y(i+1) = Y(i) ;  </div><div class="line">&#x3000;&#x3000;else {t</div><div class="line">    // &#x51FD;&#x6570;exp( dE/T )&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x662F;(0,1) &#xFF0C;dE/T&#x8D8A;&#x5927;&#xFF0C;&#x5219;exp( dE/T )&#x4E5F;&#x8D8A;&#x5927;</div><div class="line">        if ( exp( dE/T ) &gt; random( 0 , 1 ) ) </div><div class="line">        		 //&#x63A5;&#x53D7;&#x4ECE;Y(i)&#x5230;Y(i+1)&#x7684;&#x79FB;&#x52A8;</div><div class="line">            Y(i+1) = Y(i); </div><div class="line">&#x3000;&#x3000;}</div><div class="line">&#x3000;&#x3000;//&#x964D;&#x6E29;&#x9000;&#x706B; &#xFF0C;0&lt;r&lt;1 &#x3002;r&#x8D8A;&#x5927;&#xFF0C;&#x964D;&#x6E29;&#x8D8A;&#x6162;&#xFF1B;r&#x8D8A;&#x5C0F;&#xFF0C;&#x964D;&#x6E29;&#x8D8A;&#x5FEB;</div><div class="line">&#x3000;&#x3000;T = r * T ;  </div><div class="line">&#x3000;&#x3000;//&#x82E5;r&#x8FC7;&#x5927;&#xFF0C;&#x5219;&#x641C;&#x7D22;&#x5230;&#x5168;&#x5C40;&#x6700;&#x4F18;&#x89E3;&#x7684;&#x53EF;&#x80FD;&#x4F1A;&#x8F83;&#x9AD8;&#xFF0C;&#x4F46;&#x641C;&#x7D22;&#x7684;&#x8FC7;&#x7A0B;&#x4E5F;&#x5C31;&#x8F83;&#x957F;&#x3002;</div><div class="line">&#x3000;&#x3000;//&#x82E5;r&#x8FC7;&#x5C0F;&#xFF0C;&#x5219;&#x641C;&#x7D22;&#x7684;&#x8FC7;&#x7A0B;&#x4F1A;&#x5F88;&#x5FEB;&#xFF0C;&#x4F46;&#x6700;&#x7EC8;&#x53EF;&#x80FD;&#x4F1A;&#x8FBE;&#x5230;&#x4E00;&#x4E2A;&#x5C40;&#x90E8;&#x6700;&#x4F18;&#x503C;</div><div class="line">&#x3000;&#x3000;i ++ ;</div><div class="line">}</div></pre></td></tr></table></figure>
<h2 id="&#x5C0F;&#x7ED3;"><a href="#&#x5C0F;&#x7ED3;" class="headerlink" title="&#x5C0F;&#x7ED3;"></a>&#x5C0F;&#x7ED3;</h2><p>&#x6A21;&#x62DF;&#x9000;&#x706B;&#x7528;&#x767D;&#x8BDD;&#x6765;&#x8BB2;&#x5C31;&#x50CF;&#x5F53;&#x4E8E;&#x4E00;&#x4E2A;&#x8FDB;&#x5316;&#x7248;&#x7684;&#x722C;&#x5C71;&#x7B97;&#x6CD5;&#xFF08;&#x722C;&#x5C71;&#x7B97;&#x6CD5;&#xFF1A;&#x53EA;&#x80FD;&#x641C;&#x7D22;&#x5230;&#x5C40;&#x90E8;&#x7684;&#x6700;&#x4F18;&#x89E3;&#xFF09;&#xFF0C;&#x800C;&#x6A21;&#x62DF;&#x9000;&#x706B;&#x5728;&#x641C;&#x7D22;&#x8FC7;&#x7A0B;&#x4E2D;&#x5F15;&#x5165;&#x4E86;&#x968F;&#x673A;&#x56E0;&#x7D20;&#x3002;</p>
<p>&#x5373;&#x6A21;&#x62DF;&#x7B97;&#x6CD5;&#x4EE5;&#x4E00;&#x5B9A;&#x7684;&#x6982;&#x7387;&#x6765;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x6BD4;&#x5F53;&#x524D;&#x89E3;&#x8981;&#x5DEE;&#x7684;&#x89E3;&#xFF0C;&#x56E0;&#x6B64;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x8DF3;&#x51FA;&#x8FD9;&#x4E2A;&#x5C40;&#x90E8;&#x7684;&#x6700;&#x4F18;&#x89E3;&#xFF0C;&#x4ECE;&#x800C;&#x8FBE;&#x5230;&#x5168;&#x5C40;&#x7684;&#x6700;&#x4F18;&#x89E3;&#x3002;</p>
<p>&#x7B80;&#x5355;&#x63CF;&#x8FF0;&#xFF1A;</p>
<ul>
<li>&#x82E5;J( Y(i+1) )&gt;= J( Y(i) )  (&#x5373;&#x79FB;&#x52A8;&#x540E;&#x5F97;&#x5230;&#x66F4;&#x4F18;&#x89E3;)&#xFF0C;&#x5219;&#x603B;&#x662F;&#x63A5;&#x53D7;&#x8BE5;&#x79FB;&#x52A8;</li>
<li>&#x82E5;J( Y(i+1) )&lt; J( Y(i) )  (&#x5373;&#x79FB;&#x52A8;&#x540E;&#x7684;&#x89E3;&#x6BD4;&#x5F53;&#x524D;&#x89E3;&#x8981;&#x5DEE;)&#xFF0C;&#x5219;&#x4EE5;&#x4E00;&#x5B9A;&#x7684;&#x6982;&#x7387;&#x63A5;&#x53D7;&#x79FB;&#x52A8;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x4E2A;&#x6982;&#x7387;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x63A8;&#x79FB;&#x9010;&#x6E10;&#x964D;&#x4F4E;&#xFF08;&#x9010;&#x6E10;&#x964D;&#x4F4E;&#x624D;&#x80FD;&#x8D8B;&#x5411;&#x7A33;&#x5B9A;&#xFF09;</li>
</ul>
<p>&#x6A21;&#x62DF;&#x9000;&#x706B;&#x7B97;&#x6CD5;&#x662F;&#x4E00;&#x79CD;&#x968F;&#x673A;&#x7B97;&#x6CD5;&#xFF0C;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x80FD;&#x627E;&#x5230;&#x5168;&#x5C40;&#x7684;&#x6700;&#x4F18;&#x89E3;&#xFF0C;&#x53EF;&#x4EE5;&#x6BD4;&#x8F83;&#x5FEB;&#x7684;&#x627E;&#x5230;&#x95EE;&#x9898;&#x7684;&#x8FD1;&#x4F3C;&#x6700;&#x4F18;&#x89E3;&#x3002; &#x5982;&#x679C;&#x53C2;&#x6570;&#x8BBE;&#x7F6E;&#x5F97;&#x5F53;&#xFF0C;&#x6A21;&#x62DF;&#x9000;&#x706B;&#x7B97;&#x6CD5;&#x641C;&#x7D22;&#x6548;&#x7387;&#x6BD4;&#x7A77;&#x4E3E;&#x6CD5;&#x8981;&#x9AD8;&#x3002;</p>

      
    </div><!-- .entry-content -->

    <footer class="entry-meta">
    <a href="/2017/04/21/模拟退火/">
    <time datetime="2017-04-21T13:48:33.000Z" class="entry-date">
        2017-04-21
    </time>
</a>
    
  <span class="article-delim">&#8226;</span>
  <div class="article-category">
  <a class="article-category-link" href="/categories/ML/">ML</a>
  </div>

    
  <span class="article-delim">&#8226;</span>
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/Machine-Learning/">Machine Learning</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/算法/">算法</a></li></ul>

    </footer>
</article>


    
<nav class="nav-single">
    <h3 class="assistive-text">文章导航</h3>
    
        <span class="nav-previous"><a href="/2017/05/15/二维码/" rel="prev"><span class="meta-nav">←</span> 详细谈谈二维码生成原理与编码（一）</a></span>
    
    
        <span class="nav-next"><a href="/2017/04/17/支持向量机/" rel="next">支持向量机与核函数 <span class="meta-nav">→</span></a></span>
    
</nav><!-- .nav-single -->







</div></div>
        <div id="secondary" class="widget-area" role="complementary">
  
    <aside id="search" class="widget widget_search"><form role="search" method="get" accept-charset="utf-8" id="searchform" class="searchform" action="//google.com/search">
    <div>
        <input type="text" value="" name="s" id="s" />
        <input type="submit" id="searchsubmit" value="搜索" />
    </div>
</form></aside>
  
    
  
    
  <aside class="widget">
    <h3 class="widget-title">Categories</h3>
    <div class="widget-content">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/LIFE/">LIFE</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/MAC/">MAC</a><span class="category-list-count">3</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/ML/">ML</a><span class="category-list-count">25</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/PGM/">PGM</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/iOS/">iOS</a><span class="category-list-count">22</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/御宅文化/">御宅文化</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/算法/">算法</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/编程/">编程</a><span class="category-list-count">58</span></li></ul>
    </div>
  </aside>

  
    
<div class="widget tag">
<h3 class="title">blogroll</h3>
<ul class="entry">


<li><a href="https://github.com/" target="_blank">我的github</a></li>


<li><a href="http://www.jianshu.com/users/41cd7711ed44/latest_articles" target="_blank">我的简书主页</a></li>


<li><a href="http://uuzdaisuki.com" target="_blank">leticia’s blog</a></li>


<li><a href="http://www.helloyzy.cn" target="_blank">acery</a></li>


<li><a href="http://wxjackie.com" target="_blank">WXJACKIE</a></li>


<li><a href="http://www.stephenzhang.me" target="_blank">stephenzhang</a></li>


<li><a href="blog.keybrl.com" target="_blank">keybrl</a></li>


<li><a href="http://www.ciaran.cn/" target="_blank">Ciaran</a></li>


<li><a href="http://1.dev.blog.qinka.pro" target="_blank">Qinka</a></li>


<li><a href="http://tobiasLee.top" target="_blank">TobiasLee</a></li>


<li><a href="http://blog.boileryao.com" target="_blank">bingo</a></li>

</ul>
</div>

  
    
  <aside class="widget">
    <h3 class="widget-title">Recents</h3>
    <div class="widget-content">
      <ul>
        
          <li>
            <a href="/2017/11/17/如何在Xcode中添加-bits-stdc-h-头文件/">如何在Xcode中添加&lt;bits/stdc++.h&gt;头文件</a>
          </li>
        
          <li>
            <a href="/2017/11/02/LSTM/">RNN 与 LSTM</a>
          </li>
        
          <li>
            <a href="/2017/11/01/循环神经网络-RNN/">循环神经网络_RNN</a>
          </li>
        
          <li>
            <a href="/2017/10/31/CNN之定位检测/">卷积神经网络之定位检测</a>
          </li>
        
          <li>
            <a href="/2017/10/27/CNN-Structure-2/">CNN_Structure_2</a>
          </li>
        
      </ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Tags</h3>
    <div class="widget-content">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/Cloud-Computing/">Cloud Computing</a><span class="tag-list-count">3</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Cocoapods/">Cocoapods</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/HTML/">HTML</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Linux/">Linux</a><span class="tag-list-count">15</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Machine-Learning/">Machine Learning</a><span class="tag-list-count">17</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Matlab/">Matlab</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Neural-Networks/">Neural Networks</a><span class="tag-list-count">5</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Probabilistic-Graphical-Models/">Probabilistic Graphical Models</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIColor/">UIColor</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView/">UIView</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView-圆角/">UIView-圆角</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Vim/">Vim</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/bug/">bug</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/hexo/">hexo</a><span class="tag-list-count">4</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/openCV/">openCV</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/二维码/">二维码</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/指针/">指针</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/操作系统/">操作系统</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/数据库/">数据库</a><span class="tag-list-count">3</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/数据结构/">数据结构</a><span class="tag-list-count">20</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/算法/">算法</a><span class="tag-list-count">9</span></li></ul>
    </div>
  </aside>

  
</div>
      </div>
      <footer id="colophon" role="contentinfo">
    <p>&copy; 2017 SaberDa
    All rights reserved.</p>
    <p>Powered by <a href="http://hexo.io/" target="_blank">Hexo</a></p>
</footer>
    <script>window._bd_share_config={"common":{"bdSnsKey":{},"bdText":"","bdMini":"1","bdMiniList":false,"bdPic":"","bdStyle":"2","bdSize":"16"},"share":{}};with(document)0[(getElementsByTagName('head')[0]||body).appendChild(createElement('script')).src='http://bdimg.share.baidu.com/static/api/js/share.js?v=89860593.js?cdnversion='+~(-new Date()/36e5)];</script>

<script src="/js/jquery-2.0.3.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

<script src="/js/navigation.js"></script>

<div id="bg"></div>

  </div>
</body>
</html>