<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  
  <meta name="description" content="阿尔托利亚是我老婆~" />
  

  
  
  
  
  
  
  <title>详细谈谈RBF-1 | SaberDa的幻想乡</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x5BF9;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x7684;&amp;#x76D1;&amp;#x7763;&amp;#x5B66;&amp;#x4E60;&amp;#x6709;&amp;#x591A;&amp;#x79CD;&amp;#x4E0D;&amp;#x540C;&amp;#x7684;&amp;#x65B9;&amp;#x6CD5;&amp;#x3002;&amp;#x5728;&amp;#x6211;&amp;#x4EE5;&amp;#x524D;&amp;#x7684;&amp;#x6587;">
<meta property="og:type" content="article">
<meta property="og:title" content="详细谈谈RBF-1">
<meta property="og:url" content="https://saberda.github.io/2017/04/01/RBF-径向基函数网络-1/index.html">
<meta property="og:site_name" content="SaberDa的幻想乡">
<meta property="og:description" content="&amp;#x5BF9;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x7684;&amp;#x76D1;&amp;#x7763;&amp;#x5B66;&amp;#x4E60;&amp;#x6709;&amp;#x591A;&amp;#x79CD;&amp;#x4E0D;&amp;#x540C;&amp;#x7684;&amp;#x65B9;&amp;#x6CD5;&amp;#x3002;&amp;#x5728;&amp;#x6211;&amp;#x4EE5;&amp;#x524D;&amp;#x7684;&amp;#x6587;">
<meta property="og:image" content="https://saberda.github.io/2017/04/01/RBF-径向基函数网络-1/1.png">
<meta property="og:image" content="https://saberda.github.io/2017/04/01/RBF-径向基函数网络-1/2.png">
<meta property="og:image" content="https://saberda.github.io/2017/04/01/RBF-径向基函数网络-1/3.png">
<meta property="og:image" content="https://saberda.github.io/2017/04/01/RBF-径向基函数网络-1/4.png">
<meta property="og:updated_time" content="2017-04-01T16:01:53.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="详细谈谈RBF-1">
<meta name="twitter:description" content="&amp;#x5BF9;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x7684;&amp;#x76D1;&amp;#x7763;&amp;#x5B66;&amp;#x4E60;&amp;#x6709;&amp;#x591A;&amp;#x79CD;&amp;#x4E0D;&amp;#x540C;&amp;#x7684;&amp;#x65B9;&amp;#x6CD5;&amp;#x3002;&amp;#x5728;&amp;#x6211;&amp;#x4EE5;&amp;#x524D;&amp;#x7684;&amp;#x6587;">
<meta name="twitter:image" content="https://saberda.github.io/2017/04/01/RBF-径向基函数网络-1/1.png">
  
  
    <link rel="icon" href="/css/images/favicon.ico">
  
  <link rel="stylesheet" href="/css/style.css">
  

  
  <!-- baidu webmaster push -->
  <script src='//push.zhanzhang.baidu.com/push.js'></script>
</head>
<body class="home blog custom-background custom-font-enabled single-author">
  <div id="page" class="hfeed site">
      <header id="masthead" class="site-header" role="banner">
    <hgroup>
      <h1 class="site-title">
        <a href="/" title="SaberDa的幻想乡" rel="home">SaberDa的幻想乡</a>
      </h1>
      
        <h2 class="site-description">
          <a href="/" id="subtitle">　　iOS/ ML　　|　　二次元　　|　　saberda@qq.com　　|　　从花时间省钱到花钱省时间</a>
        </h2>
      
    </hgroup>

    <nav id="site-navigation" class="main-navigation" role="navigation">
            <button class="menu-toggle">菜单</button>
            <a class="assistive-text" href="/#content" title="跳至内容">跳至内容</a><!--TODO-->
            <div class="menu-main-container">
                <ul id="menu-main" class="nav-menu">
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/archives">所有文章</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/">主页</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/编程/">编程</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/iOS/">iOS</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/ML/">ML</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/PGM/">PGM</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/MAC/">MAC</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/御宅文化/">御宅文化</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/LIFE/">LIFE</a></li>
                
                </ul>
            </div>
    </nav>
</header>
      <div id="main" class="wrapper">
        <div id="primary" class="site-content"><div id="content" role="main"><article id="post-RBF-径向基函数网络-1" class="post-RBF-径向基函数网络-1 post type-post status-publish format-standard hentry">
    <!---->

      <header class="entry-header">
        
        
  
    <h1 class="entry-title article-title">
      详细谈谈RBF-1
    </h1>
  

        
        <div class="comments-link">
            
            <a href="javascript:void(0);" data-url="https://saberda.github.io/2017/04/01/RBF-径向基函数网络-1/" data-id="cj9fwss7n002g62b3lyymrchk" class="leave-reply bdsharebuttonbox" data-cmd="more">Share</a>
        </div><!-- .comments-link -->
      </header><!-- .entry-header -->

    <div class="entry-content">
      
        <p>&#x5BF9;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x6709;&#x591A;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5728;&#x6211;<a href="http://www.saberismywife.com/2016/12/10/Machine-Learning-5/" target="_blank" rel="external">&#x4EE5;&#x524D;&#x7684;&#x6587;&#x7AE0;</a>&#x91CC;&#x63D0;&#x5230;&#x8FC7;&#x7684;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x7B97;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x770B;&#x505A;&#x9012;&#x5F52;&#x6280;&#x672F;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x53C8;&#x53EB;&#x505A;&#x968F;&#x673A;&#x903C;&#x8FD1;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x5C06;&#x91C7;&#x7528;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x9014;&#x5F84;&#x3002;&#x5177;&#x4F53;&#x6765;&#x8BF4;&#xFF0C;&#x901A;&#x8FC7;&#x5305;&#x542B;&#x5982;&#x4E0B;&#x4E24;&#x9636;&#x6BB5;&#x7684;&#x6DF7;&#x5408;&#x65B9;&#x5F0F;&#x6765;&#x89E3;&#x51B3;&#x975E;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x6A21;&#x5F0F;&#x7684;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#xFF1A;</p>
<ul>
<li>&#x7B2C;&#x4E00;&#x9636;&#x6BB5;&#x5C06;&#x4E00;&#x4E2A;&#x7ED9;&#x5B9A;&#x7684;&#x975E;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x6A21;&#x5F0F;&#x7684;&#x96C6;&#x5408;&#x8F6C;&#x6362;&#x4E3A;&#x65B0;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x5728;&#x4E00;&#x5B9A;&#x6761;&#x4EF6;&#x4E0B;&#xFF0C;&#x8F6C;&#x6362;&#x540E;&#x7684;&#x6A21;&#x5F0F;&#x53D8;&#x4E3A;&#x7EBF;&#x6027;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x5F88;&#x9AD8;&#xFF1B;&#x5173;&#x4E8E;&#x8FD9;&#x4E00;&#x8F6C;&#x6362;&#x7684;&#x6570;&#x5B66;&#x8BC1;&#x660E;&#x6211;&#x5C31;&#x4E0D;&#x5177;&#x4F53;&#x4ECB;&#x7ECD;&#x4E86;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x53BB;&#x67E5;&#x9605; Cover &#x5927;&#x5927;&#x5728; 1965 &#x5E74;&#x7684;&#x65E9;&#x671F;&#x8BBA;&#x6587;</li>
<li>&#x7B2C;&#x4E8C;&#x9636;&#x6BB5;&#x662F;&#x901A;&#x8FC7;&#x6700;&#x5C0F;&#x4E8C;&#x4E58;&#x4F30;&#x8BA1;&#x6765;&#x89E3;&#x51B3;&#x7ED9;&#x5B9A;&#x7684;&#x5206;&#x7C7B;&#x95EE;&#x9898;</li>
</ul>
<a id="more"></a>
<p>&#x6211;&#x4EEC;&#x9996;&#x5148;&#x901A;&#x8FC7;&#x63D2;&#x503C;&#x95EE;&#x9898;&#x7684;&#x8BA8;&#x8BBA;&#x6765;&#x63CF;&#x8BC9;&#x5173;&#x4E8E;&#x8FD9;&#x4E00;&#x6DF7;&#x5408;&#x65B9;&#x5F0F;&#x5BF9;&#x6A21;&#x5F0F;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x79CD;&#x6267;&#x884C;&#x65B9;&#x5F0F;&#xFF1A;&#x4F7F;&#x7528;&#x5F84;&#x5411;&#x57FA;&#x51FD;&#x6570;&#x7F51;&#x7EDC;(radial-basis function network)&#xFF0C;&#x7B80;&#x79F0;RBF&#xFF0C;&#x8BE5;&#x7F51;&#x7EDC;&#x7531;&#x4E09;&#x5C42;&#x7EC4;&#x6210;&#xFF1A;</p>
<ul>
<li>&#x8F93;&#x5165;&#x5C42;&#x7531;&#x4E00;&#x4E9B;&#x6E90;&#x8282;&#x70B9;&#xFF08;&#x611F;&#x77E5;&#x5355;&#x5143;&#xFF09;&#x7EC4;&#x6210;&#x3002;&#x5B83;&#x4EEC;&#x5C06;&#x7F51;&#x7EDC;&#x4E0E;&#x5916;&#x754C;&#x73AF;&#x5883;&#x94FE;&#x63A5;&#x8D77;&#x6765;</li>
<li>&#x7B2C;&#x4E8C;&#x5C42;&#x7531;&#x9690;&#x85CF;&#x5355;&#x5143;&#x7EC4;&#x6210;&#xFF0C;&#x5B83;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x4ECE;&#x8F93;&#x5165;&#x7A7A;&#x95F4;&#x5230;&#x9690;&#x85CF;&#xFF08;&#x7279;&#x5F81;&#xFF09;&#x7A7A;&#x95F4;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x975E;&#x7EBF;&#x6027;&#x53D8;&#x6362;&#x3002;&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x7F51;&#x7EDC;&#x4EC5;&#x6709;&#x7684;&#x9690;&#x85CF;&#x5C42;&#x5177;&#x6709;&#x8F83;&#x9AD8;&#x7684;&#x7EF4;&#x6570;&#xFF0C;&#x8FD9;&#x4E00;&#x5C42;&#x662F;&#x5229;&#x7528;&#x6DF7;&#x5408;&#x5B66;&#x4E60;&#x8FC7;&#x7A0B;&#x7684;&#x7B2C;&#x4E00;&#x9636;&#x6BB5;&#x5728;&#x975E;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7684;&#x65B9;&#x5F0F;&#x4E0B;&#x8BAD;&#x7EC3;</li>
<li>&#x8F93;&#x51FA;&#x5C42;&#x662F;&#x7EBF;&#x6027;&#x7684;&#xFF0C;&#x5B83;&#x662F;&#x4E3A;&#x63D0;&#x4F9B;&#x7F51;&#x7EDC;&#x7684;&#x54CD;&#x5E94;&#x800C;&#x4E13;&#x95E8;&#x8BBE;&#x8BA1;&#x7684;&#xFF0C;&#x8BE5;&#x54CD;&#x5E94;&#x63D0;&#x4F9B;&#x7ED9;&#x5E94;&#x7528;&#x4E8E;&#x8F93;&#x5165;&#x5C42;&#x7684;&#x6FC0;&#x6D3B;&#x6A21;&#x5F0F;&#x3002;&#x8FD9;&#x4E00;&#x5C42;&#x662F;&#x5229;&#x7528;&#x6DF7;&#x5408;&#x8FC7;&#x7A0B;&#x7684;&#x7B2C;&#x4E8C;&#x9636;&#x6BB5;&#x5728;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7684;&#x65B9;&#x5F0F;&#x4E0B;&#x8BAD;&#x7EC3;&#x7684;</li>
</ul>
<p>&#x4ECE;&#x8F93;&#x5165;&#x7A7A;&#x95F4;&#x5230;&#x9690;&#x85CF;&#x7A7A;&#x95F4;&#x7684;&#x975E;&#x7EBF;&#x6027;&#x53D8;&#x6362;&#x4EE5;&#x53CA;&#x9690;&#x85CF;&#x7A7A;&#x95F4;&#x7684;&#x9AD8;&#x7EF4;&#x6570;&#x6EE1;&#x8DB3;&#x4E86;Cover&#x5B9A;&#x7406;&#x7684;&#x4EC5;&#x6709;&#x4E24;&#x4E2A;&#x6761;&#x4EF6;</p>
<p>RBF&#x7F51;&#x7EDC;&#x7684;&#x591A;&#x7EF4;&#x7406;&#x8BBA;&#x5EFA;&#x7ACB;&#x5728;&#x9AD8;&#x65AF;&#x51FD;&#x6570;&#x4E4B;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E00;&#x7C7B;&#x4E2D;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x6210;&#x5458;&#x662F;&#x5F84;&#x5411;&#x57FA;&#x51FD;&#x6570;&#x3002;&#x9AD8;&#x65AF;&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x770B;&#x505A;&#x662F;&#x4E00;&#x4E2A;&#x6838;&#x2013;&#x56E0;&#x6B64;&#x57FA;&#x4E8E;&#x9AD8;&#x65AF;&#x51FD;&#x6570;&#x7684;&#x4E24;&#x9636;&#x6BB5;&#x8FC7;&#x7A0B;&#x7684;&#x8BBE;&#x8BA1;&#x53EF;&#x770B;&#x6210;&#x662F;&#x6838;&#x65B9;&#x6CD5;&#x3002;</p>
<h2 id="&#x6A21;&#x5F0F;&#x53EF;&#x5206;&#x6027;&#x7684;-Cover-&#x5B9A;&#x7406;"><a href="#&#x6A21;&#x5F0F;&#x53EF;&#x5206;&#x6027;&#x7684;-Cover-&#x5B9A;&#x7406;" class="headerlink" title="&#x6A21;&#x5F0F;&#x53EF;&#x5206;&#x6027;&#x7684; Cover &#x5B9A;&#x7406;"></a>&#x6A21;&#x5F0F;&#x53EF;&#x5206;&#x6027;&#x7684; Cover &#x5B9A;&#x7406;</h2><p>&#x5F53;&#x7528;&#x5F84;&#x5411;&#x57FA;&#x51FD;&#x6570;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6765;&#x89E3;&#x51B3;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x5206;&#x7C7B;&#x4EFB;&#x52A1;&#x65F6;&#xFF0C;&#x95EE;&#x9898;&#x57FA;&#x672C;&#x53EF;&#x901A;&#x8FC7;&#x4EE5;&#x4E0B;&#x65B9;&#x5F0F;&#x89E3;&#x51B3;&#xFF1A;&#x9996;&#x5148;&#x7528;&#x975E;&#x7EBF;&#x6027;&#x65B9;&#x6CD5;&#x5C06;&#x5176;&#x8F6C;&#x6362;&#x5230;&#x9AD8;&#x7EF4;&#x7A7A;&#x95F4;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x8F93;&#x51FA;&#x5C42;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF0C;&#x6A21;&#x5F0F;&#x53EF;&#x5206;&#x6027;&#x7684; Cover &#x5B9A;&#x7406;&#xFF0C;&#x8BF4;&#x660E;&#x4E86;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x5408;&#x6CD5;&#x6027;&#xFF0C;&#x8BE5;&#x5B9A;&#x7406;&#x53EF;&#x4EE5;&#x5B9A;&#x6027;&#x7684;&#x8868;&#x8FF0;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>&#x5047;&#x8BBE;&#x7A7A;&#x95F4;&#x4E0D;&#x662F;&#x7A20;&#x5BC6;&#x53EF;&#x5206;&#x7684;&#xFF0C;&#x5C06;&#x590D;&#x6742;&#x7684;&#x6A21;&#x5F0F;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x975E;&#x7EBF;&#x6027;&#x7684;&#x6295;&#x5C04;&#x5230;&#x9AD8;&#x7EF4;&#x7A7A;&#x95F4;&#x5C06;&#x6BD4;&#x6295;&#x5C04;&#x5230;&#x4F4E;&#x7EF4;&#x7A7A;&#x95F4;&#x66F4;&#x53EF;&#x80FD;&#x662F;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x7684;
</code></pre><p>&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x4E00;&#x65E6;&#x6A21;&#x5F0F;&#x5177;&#x6709;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x6027;&#xFF0C;&#x5219;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x76F8;&#x5BF9;&#x800C;&#x8A00;&#x5C31;&#x66F4;&#x5BB9;&#x6613;&#x89E3;&#x51B3;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x7814;&#x7A76;&#x6A21;&#x5F0F;&#x7684;&#x53EF;&#x5206;&#x6027;&#x53EF;&#x4EE5;&#x6DF1;&#x5165;&#x4E86;&#x89E3;RBF&#x7F51;&#x7EDC;&#x4F5C;&#x4E3A;&#x6A21;&#x5F0F;&#x5206;&#x7C7B;&#x5668;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#x3002;</p>
<p>&#x8003;&#x8651;&#x4E00;&#x65CF;&#x66F2;&#x9762;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x66F2;&#x9762;&#x90FD;&#x81EA;&#x7136;&#x7684;&#x5C06;&#x8F93;&#x5165;&#x7A7A;&#x95F4;&#x5206;&#x6210;&#x4E24;&#x4E2A;&#x533A;&#x57DF;&#x3002;&#x7528; &#x3C7; &#x4EE3;&#x8868; N &#x4E2A;&#x6A21;&#x5F0F;&#xFF08;&#x5411;&#x91CF;&#xFF09; x<sub>1</sub>&#xFF0C;x<sub>2</sub>&#xFF0C;&#x2026;&#xFF0C;x<sub>N</sub> &#x7684;&#x96C6;&#x5408;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E00;&#x4E2A;&#x6A21;&#x5F0F;&#x90FD;&#x5206;&#x5C5E;&#x4E8E; &#x3C7;<sub>1</sub> &#x548C; &#x3C7;<sub>2</sub> &#x4E2D;&#x7684;&#x4E00;&#x7C7B;&#x3002;&#x5982;&#x679C;&#x5728;&#x8FD9;&#x4E00;&#x65CF;&#x66F2;&#x9762;&#x4E2D;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x66F2;&#x9762;&#x80FD;&#x5C06;&#x5206;&#x522B;&#x5C5E;&#x4E8E; &#x3C7;<sub>1</sub> &#x548C; &#x3C7;<sub>2</sub> &#x7684;&#x8FD9;&#x4E9B;&#x70B9;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x90E8;&#x5206;&#xFF0C;&#x6211;&#x4EEC;&#x5219;&#x79F0;&#x8FD9;&#x4E9B;&#x70B9;&#x7684;&#x4E8C;&#x5206;&#xFF08;&#x4E8C;&#x5143;&#x5212;&#x5206;&#xFF09;&#x5173;&#x4E8E;&#x8FD9;&#x65CF;&#x66F2;&#x9762;&#x662F;&#x53EF;&#x5206;&#x7684;&#x3002;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x6A21;&#x5F0F; x &#x2208; &#x3C7; &#xFF0C;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x7531;&#x4E00;&#x7EC4;&#x5B9E;&#x503C;&#x51FD;&#x6570; { &#x3C6;<sub>1</sub>(x) | i = 1, 2, &#x2026;, m<sub>1</sub> } &#x7EC4;&#x6210;&#x7684;&#x5411;&#x91CF;&#xFF0C;&#x8868;&#x793A;&#x5982;&#x4E0B;&#xFF1A;</p>
<center>&#x3C6;(x) = [ &#x3C6;<sub>1</sub>(x), &#x3C6;<sub>2</sub>(x), &#x2026;, &#x3C6;<sub>m<sub>1</sub></sub>(x)]<sup>T</sup></center> 

<p>&#x5047;&#x8BBE;&#x6A21;&#x5F0F; x &#x662F; m<sub>0</sub> &#x7EF4;&#x8F93;&#x5165;&#x7A7A;&#x95F4;&#x7684;&#x4E00;&#x4E2A;&#x5411;&#x91CF;&#xFF0C;&#x5219;&#x5411;&#x91CF; &#x3C6;(x) &#x5C06; m<sub>0</sub> &#x7EF4;&#x8F93;&#x5165;&#x7A7A;&#x95F4;&#x7684;&#x70B9;&#x6620;&#x5C04;&#x5230;&#x65B0;&#x7684; m<sub>1</sub> &#x7EF4;&#x7A7A;&#x95F4;&#x7684;&#x76F8;&#x5E94;&#x7684;&#x70B9;&#x4E0A;&#x3002;&#x6211;&#x4EEC;&#x5C06; &#x3C6;<sub>i</sub>(x) &#x79F0;&#x4E3A;&#x9690;&#x85CF;&#x51FD;&#x6570;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E0E;&#x524D;&#x9762;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x9690;&#x85CF;&#x5355;&#x5143;&#x8D77;&#x7740;&#x540C;&#x6837;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x76F8;&#x5E94;&#x7684;&#xFF0C;&#x7531;&#x9690;&#x85CF;&#x51FD;&#x6570;&#x96C6;&#x5408; { &#x3C6;<sub>i</sub>(x) }<sub>i=1</sub><sup>m<sub>1</sub></sup> &#x6240;&#x751F;&#x6210;&#x7684;&#x7A7A;&#x95F4;&#x79F0;&#x4E3A;&#x9690;&#x85CF;&#x7A7A;&#x95F4;&#x6216;&#x8005;&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x79F0;&#x4E00;&#x4E2A;&#x5173;&#x4E8E; &#x3C7; &#x7684;&#x4E8C;&#x5206; { &#x3C7;<sub>1</sub>, &#x3C7;<sub>2</sub>} &#x662F; &#x3C6; &#x53EF;&#x5206;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x5B58;&#x5728;&#x4E00;&#x4E2A;  m<sub>1</sub> &#x7EF4;&#x7684;&#x5411;&#x91CF; w &#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x5982;&#x4E0B;&#x516C;&#x5F0F;&#xFF1A;</p>
<center> w<sup>T</sup>&#x3C6;(x) &gt; 0, x &#x2208; &#x3C7;<sub>1</sub> </center>

<center> w<sup>T</sup>&#x3C6;(x) &lt; 0, x &#x2208; &#x3C7;<sub>2</sub> </center>



<p>&#x7531;&#x65B9;&#x7A0B; w<sup>T</sup>&#x3C6;(x) = 0 &#x5B9A;&#x4E49;&#x7684;&#x8D85;&#x5E73;&#x9762;&#x63CF;&#x8FF0; &#x3C6; &#x7A7A;&#x95F4;&#xFF08;&#x5373;&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#xFF09;&#x4E2D;&#x7684;&#x5206;&#x79BB;&#x66F2;&#x9762;&#x3002;&#x8FD9;&#x4E2A;&#x8D85;&#x5E73;&#x9762;&#x7684;&#x9006;&#x50CF;&#xFF0C;&#x5373; x: w<sup>T</sup>&#x3C6;(x) = 0 &#x5B9A;&#x4E49;&#x8F93;&#x5165;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x5206;&#x79BB;&#x66F2;&#x9762;&#xFF08;&#x5373;&#x51B3;&#x7B56;&#x8FB9;&#x754C;&#xFF09;&#x3002;</p>
<p>&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x5229;&#x7528; r &#x6B21;&#x6A21;&#x5F0F;&#x5411;&#x91CF;&#x5750;&#x6807;&#x4E58;&#x79EF;&#x7684;&#x7EBF;&#x6027;&#x7EC4;&#x5408;&#x5B9E;&#x73B0;&#x7684;&#x4E00;&#x4E2A;&#x81EA;&#x7136;&#x7C7B;&#x6620;&#x5C04;&#x3002;&#x4E0E;&#x6B64;&#x79CD;&#x6620;&#x5C04;&#x76F8;&#x5BF9;&#x5E94;&#x7684;&#x5206;&#x79BB;&#x66F2;&#x9762;&#x88AB;&#x79F0;&#x4E3A; r &#x9636;&#x6709;&#x7406;&#x7C07;&#x3002;&#x4E00;&#x4E2A; m<sub>0</sub> &#x7EF4;&#x7A7A;&#x95F4;&#x7684; r &#x9636;&#x6709;&#x7406;&#x7C07;&#x53EF;&#x63CF;&#x8FF0;&#x4E3A;&#x8F93;&#x5165;&#x5411;&#x91CF; x &#x7684;&#x5750;&#x6807;&#x7684;&#x4E00;&#x4E2A; r &#x6B21;&#x9F50;&#x6B21;&#x65B9;&#x7A0B;&#xFF0C;&#x8868;&#x793A;&#x4E3A;&#xFF1A;</p>
<center>&#x2211; a<sub>i<sub>1</sub>,i<sub>2</sub>,&#x2026;,i<sub>r</sub></sub>x<sub>i<sub>1</sub></sub>x<sub>i<sub>2</sub></sub>&#x2026;x<sub>i<sub>r</sub></sub> = 0</center>

<center> 0 &lt;= i<sub>1</sub>,i<sub>2</sub>,&#x2026;,i<sub>r</sub> &lt;= m<sub>0</sub> </center>


<p>&#x5176;&#x4E2D; x<sub>i</sub> &#x662F;&#x8F93;&#x5165;&#x5411;&#x91CF;&#x7684; x &#x7684;&#x7B2C; i &#x4E2A;&#x5143;&#x7D20;&#x3002;&#x4E3A;&#x4E86;&#x7528;&#x9F50;&#x6B21;&#x5F62;&#x5F0F;&#x6765;&#x8868;&#x8FBE;&#x65B9;&#x7A0B;&#xFF0C;&#x5C06; x<sub>0</sub> &#x7684;&#x503C;&#x7F6E;&#x4E3A;&#x5355;&#x4F4D;&#x503C;1&#x3002;x &#x4E2D;&#x9879; x<sub>i</sub> &#x7684; r &#x9636;&#x4E58;&#x79EF;&#xFF0C;&#x5373; x<sub>i<sub>1</sub></sub>x<sub>i<sub>2</sub></sub>&#x2026;x<sub>i<sub>r</sub></sub> &#xFF0C;&#x88AB;&#x79F0;&#x4E3A;&#x5355;&#x9879;&#x5F0F;&#x3002;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A; m<sub>0</sub> &#x7EF4;&#x7684;&#x8F93;&#x5165;&#x7A7A;&#x95F4;&#x5728;&#x4E0A;&#x5F0F;&#x4E2D;&#x4E00;&#x5171;&#x6709; ((m<sub>0</sub> - r)! / m<sub>0</sub>!r!) &#x4E2A;&#x5355;&#x9879;&#x5F0F;&#x3002;&#x4E0A;&#x5F0F;&#x6240;&#x79D2;&#x901F;&#x7684;&#x5206;&#x79BB;&#x66F2;&#x9762;&#x7684;&#x7C7B;&#x578B;&#x7684;&#x4F8B;&#x5B50;&#x6709;&#x8D85;&#x5E73;&#x9762;&#xFF08;&#x4E00;&#x9636;&#x6709;&#x7406;&#x7C07;&#xFF09;&#x3001;&#x4E8C;&#x6B21;&#x66F2;&#x9762;&#xFF08;&#x4E8C;&#x9636;&#x6709;&#x7406;&#x7C07;&#xFF09;&#x548C;&#x8D85;&#x7403;&#x9762;&#xFF08;&#x5E26;&#x6709;&#x67D0;&#x4E9B;&#x7EBF;&#x6027;&#x9650;&#x5236;&#x7CFB;&#x6570;&#x7684;&#x4E8C;&#x6B21;&#x66F2;&#x9762;&#xFF09;&#x7B49;&#x3002;</p>
<p>&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x6027;&#x6697;&#x793A;&#x7740;&#x7403;&#x9762;&#x53EF;&#x5206;&#x6027;&#xFF0C;&#x800C;&#x7403;&#x9762;&#x53EF;&#x5206;&#x6027;&#x53C8;&#x6697;&#x793A;&#x7740;&#x4E8C;&#x6B21;&#x53EF;&#x5206;&#x6027;&#xFF1B;&#x53CD;&#x4E4B;&#x4E0D;&#x4E00;&#x5B9A;&#x6210;&#x7ACB;&#x3002;</p>
<p>&#x5728;&#x6982;&#x7387;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x6A21;&#x5F0F;&#x96C6;&#x5408;&#x7684;&#x53EF;&#x5206;&#x6027;&#x662F;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x4E8B;&#x4EF6;&#xFF0C;&#x8BE5;&#x968F;&#x673A;&#x4E8B;&#x4EF6;&#x4F9D;&#x8D56;&#x4E8E;&#x9009;&#x62E9;&#x7684;&#x4E8C;&#x5206;&#x4EE5;&#x53CA;&#x8F93;&#x5165;&#x7A7A;&#x95F4;&#x7684;&#x6A21;&#x5F0F;&#x5206;&#x5E03;&#x3002;&#x5047;&#x8BBE;&#x6FC0;&#x6D3B;&#x6A21;&#x5F0F; x<sub>1</sub>, x<sub>2</sub>, &#x2026;, x<sub>N</sub> &#x662F;&#x6839;&#x636E;&#x8F93;&#x5165;&#x7A7A;&#x95F4;&#x7684;&#x6982;&#x7387;&#x7279;&#x6027;&#x4E8C;&#x72EC;&#x7ACB;&#x9009;&#x53D6;&#x7684;&#x3002;&#x540C;&#x65F6;&#x5047;&#x8BBE;&#x6240;&#x6709;&#x7684;&#x5173;&#x4E8E; &#x3C7; = { x<sub>i</sub> }<sub>i=1</sub><sup>N</sup> &#x7684;&#x4E8C;&#x5206;&#x90FD;&#x662F;&#x7B49;&#x6982;&#x7387;&#x7684;&#x3002;&#x4EE4; P(N, m<sub>1</sub>) &#x8868;&#x793A;&#x67D0;&#x4E00;&#x968F;&#x673A;&#x9009;&#x53D6;&#x7684;&#x4E8C;&#x5206;&#x662F; &#x3C6; &#x53EF;&#x5206;&#x7684;&#x6982;&#x7387;&#xFF0C;&#x8FD9;&#x91CC;&#x88AB;&#x9009;&#x4E2D;&#x7684;&#x5206;&#x79BB;&#x66F2;&#x9762;&#x7684;&#x7C7B;&#x5177;&#x6709; m<sub>1</sub> &#x7EF4;&#x7684;&#x81EA;&#x7531;&#x5EA6;&#x3002;&#x5219;&#x53EF;&#x5C06; P(N, m<sub>1</sub>) &#x8868;&#x8FF0;&#x4E3A;&#xFF1A;</p>
<center>P(N, m<sub>1</sub>) = (1/2)<sup>N-1</sup>&#x2211;(N-1), N &gt; m<sub>1</sub>-1</center>

<center>P(N, m<sub>1</sub>) = (1/2)<sup>N-1</sup>&#x2211;(m), N &lt;= m<sub>1</sub>-1</center>

<p>&#x4E0A;&#x5F0F;&#x9690;&#x542B;&#x4E86; Cover &#x7684;&#x53EF;&#x5206;&#x6027;&#x5B9A;&#x7406;&#x5BF9;&#x4E8E;&#x968F;&#x673A;&#x6A21;&#x5F0F;&#x7684;&#x672C;&#x8D28;&#x3002;&#x4ED6;&#x8BF4;&#x660E;&#x7D2F;&#x8BA1;&#x4E8C;&#x9879;&#x6982;&#x7387;&#x5206;&#x5E03;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x629B;&#xFF08;N-1&#xFF09;&#x6B21;&#x786C;&#x5E01;&#x6709;&#xFF08;m<sub>1</sub>-1&#xFF09;&#x6B21;&#x6216;&#x8005;&#x66F4;&#x5C11;&#x8BCD;&#x5934;&#x50CF;&#x5411;&#x4E0A;&#x7684;&#x6982;&#x7387;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x5728;&#x4E0A;&#x5F0F;&#x7684;&#x63A8;&#x5BFC;&#x4E2D;&#x9047;&#x89C1;&#x7684;&#x9690;&#x85CF;&#x5355;&#x5143;&#x9662;&#x662F;&#x4E00;&#x4E2A;&#x591A;&#x9879;&#x5F0F;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x56E0;&#x800C;&#x4E0E;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x5728;&#x5F84;&#x5411;&#x57FA;&#x51FD;&#x6570;&#x7F51;&#x7EDC;&#x4E2D;&#x7528;&#x5230;&#x7684;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x662F;&#x8BE5;&#x5F0F;&#x7684;&#x6838;&#x5FC3;&#x5185;&#x5BB9;&#x5374;&#x5177;&#x6709;&#x666E;&#x904D;&#x7684;&#x9002;&#x7528;&#x6027;&#x3002;&#x5177;&#x4F53;&#x6765;&#x8BF4;&#xFF0C;&#x9690;&#x85CF;&#x7A7A;&#x95F4;&#x7684;&#x7EF4;&#x6570; m<sub>1</sub> &#x8D8A;&#x9AD8;&#xFF0C;&#x5219;&#x6982;&#x7387; P(N, m<sub>1</sub>) &#x5C31;&#x8D8A;&#x8D8B;&#x5411;&#x4E8E;1.&#x603B;&#x4E4B;&#xFF0C;&#x5173;&#x4E8E;&#x8BE5;&#x6A21;&#x5F0F;&#x53EF;&#x5206;&#x6027;&#x7684; Cover &#x5B9A;&#x7406;&#x53EA;&#x8981;&#x5305;&#x542B;&#x4E0B;&#x9762;&#x4E24;&#x4E2A;&#x57FA;&#x672C;&#x90E8;&#x5206;&#xFF1A;</p>
<ul>
<li>&#x7531; &#x3C6;<sub>i</sub>(x) &#x5B9A;&#x4E49;&#x7684;&#x9690;&#x85CF;&#x51FD;&#x6570;&#x7684;&#x975E;&#x7EBF;&#x6027;&#x6784;&#x6210;&#xFF0C;&#x8FD9;&#x91CC; x &#x662F;&#x8F93;&#x5165;&#x5411;&#x91CF;&#xFF0C;&#x4E14; i = 1, 2, &#x2026;, m<sub>1</sub></li>
<li>&#x9AD8;&#x7EF4;&#x6570;&#x7684;&#x9690;&#x85CF;&#xFF08;&#x7279;&#x5F81;&#xFF09;&#x7A7A;&#x95F4;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x9AD8;&#x7EF4;&#x6570;&#x662F;&#x76F8;&#x5BF9;&#x4E8E;&#x8F93;&#x5165;&#x7A7A;&#x95F4;&#x800C;&#x8A00;&#x7684;&#x3002;&#x4F4D;&#x6570;&#x7531;&#x8D4B;&#x7ED9; m<sub>1</sub> &#x7684;&#x503C;&#xFF08;&#x5373;&#x9690;&#x85CF;&#x5355;&#x5143;&#x7684;&#x4E2A;&#x6570;&#xFF09;&#x51B3;&#x5B9A;</li>
</ul>
<p>&#x7EFC;&#x4E0A;&#x6240;&#x8FF0;&#xFF0C;&#x901A;&#x5E38;&#x8BB2;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x6A21;&#x5F0F;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x975E;&#x7EBF;&#x6027;&#x7684;&#x6295;&#x5C04;&#x5230;&#x9AD8;&#x7EF4;&#x6570;&#x7A7A;&#x95F4;&#x5C06;&#x4F1A;&#x6BD4;&#x6295;&#x5C04;&#x5230;&#x4F4E;&#x7EF4;&#x7A7A;&#x95F4;&#x66F4;&#x53EF;&#x80FD;&#x662F;&#x7EBF;&#x6027;&#x4E0D;&#x53EF;&#x5206;&#x7684;&#x3002;&#x4F46;&#x9700;&#x8981;&#x5F3A;&#x8C03;&#x7684;&#x662F;&#xFF0C;&#x6709;&#x65F6;&#x4F7F;&#x7528;&#x975E;&#x7EBF;&#x6027;&#x6620;&#x5C04;&#x5C31;&#x8DB3;&#x591F;&#x5BFC;&#x81F4;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x5347;&#x9AD8;&#x9690;&#x85CF;&#x5355;&#x5143;&#x7A7A;&#x95F4;&#x7EF4;&#x6570;&#x3002;</p>
<h2 id="&#x66F2;&#x9762;&#x7684;&#x5206;&#x79BB;&#x80FD;&#x529B;"><a href="#&#x66F2;&#x9762;&#x7684;&#x5206;&#x79BB;&#x80FD;&#x529B;" class="headerlink" title="&#x66F2;&#x9762;&#x7684;&#x5206;&#x79BB;&#x80FD;&#x529B;"></a>&#x66F2;&#x9762;&#x7684;&#x5206;&#x79BB;&#x80FD;&#x529B;</h2><p>&#x4E0A;&#x5F0F;&#x5BF9;&#x4E8E;&#x5728;&#x591A;&#x7EF4;&#x7A7A;&#x95F4;&#x4E2D;&#x968F;&#x673A;&#x6307;&#x5B9A;&#x8F93;&#x5165;&#x6A21;&#x5F0F;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x7684;&#x671F;&#x671B;&#x6700;&#x5927;&#x6570;&#x76EE;&#x6709;&#x91CD;&#x8981;&#x610F;&#x4E49;&#x3002;&#x4E3A;&#x4E86;&#x7814;&#x7A76;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x524D;&#x6240;&#x8BC9;&#x5C06; x<sub>1</sub>&#xFF0C;x<sub>2</sub>&#xFF0C;&#x2026;&#xFF0C;x<sub>N</sub> &#x89C6;&#x4E3A;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x6A21;&#x5F0F;&#xFF08;&#x5411;&#x91CF;&#xFF09;&#x5E8F;&#x5217;&#x3002;&#x4EE4; N &#x4E3A;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x53D8;&#x91CF;&#xFF0C;&#x5B9A;&#x4E49;&#x4E3A;&#x8BE5;&#x5E8F;&#x5217;&#x4E3A; &#x3C6; &#x53EF;&#x5206;&#x65F6;&#x7684;&#x6700;&#x5927;&#x6574;&#x6570;&#xFF0C;&#x8FD9;&#x91CC;&#x7684; &#x3C6; &#x5177;&#x6709; m<sub>1</sub> &#x7684;&#x81EA;&#x7531;&#x5EA6;&#x3002;&#x4E8E;&#x662F;&#x7531;&#x4E0A;&#x5F0F;&#x53EF;&#x63A8;&#x5BFC;&#x51FA;&#x5F53; N = n &#x65F6;&#x7684;&#x6982;&#x7387;&#xFF1A;</p>
<p><img src="/2017/04/01/RBF-&#x5F84;&#x5411;&#x57FA;&#x51FD;&#x6570;&#x7F51;&#x7EDC;-1/1.png" alt=""></p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x91CA;&#x4E0A;&#x8BC9;&#x7ED3;&#x679C;&#xFF0C;&#x6211;&#x4EEC;&#x56DE;&#x60F3;&#x4E00;&#x4E0B;&#x8D1F;&#x4E8C;&#x9879;&#x5206;&#x5E03;&#x7684;&#x5B9A;&#x4E49;&#x3002;&#x8BE5;&#x5206;&#x5E03;&#x76F8;&#x5F53;&#x4E8E;&#x5728;&#x4E00;&#x7EC4;&#x91CD;&#x590D;&#x7684;&#x4F2F;&#x52AA;&#x5229;&#x5B9E;&#x9A8C;&#x4E2D;&#x6709; r &#x6B21;&#x6210;&#x529F;&#xFF0C;k &#x6B21;&#x5931;&#x8D25;&#x7684;&#x6982;&#x7387;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x6982;&#x7387;&#x5206;&#x5E03;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E00;&#x6B21;&#x5B9E;&#x9A8C;&#x53EA;&#x6709;&#x4E24;&#x4E2A;&#x4E24;&#x79CD;&#x7ED3;&#x679C;&#xFF0C;&#x4E0D;&#x662F;&#x6210;&#x529F;&#x5C31;&#x662F;&#x5931;&#x8D25;&#xFF0C;&#x5E76;&#x4E14;&#x6210;&#x529F;&#x548C;&#x5931;&#x8D25;&#x7684;&#x51E0;&#x7387;&#x5728;&#x6574;&#x79DF;&#x5B9E;&#x9A8C;&#x4E2D;&#x90FD;&#x662F;&#x76F8;&#x540C;&#x7684;&#x3002;&#x4EE4; p &#x4EE3;&#x8868;&#x6210;&#x529F;&#x7684;&#x6982;&#x7387;&#xFF0C;q &#x4EE3;&#x8868;&#x5931;&#x8D25;&#x7684;&#x6982;&#x7387;&#xFF0C;p + q = 1&#x3002;&#x8D1F;&#x4E8C;&#x9879;&#x5206;&#x5E03;&#x5B9A;&#x4E49;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="/2017/04/01/RBF-&#x5F84;&#x5411;&#x57FA;&#x51FD;&#x6570;&#x7F51;&#x7EDC;-1/2.png" alt=""></p>
<p>&#x5728; p = q = 1/2&#xFF08;&#x5373;&#x6210;&#x529F;&#x4E0E;&#x5931;&#x8D25;&#x5177;&#x6709;&#x76F8;&#x7B49;&#x7684;&#x6982;&#x7387;&#x65F6;&#xFF09;&#x4E14; k + r = n &#x7684;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8D1F;&#x4E8C;&#x9879;&#x5206;&#x5E03;&#x5C06;&#x53D8;&#x4E3A;&#xFF1A;</p>
<p><img src="/2017/04/01/RBF-&#x5F84;&#x5411;&#x57FA;&#x51FD;&#x6570;&#x7F51;&#x7EDC;-1/3.png" alt=""></p>
<p>&#x6839;&#x636E;&#x4E0A;&#x8BC9;&#x5B9A;&#x4E49;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x4E0A;&#x5F0F;&#x6240;&#x8868;&#x793A;&#x7684;&#x7ED3;&#x679C;&#x6070;&#x597D;&#x5C31;&#x662F;&#x8D1F;&#x4E8C;&#x9879;&#x5206;&#x5E03;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x53F3;&#x79FB;&#x4E86; m<sub>1</sub> &#x4E2A;&#x5355;&#x4F4D;&#x4E14;&#x5177;&#x6709;&#x53C2;&#x6570; m<sub>1</sub> &#x548C; 1/2&#x3002;&#x8FD9;&#x6837;&#xFF0C;N &#x76F8;&#x5F53;&#x4E8E;&#x5728;&#x4E00;&#x7EC4;&#x629B;&#x786C;&#x5E01;&#x7684;&#x5B9E;&#x9A8C;&#x4E2D;&#x51FA;&#x73B0;&#x4E86;&#x7B2C; m<sub>1</sub> &#x6B21;&#x5931;&#x8D25;&#x7684;&#x201C;&#x7B49;&#x5F85;&#x65F6;&#x95F4;&#x201D;&#x3002;&#x968F;&#x673A;&#x53D8;&#x91CF; N &#x7684;&#x671F;&#x671B;&#x673A;&#x5668;&#x4E2D;&#x4F4D;&#x6570;&#x5206;&#x522B;&#x4E3A;&#xFF1A;</p>
<center>&#x3B5;[N] = 2m<sub>1</sub></center>

<center>median[N] = 2m<sub>1</sub></center>

<p>&#x56E0;&#x6B64;&#xFF0C;&#x53EF;&#x4EE5;&#x5F97;&#x5230; Cover &#x5B9A;&#x7406;&#x7684;&#x4E00;&#x4E2A;&#x63A8;&#x8BBA;&#xFF0C;&#x7528;&#x8457;&#x540D;&#x7684;&#x6E10;&#x8FDB;&#x7ED3;&#x679C;&#x7684;&#x5F62;&#x5F0F;&#x53EF;&#x8868;&#x8FF0;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>&#x4E00;&#x7EC4;&#x968F;&#x673A;&#x6307;&#x5B9A;&#x7684;&#x8F93;&#x5165;&#x6A21;&#x5F0F;&#xFF08;&#x5411;&#x91CF;&#xFF09;&#x7684;&#x96C6;&#x5408;&#x5728; m1 &#x7EF4;&#x7A7A;&#x95F4;&#x4E2D;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#xFF0C;&#x5B83;&#x7684;&#x5143;&#x7D20;&#x6570;&#x76EE;&#x7684;&#x6700;&#x5927;&#x671F;&#x671B;&#x7B49;&#x4E8E;2 m1
</code></pre><p>&#x8BE5;&#x7ED3;&#x679C;&#x8868;&#x660E;&#xFF0C;2m<sub>1</sub> &#x662F;&#x5BF9;&#x4E00;&#x65CF;&#x5177;&#x6709; m<sub>1</sub> &#x7EF4;&#x81EA;&#x7531;&#x5EA6;&#x7684;&#x51B3;&#x7B56;&#x66F2;&#x9762;&#x7684;&#x5206;&#x79BB;&#x80FD;&#x529B;&#x7684;&#x81EA;&#x7136;&#x5B9A;&#x4E49;&#x3002;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#xFF0C;&#x4E00;&#x4E2A;&#x66F2;&#x9762;&#x7684;&#x5206;&#x79BB;&#x80FD;&#x529B;&#x4E0E; VC &#x7EF4;&#x6570;&#x7684;&#x6982;&#x5FF5;&#x6709;&#x7740;&#x5BC6;&#x5207;&#x7684;&#x8054;&#x7CFB;</p>
<h2 id="&#x6CE8;&#x91CA;"><a href="#&#x6CE8;&#x91CA;" class="headerlink" title="&#x6CE8;&#x91CA;"></a>&#x6CE8;&#x91CA;</h2><p>&#x5F84;&#x5411;&#x57FA;&#x51FD;&#x6570;&#x662F;&#x5728;&#x89E3;&#x51B3;&#x5B9E;&#x591A;&#x53D8;&#x91CF;&#x63D2;&#x503C;&#x95EE;&#x9898;&#x65F6;&#x9996;&#x6B21;&#x63D0;&#x51FA;&#x7684;&#x3002;&#x73B0;&#x5728;&#x5F84;&#x5411;&#x57FA;&#x51FD;&#x6570;&#x662F;&#x6570;&#x503C;&#x5206;&#x6790;&#x7814;&#x7A76;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x4E3B;&#x8981;&#x65B9;&#x5411;</p>
<p>Cover &#x5B9A;&#x7406;&#x7684;&#x8BC1;&#x660E;&#x9075;&#x5FAA;&#x5982;&#x4E0B;&#x4E24;&#x4E2A;&#x57FA;&#x672C;&#x8003;&#x8651;&#xFF1A;</p>
<p>Schlafli &#x5B9A;&#x7406;&#xFF0C;&#x6216;&#x51FD;&#x6570;&#x8BA1;&#x6570;&#x5B9A;&#x7406;&#xFF1A;&#x5BF9; m<sub>1</sub> &#x7EF4;&#x6B27;&#x51E0;&#x91CC;&#x5F97;&#x7A7A;&#x95F4;&#x4E0A;&#x7684; N &#x4E2A;&#x5904;&#x4E8E;&#x4E00;&#x822C;&#x4F4D;&#x7F6E;&#x7684;&#x5411;&#x91CF;&#x8FDB;&#x884C;&#x4E8C;&#x5206;&#xFF0C;&#x53EF;&#x5F97;&#x5230;&#x7684;&#x9F50;&#x6B21;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x7684;&#x4E8C;&#x5206;&#x65B9;&#x5F0F;&#x7684;&#x6570;&#x76EE;&#x7B49;&#x4E8E;&#xFF1A;</p>
<p><img src="/2017/04/01/RBF-&#x5F84;&#x5411;&#x57FA;&#x51FD;&#x6570;&#x7F51;&#x7EDC;-1/4.png" alt=""></p>
<p>&#x5982;&#x679C;&#x6BCF;&#x4E00;&#x4E2A;&#x542B;&#x6709; m<sub>1</sub> &#x4E2A;&#x6216;&#x8005;&#x5C0F;&#x4E8E; m<sub>1</sub> &#x4E2A;&#x7684;&#x5411;&#x91CF;&#x5B50;&#x96C6;&#x90FD;&#x662F;&#x7EBF;&#x6027;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4; m<sub>1</sub> &#x7EF4;&#x7684;&#x6B27;&#x51E0;&#x91CC;&#x5F97;&#x7A7A;&#x95F4;&#x4E0A;&#x7684;&#x96C6;&#x5408; &#x3C7; = { x<sub>i</sub> }<sub>i=1</sub><sup>N</sup> &#x5904;&#x4E8E;&#x4E00;&#x822C;&#x4F4D;&#x7F6E;</p>
<p>&#x3C7; &#x7684;&#x8054;&#x5408;&#x6982;&#x7387;&#x5206;&#x5E03;&#x7684;&#x53CD;&#x5C04;&#x4E0D;&#x53D8;&#x6027;&#xFF1A;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x7684;&#x4E8C;&#x5206;&#x662F;&#x53EF;&#x5206;&#x7684;&#x6982;&#x7387;&#xFF08;&#x5728; &#x3C7; &#x7684;&#x6761;&#x4EF6;&#x4E0B;&#xFF09;&#x7B49;&#x4E8E; &#x3C7; &#x7684;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x4E8C;&#x5206;&#xFF08;&#x6240;&#x6709;&#x7684; N &#x4E2A;&#x5411;&#x91CF;&#x90FD;&#x5C5E;&#x4E8E;&#x4E00;&#x7C7B;&#xFF09;&#x7684;&#x975E;&#x6761;&#x4EF6;&#x6982;&#x7387;</p>
<h2 id="&#x5C0F;&#x7ED3;"><a href="#&#x5C0F;&#x7ED3;" class="headerlink" title="&#x5C0F;&#x7ED3;"></a>&#x5C0F;&#x7ED3;</h2><p>&#x672C;&#x7CFB;&#x5217;&#x7684;&#x7B2C;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x4E3B;&#x8981;&#x4ECB;&#x7ECD;&#x4E86;&#x5173;&#x4E8E;&#x6A21;&#x5F0F;&#x53EF;&#x5206;&#x7684; Cover &#x5B9A;&#x7406;&#x4EE5;&#x53CA;&#x76F8;&#x5173;&#x516C;&#x5F0F;&#x3002;</p>
<p>&#x4E0B;&#x4E00;&#x7BC7;&#x8BA1;&#x5212;&#x4E3A;&#x4ECB;&#x7ECD;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x5F84;&#x5411;&#x57FA;&#x51FD;&#x6570;&#x6765;&#x6C42;&#x89E3;&#x63D2;&#x503C;&#x95EE;&#x9898;&#x3002;</p>
<p>&#xFF08;Ps&#xFF1A;&#x516C;&#x5F0F;&#x7531;mathtype&#x53CB;&#x60C5;&#x652F;&#x6301;&#xFF09;</p>

      
    </div><!-- .entry-content -->

    <footer class="entry-meta">
    <a href="/2017/04/01/RBF-径向基函数网络-1/">
    <time datetime="2017-04-01T11:04:34.000Z" class="entry-date">
        2017-04-01
    </time>
</a>
    
  <span class="article-delim">&#8226;</span>
  <div class="article-category">
  <a class="article-category-link" href="/categories/ML/">ML</a>
  </div>

    
  <span class="article-delim">&#8226;</span>
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/Machine-Learning/">Machine Learning</a></li></ul>

    </footer>
</article>


    
<nav class="nav-single">
    <h3 class="assistive-text">文章导航</h3>
    
        <span class="nav-previous"><a href="/2017/04/17/支持向量机/" rel="prev"><span class="meta-nav">←</span> 支持向量机与核函数</a></span>
    
    
        <span class="nav-next"><a href="/2017/03/27/install-opencv3/" rel="next">Problems in Installing openCV on Mac <span class="meta-nav">→</span></a></span>
    
</nav><!-- .nav-single -->







</div></div>
        <div id="secondary" class="widget-area" role="complementary">
  
    <aside id="search" class="widget widget_search"><form role="search" method="get" accept-charset="utf-8" id="searchform" class="searchform" action="//google.com/search">
    <div>
        <input type="text" value="" name="s" id="s" />
        <input type="submit" id="searchsubmit" value="搜索" />
    </div>
</form></aside>
  
    
  
    
  <aside class="widget">
    <h3 class="widget-title">Categories</h3>
    <div class="widget-content">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/LIFE/">LIFE</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/MAC/">MAC</a><span class="category-list-count">3</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/ML/">ML</a><span class="category-list-count">24</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/PGM/">PGM</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/iOS/">iOS</a><span class="category-list-count">22</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/御宅文化/">御宅文化</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/编程/">编程</a><span class="category-list-count">58</span></li></ul>
    </div>
  </aside>

  
    
<div class="widget tag">
<h3 class="title">blogroll</h3>
<ul class="entry">


<li><a href="https://github.com/" target="_blank">我的github</a></li>


<li><a href="http://www.jianshu.com/users/41cd7711ed44/latest_articles" target="_blank">我的简书主页</a></li>


<li><a href="http://uuzdaisuki.com" target="_blank">leticia’s blog</a></li>


<li><a href="http://www.helloyzy.cn" target="_blank">acery</a></li>


<li><a href="http://wxjackie.com" target="_blank">WXJACKIE</a></li>


<li><a href="http://www.stephenzhang.me" target="_blank">stephenzhang</a></li>


<li><a href="blog.keybrl.com" target="_blank">keybrl</a></li>


<li><a href="http://www.ciaran.cn/" target="_blank">Ciaran</a></li>

</ul>
</div>

  
    
  <aside class="widget">
    <h3 class="widget-title">Recents</h3>
    <div class="widget-content">
      <ul>
        
          <li>
            <a href="/2017/11/01/循环神经网络-RNN/">循环神经网络_RNN</a>
          </li>
        
          <li>
            <a href="/2017/10/31/CNN之定位检测/">卷积神经网络之定位检测</a>
          </li>
        
          <li>
            <a href="/2017/10/27/CNN-Structure-2/">CNN_Structure_2</a>
          </li>
        
          <li>
            <a href="/2017/10/25/CNN-Structure/">CNN Structure -- 1</a>
          </li>
        
          <li>
            <a href="/2017/10/16/MapReduce-RDBMs/">MapReduce VS RDBMs</a>
          </li>
        
      </ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Tags</h3>
    <div class="widget-content">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/Cloud-Computing/">Cloud Computing</a><span class="tag-list-count">3</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Cocoapods/">Cocoapods</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/HTML/">HTML</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Linux/">Linux</a><span class="tag-list-count">15</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Machine-Learning/">Machine Learning</a><span class="tag-list-count">17</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Matlab/">Matlab</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Neural-Networks/">Neural Networks</a><span class="tag-list-count">4</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Probabilistic-Graphical-Models/">Probabilistic Graphical Models</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIColor/">UIColor</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView/">UIView</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView-圆角/">UIView-圆角</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Vim/">Vim</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/bug/">bug</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/hexo/">hexo</a><span class="tag-list-count">4</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/openCV/">openCV</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/二维码/">二维码</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/指针/">指针</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/操作系统/">操作系统</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/数据库/">数据库</a><span class="tag-list-count">3</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/数据结构/">数据结构</a><span class="tag-list-count">20</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/算法/">算法</a><span class="tag-list-count">9</span></li></ul>
    </div>
  </aside>

  
</div>
      </div>
      <footer id="colophon" role="contentinfo">
    <p>&copy; 2017 SaberDa
    All rights reserved.</p>
    <p>Powered by <a href="http://hexo.io/" target="_blank">Hexo</a></p>
</footer>
    <script>window._bd_share_config={"common":{"bdSnsKey":{},"bdText":"","bdMini":"1","bdMiniList":false,"bdPic":"","bdStyle":"2","bdSize":"16"},"share":{}};with(document)0[(getElementsByTagName('head')[0]||body).appendChild(createElement('script')).src='http://bdimg.share.baidu.com/static/api/js/share.js?v=89860593.js?cdnversion='+~(-new Date()/36e5)];</script>

<script src="/js/jquery-2.0.3.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

<script src="/js/navigation.js"></script>

<div id="bg"></div>

  </div>
</body>
</html>