<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  
  <meta name="description" content="阿尔托利亚是我老婆~" />
  

  
  
  
  
  
  
  <title>RNN 与 LSTM | SaberDa的幻想乡</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="RNN &amp;#x7684;&amp;#x7B80;&amp;#x77ED;&amp;#x590D;&amp;#x4E60;&amp;#x6211;&amp;#x4EEC;&amp;#x53EA;&amp;#x5728;&amp;#x4E00;&amp;#x5F00;&amp;#x59CB;&amp;#x8F93;&amp;#x5165;&amp;#x4E86;&amp;#x4E00;&amp;#x6B21;&amp;#x56FE;&amp;#x7247;&amp;#xFF0C;&amp;#x4F7F;&amp;#x7528;&amp;#x8FD9;&amp;#x4E2A;&amp;#x6">
<meta property="og:type" content="article">
<meta property="og:title" content="RNN 与 LSTM">
<meta property="og:url" content="https://saberda.github.io/2017/11/02/LSTM/index.html">
<meta property="og:site_name" content="SaberDa的幻想乡">
<meta property="og:description" content="RNN &amp;#x7684;&amp;#x7B80;&amp;#x77ED;&amp;#x590D;&amp;#x4E60;&amp;#x6211;&amp;#x4EEC;&amp;#x53EA;&amp;#x5728;&amp;#x4E00;&amp;#x5F00;&amp;#x59CB;&amp;#x8F93;&amp;#x5165;&amp;#x4E86;&amp;#x4E00;&amp;#x6B21;&amp;#x56FE;&amp;#x7247;&amp;#xFF0C;&amp;#x4F7F;&amp;#x7528;&amp;#x8FD9;&amp;#x4E2A;&amp;#x6">
<meta property="og:image" content="https://saberda.github.io/2017/11/02/LSTM/1.png">
<meta property="og:image" content="https://saberda.github.io/2017/11/02/LSTM/2.png">
<meta property="og:image" content="https://saberda.github.io/2017/11/02/LSTM/3.png">
<meta property="og:image" content="https://saberda.github.io/2017/11/02/LSTM/4.png">
<meta property="og:image" content="https://saberda.github.io/2017/11/02/LSTM/5.png">
<meta property="og:image" content="https://saberda.github.io/2017/11/02/LSTM/6.png">
<meta property="og:image" content="https://saberda.github.io/2017/11/02/LSTM/7.png">
<meta property="og:image" content="https://saberda.github.io/2017/11/02/LSTM/8.png">
<meta property="og:image" content="https://saberda.github.io/2017/11/02/LSTM/9.png">
<meta property="og:image" content="https://saberda.github.io/2017/11/02/LSTM/10.png">
<meta property="og:image" content="https://saberda.github.io/2017/11/02/LSTM/11.png">
<meta property="og:updated_time" content="2017-11-02T07:18:40.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="RNN 与 LSTM">
<meta name="twitter:description" content="RNN &amp;#x7684;&amp;#x7B80;&amp;#x77ED;&amp;#x590D;&amp;#x4E60;&amp;#x6211;&amp;#x4EEC;&amp;#x53EA;&amp;#x5728;&amp;#x4E00;&amp;#x5F00;&amp;#x59CB;&amp;#x8F93;&amp;#x5165;&amp;#x4E86;&amp;#x4E00;&amp;#x6B21;&amp;#x56FE;&amp;#x7247;&amp;#xFF0C;&amp;#x4F7F;&amp;#x7528;&amp;#x8FD9;&amp;#x4E2A;&amp;#x6">
<meta name="twitter:image" content="https://saberda.github.io/2017/11/02/LSTM/1.png">
  
  
    <link rel="icon" href="/css/images/favicon.ico">
  
  <link rel="stylesheet" href="/css/style.css">
  

  
  <!-- baidu webmaster push -->
  <script src='//push.zhanzhang.baidu.com/push.js'></script>
</head>
<body class="home blog custom-background custom-font-enabled single-author">
  <div id="page" class="hfeed site">
      <header id="masthead" class="site-header" role="banner">
    <hgroup>
      <h1 class="site-title">
        <a href="/" title="SaberDa的幻想乡" rel="home">SaberDa的幻想乡</a>
      </h1>
      
        <h2 class="site-description">
          <a href="/" id="subtitle">　　iOS/ ML　　|　　二次元　　|　　saberda@qq.com　　|　　从花时间省钱到花钱省时间</a>
        </h2>
      
    </hgroup>

    <nav id="site-navigation" class="main-navigation" role="navigation">
            <button class="menu-toggle">菜单</button>
            <a class="assistive-text" href="/#content" title="跳至内容">跳至内容</a><!--TODO-->
            <div class="menu-main-container">
                <ul id="menu-main" class="nav-menu">
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/archives">所有文章</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/">主页</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/编程/">编程</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/iOS/">iOS</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/ML/">ML</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/PGM/">PGM</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/MAC/">MAC</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/御宅文化/">御宅文化</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/LIFE/">LIFE</a></li>
                
                </ul>
            </div>
    </nav>
</header>
      <div id="main" class="wrapper">
        <div id="primary" class="site-content"><div id="content" role="main"><article id="post-LSTM" class="post-LSTM post type-post status-publish format-standard hentry">
    <!---->

      <header class="entry-header">
        
        
  
    <h1 class="entry-title article-title">
      RNN 与 LSTM
    </h1>
  

        
        <div class="comments-link">
            
            <a href="javascript:void(0);" data-url="https://saberda.github.io/2017/11/02/LSTM/" data-id="cjbai2122001cq4b3c3vgwb3e" class="leave-reply bdsharebuttonbox" data-cmd="more">Share</a>
        </div><!-- .comments-link -->
      </header><!-- .entry-header -->

    <div class="entry-content">
      
        <h2 id="RNN-&#x7684;&#x7B80;&#x77ED;&#x590D;&#x4E60;"><a href="#RNN-&#x7684;&#x7B80;&#x77ED;&#x590D;&#x4E60;" class="headerlink" title="RNN &#x7684;&#x7B80;&#x77ED;&#x590D;&#x4E60;"></a>RNN &#x7684;&#x7B80;&#x77ED;&#x590D;&#x4E60;</h2><p>&#x6211;&#x4EEC;&#x53EA;&#x5728;&#x4E00;&#x5F00;&#x59CB;&#x8F93;&#x5165;&#x4E86;&#x4E00;&#x6B21;&#x56FE;&#x7247;&#xFF0C;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#xFF0C;&#x4F60;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5C31;&#x53EF;&#x4EE5;&#x56DE;&#x770B;&#x8F93;&#x5165;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x7136;&#x540E;&#x6839;&#x636E;&#x56FE;&#x7247;&#x7684;&#x4E00;&#x6B65;&#x767B;&#x751F;&#x6210;&#x63CF;&#x8FF0;&#x7684;&#x8BCD;&#x6C47;&#x3002;</p>
<p>&#x6BCF;&#x5F53;&#x4F60;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x65B0;&#x8BCD;&#x65F6;&#xFF0C;&#x4F60;&#x4F7F;&#x4F60;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x53EF;&#x4EE5;&#x56DE;&#x770B;&#x56FE;&#x7247;&#xFF0C;&#x7136;&#x540E;&#x627E;&#x5230;&#x5B83;&#x60F3;&#x8981;&#x5F62;&#x5BB9;&#x4E0D;&#x540C;&#x7279;&#x5F81;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x8BCD;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x53EF;&#x8BAD;&#x7EC3;&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#xFF0C;&#x6240;&#x4EE5; RNN &#x4E0D;&#x4EC5;&#x4EA7;&#x751F;&#x4E86;&#x5F62;&#x5BB9;&#x8BCD;&#xFF0C;&#x8FD8;&#x51B3;&#x5B9A;&#x4E86;&#x4E0B;&#x4E00;&#x6B65;&#x770B;&#x5411;&#x56FE;&#x7247;&#x7684;&#x54EA;&#x91CC;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x5B83;&#x6240;&#x505A;&#x5230;&#x7684;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4EA7;&#x751F;&#x4E86; RNN &#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#xFF0C;&#x8FD8;&#x8981;&#x627E;&#x5230;&#x6309;&#x987A;&#x5E8F;&#x6392;&#x5217;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x5F62;&#x5BB9;&#x8BCD;&#x7684;&#x6982;&#x7387;&#x5206;&#x5E03;&#x3002;</p>
<a id="more"></a>
<p><img src="/2017/11/02/LSTM/1.png" alt=""></p>
<p>&#x4F46;&#x662F;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x91CC;&#xFF0C;&#x8FD9;&#x4E2A;&#x7F51;&#x7EDC;&#x7ED9;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x6211;&#x4EEC;&#x8FD0;&#x884C;&#x795E;&#x7ECF;&#x7F51;&#x8DEF;&#xFF0C;&#x5F97;&#x5230;&#x4E86;&#x4E00;&#x4E2A; 14 <em> 14 </em> 512 &#x5927;&#x5C0F;&#x7684;&#x6FC0;&#x6D3B;&#x5BB9;&#x91CF;&#xFF0C;&#x800C;&#x4E14;&#x6BCF;&#x4E00;&#x6B21;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x7684;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x8FD9;&#x4E2A;&#x5206;&#x5E03;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A; 512 &#x7EF4;&#x7684;&#x5411;&#x91CF;&#xFF0C;&#x5B83;&#x5927;&#x6982;&#x5C31;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x6765;&#x67E5;&#x8BE2;&#x7684;&#x5173;&#x952E;&#x8BCD;&#xFF0C;&#x627E;&#x51FA;&#x4F60;&#x4E0B;&#x4E00;&#x6B65;&#x60F3;&#x770B;&#x56FE;&#x7247;&#x54EA;&#x91CC;&#xFF0C;&#x4F46;&#x662F;&#x5B9E;&#x9645;&#x4E0A;&#x8FD9;&#x4E0D;&#x662F;&#x8FD9;&#x7247;&#x8BBA;&#x6587;&#x4E3B;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x8FD9;&#x4E2A; 512&#x7EF4; &#x7684;&#x5411;&#x91CF;&#x662F;&#x7531; RNN &#x751F;&#x6210;&#x7684;&#xFF0C;&#x7528;&#x4E00;&#x4E9B;&#x6743;&#x503C;&#x6765;&#x9884;&#x6D4B;&#xFF0C;&#x7136;&#x540E;&#x8FD9;&#x4E2A;&#x5411;&#x91CF;&#x53EF;&#x4EE5;&#x548C;&#x8FD9;&#x7247;&#x533A;&#x57DF;&#x91CC;&#x7684;&#x6BCF;&#x4E00;&#x4E2A; 14 * 14 &#x505A;&#x70B9;&#x4E58;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x505A;&#x5B8C;&#x4E86;&#x5168;&#x90E8;&#x70B9;&#x4E58;&#xFF0C;&#x5F97;&#x5230;&#x4E86;&#x4E00;&#x4E2A; 14 * 14 &#x7684; compatibility map&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x653E;&#x4E00;&#x4E2A; softmax &#x5728;&#x4E0A;&#x9762;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x6211;&#x4EEC;&#x5BF9;&#x4ED6;&#x8FDB;&#x884C;&#x6B63;&#x5219;&#x5316;&#xFF0C;&#x5F97;&#x5230; attention over the image&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x662F;&#x4E00;&#x4E2A; 14 * 14 &#x7684;&#x6620;&#x5C04;&#x3002;</p>
<p>&#x57FA;&#x4E8E;&#x50CF;&#x5728;&#x56FE;&#x4E2D;&#x7684; RNN &#x6700;&#x6709;&#x610F;&#x601D;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x6982;&#x7387;&#x5206;&#x5E03;&#xFF0C;&#x5947;&#x62DB;&#x5177;&#x6709;&#x8FD9;&#x4E9B;&#x7279;&#x5F81;&#x7684;&#x6743;&#x91CD;&#x548C;&#x3002;&#x8FD9;&#x4E2A; RNN &#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x4EA7;&#x751F;&#x8FD9;&#x4E9B;&#x5411;&#x91CF;&#x6765;&#x5F97;&#x51FA;&#x6700;&#x8FD1;&#x6700;&#x5438;&#x5F15;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x70B9;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x7136;&#x540E;&#x5B83;&#x56DE;&#x5230;&#x90A3;&#x91CC;&#xFF0C;&#x6700;&#x540E;&#x4F60;&#x505A;&#x4E86;&#x4E00;&#x4E2A;&#x5173;&#x4E8E;&#x4E0D;&#x540C;&#x7279;&#x5F81;&#x52A0;&#x6743;&#x548C;&#xFF0C;&#x627E;&#x51FA;&#x8FD9;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#x4E0A; RNN &#x6700;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x3002;</p>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;RNN &#x6B63;&#x5728;&#x751F;&#x6210;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x51B3;&#x5B9A;&#x8981;&#x67E5;&#x627E;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x4ED6;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x6709; 512 &#x4E2A;&#x6570;&#x5B57;&#x7684;&#x5411;&#x91CF;&#x5173;&#x4E8E;&#x5BF9;&#x8C61;&#x4E4B;&#x7C7B;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x7136;&#x540E;&#x548C;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x4EA4;&#x4E92;&#xFF0C;&#x7136;&#x540E;&#x53EF;&#x80FD;&#x5BF9;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x6216;&#x662F;&#x6FC0;&#x6D3B;&#x516C;&#x5F0F;&#xFF0C;&#x6700;&#x540E;&#x4F60;&#x5C31;&#x96C6;&#x4E2D;&#x4F60;&#x7684;&#x6CE8;&#x610F;&#x529B;&#x5728;&#x90A3;&#x56FE;&#x7247;&#x7684;&#x90A3;&#x90E8;&#x5206;&#x3002;&#x6240;&#x4EE5;&#x57FA;&#x672C;&#x4E0A;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x4EA4;&#x4E92;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x67E5;&#x627E;&#x56FE;&#x7247;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E00;&#x4E9B;&#x548C; soft attention &#x6709;&#x5173;&#x7684;&#x4E1C;&#x897F;&#x4E86;</p>
<pre><code>RNN &#x7684;&#x8F93;&#x5165;&#x53EF;&#x4EE5;&#x6709;&#x9009;&#x62E9;&#x7684; attention &#x4F5C;&#x4E3A;&#x5BF9;&#x8F93;&#x5165;&#x7684;&#x5904;&#x7406;&#x3002;
</code></pre><h2 id="RNN-&#x7684;&#x590D;&#x6742;&#x5316;&#x4E0E;-LSTM-&#x7684;&#x5F15;&#x51FA;"><a href="#RNN-&#x7684;&#x590D;&#x6742;&#x5316;&#x4E0E;-LSTM-&#x7684;&#x5F15;&#x51FA;" class="headerlink" title="RNN &#x7684;&#x590D;&#x6742;&#x5316;&#x4E0E; LSTM &#x7684;&#x5F15;&#x51FA;"></a>RNN &#x7684;&#x590D;&#x6742;&#x5316;&#x4E0E; LSTM &#x7684;&#x5F15;&#x51FA;</h2><p>&#x5982;&#x679C;&#x4F60;&#x60F3;&#x628A; RNN &#x53D8;&#x5F97;&#x66F4;&#x590D;&#x6742;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x589E;&#x52A0;&#x5C42;&#x6570;&#x3002;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5C42;&#x6570;&#x8D8A;&#x591A;&#x5DE5;&#x4F5C;&#x6548;&#x679C;&#x8D8A;&#x597D;&#x3002;&#x5806;&#x53E0;&#x5C42;&#x6570;&#x7684;&#x65B9;&#x6CD5;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x5C31;&#x662F;&#x5806;&#x53E0; RNN &#x7684;&#x5C42;&#x6570;&#xFF0C;&#x8FD9;&#x90E8;&#x5206;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x65B9;&#x6CD5;&#x3002;</p>
<p><img src="/2017/11/02/LSTM/2.png" alt=""></p>
<p>&#x4E0A;&#x56FE;&#x4E2D;&#x662F;&#x4E00;&#x79CD;&#x4EBA;&#x4EEC;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5411;RNN&#x91CC;&#x52A0;&#x5165;&#x65B0;&#x7684;&#x5C42;&#x3002;&#x4E0B;&#x4E00;&#x4E2A; RNN &#x7684;&#x8F93;&#x5165;&#x662F;&#x524D;&#x4E00;&#x4E2A; RNN &#x7684;&#x9690;&#x85CF;&#x72B6;&#x6001;&#x5411;&#x91CF;&#x3002;&#x5728;&#x8FD9;&#x526F;&#x56FE;&#x91CC;&#xFF0C;&#x6A2A;&#x8F74;&#x662F;&#x65F6;&#x95F4;&#xFF0C;&#x5411;&#x4E0A;&#x770B;&#x4F7F;&#x6211;&#x4EEC;&#x7684;&#x4E0D;&#x540C;&#x7684; RNN &#x3002;&#x8FD9;&#x5728;&#x5F20;&#x56FE;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x4E09;&#x4E2A; RNN&#xFF0C;&#x6BCF;&#x4E2A;&#x90FD;&#x6709;&#x5C5E;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x6743;&#x91CD;&#x96C6;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B; RNN &#x5C31;&#x662F;&#x4ECE;&#x4E00;&#x4E2A;&#x6D41;&#x5411;&#x53E6;&#x4E00;&#x4E2A;&#xFF0C;&#x8FD9;&#x4E9B; RNN &#x90FD;&#x662F;&#x4E00;&#x8D77;&#x8BAD;&#x7EC3;&#x7684;&#xFF08;&#x5373;&#x6CA1;&#x6709;&#x4F9D;&#x6B21;&#x8BAD;&#x7EC3;&#x7684;&#x8BF4;&#x6CD5;&#xFF09;&#xFF0C;&#x5168;&#x90E8;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5411;&#x540E;&#x4F20;&#x64AD;&#x3002;</p>
<p><img src="/2017/11/02/LSTM/3.png" alt=""></p>
<p>&#x8FD9;&#x4E2A; RNN &#x516C;&#x5F0F;&#xFF0C;&#x662F;&#x5BF9;&#x4E4B;&#x524D;&#x7684;&#x516C;&#x5F0F;&#x4E00;&#x4E2A;&#x91CD;&#x5199;&#xFF0C;&#x4F46;&#x662F;&#x672C;&#x8D28;&#x5374;&#x6CA1;&#x6709;&#x53D8;&#x5316;&#xFF0C;&#x4EFB;&#x7136;&#x548C;&#x4E4B;&#x524D;&#x505A;&#x4E00;&#x6837;&#x7684;&#x5904;&#x7406;&#x3002;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x5411;&#x91CF;&#x5F62;&#x5F0F;&#x7684;&#x6DF1;&#x5EA6;&#x548C;&#x4E00;&#x4E2A;&#x5411;&#x91CF;&#x5F62;&#x5F0F;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x5B83;&#x4EEC;&#x548C;W&#x8F6C;&#x79FB;&#x77E9;&#x9635;&#x505A;&#x5904;&#x7406;&#xFF0C;&#x518D;&#x628A;&#x4ED6;&#x4EEC;&#x653E;&#x5230; tanh &#x7684;&#x8FD0;&#x7B97;&#x91CC;&#x3002;&#x6240;&#x4EE5;&#x5F53;&#x4F60;&#x589E;&#x52A0;&#x5C42;&#x6570;&#x6216;&#x8005;&#x8F93;&#x5165;&#x4E00;&#x4E2A;W&#x8F6C;&#x79FB;&#x77E9;&#x9635;&#x65F6;&#xFF0C;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#x53EF;&#x4EE5;&#x5199;&#x6210;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x516C;&#x5F0F;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x600E;&#x6837;&#x589E;&#x52A0; RNN &#x7684;&#x5C42;&#x6570;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4F7F;&#x7F51;&#x7EDC;&#x53D8;&#x5F97;&#x590D;&#x6742;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EC5;&#x5C40;&#x9650;&#x4E8E;&#x589E;&#x52A0;&#x5C42;&#x6570;&#xFF0C;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684; RNN &#x516C;&#x5F0F;&#x3002;</p>
<h2 id="Long-Short-Time-Memory"><a href="#Long-Short-Time-Memory" class="headerlink" title="Long Short Time Memory"></a>Long Short Time Memory</h2><p>&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x4E86;&#x89E3;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684; RNN &#x516C;&#x5F0F;&#xFF0C;&#x800C;&#x5728;&#x5B9E;&#x9645;&#x8BD5;&#x9A8C;&#x4E2D;&#xFF0C;&#x4F60;&#x57FA;&#x672C;&#x4E0A;&#x7528;&#x4E0D;&#x4E86;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#x7684;&#x516C;&#x5F0F;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x4E4B;&#x524D;&#x5C55;&#x793A;&#x7684;&#x90A3;&#x4E2A;&#x7F51;&#x7EDC;&#x5F88;&#x5C11;&#x4F7F;&#x7528;&#xFF0C;&#x53D6;&#x800C;&#x4EE3;&#x4E4B;&#x7684;&#x662F; LSTM&#xFF08;long short time memory&#xFF09;&#xFF0C;&#x57FA;&#x672C;&#x73B0;&#x5728;&#x6240;&#x6709;&#x7684;&#x8BBA;&#x6587;&#x90FD;&#x7528;&#x8FD9;&#x4E2A;&#x3002;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x4F60;&#x8981;&#x4F7F;&#x7528; RNN&#xFF0C;&#x8FD9;&#x91CC;&#x5C31;&#x662F;&#x4F60;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x516C;&#x5F0F;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x8981;&#x5F3A;&#x8C03;&#x7684;&#x662F;&#xFF0C;&#x4ED6;&#x7684;&#x4E00;&#x5207;&#x90FD;&#x548C;&#x4E4B;&#x524D;&#x7684; Vanilla &#x7F51;&#x7EDC;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x552F;&#x4E00;&#x4E0D;&#x540C;&#x7684;&#x662F;RNN&#x516C;&#x5F0F;&#x53D8;&#x5F97;&#x590D;&#x6742;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x662F;&#x4ECE;&#x4E0B;&#x4E00;&#x5C42;&#x63A5;&#x53D7; hidden vector&#xFF0C;&#x5C31;&#x50CF;&#x4F60;&#x7684;&#x8F93;&#x5165;&#x4E00;&#x6837;&#xFF0C;&#x5728;&#x8F83;&#x65E9;&#x7684;&#x65F6;&#x95F4;&#x70B9;&#x5BF9;&#x5E94;&#x7684;&#x662F;&#x524D;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x3002;</p>
<p><img src="/2017/11/02/LSTM/4.png" alt=""></p>
<p>&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;RNN &#x6BCF;&#x4E00;&#x6B65;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5411;&#x91CF; h&#xFF0C;&#x800C;LSTM&#x6BCF;&#x6B21;&#x6709;&#x4E24;&#x4E2A;&#x5411;&#x91CF;&#xFF0C;hidden cector h &#x548C; cell state vector c&#x3002;&#x6240;&#x4EE5;&#x6BCF;&#x4E00;&#x6B21;&#x6211;&#x4EEC;&#x6709; h &#x548C; c &#x4E24;&#x4E2A;&#x5E76;&#x884C;&#xFF0C;&#x7136;&#x540E;&#x5411;&#x91CF; c &#x7528;&#x9EC4;&#x8272;&#x8868;&#x793A;&#xFF08;&#x4E0B;&#x9762;&#x90A3;&#x4E00;&#x5C42;&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x7A7A;&#x95F4;&#x91CC;&#x6BCF;&#x4E2A;&#x70B9;&#x6709;&#x4E24;&#x4E2A;&#x5411;&#x91CF;&#x3002;</p>
<p><img src="/2017/11/02/LSTM/5.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x628A;&#x5B83;&#x4E32;&#x8054;&#x8D77;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x653E;&#x5165;&#x4E00;&#x4E2A;W&#x8F6C;&#x79FB;&#x77E9;&#x9635;&#xFF0C;&#x4E4B;&#x540E;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x66F4;&#x590D;&#x6742;&#x7684;&#x65B9;&#x5F0F;&#x5F97;&#x5230;&#x65B0;&#x7684; hidden state&#x3002;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x53EA;&#x662F;&#x627E;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x66F4;&#x590D;&#x6742;&#x7684;&#x529E;&#x6CD5;&#x6765;&#x5904;&#x7406;&#x6765;&#x81EA;&#x4E0B;&#x5C42;&#x548C;&#x8FC7;&#x53BB;&#x7684;&#x8F93;&#x5165;&#x6765;&#x5F97;&#x5230;&#x4E00;&#x4E2A; hidden state &#x7684;&#x66F4;&#x65B0;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x8BB2;&#x8BB2;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#x7684;&#x7EC6;&#x8282;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x5C55;&#x793A;&#x7684; LSTM &#x7684;&#x65B9;&#x7A0B;&#x6211;&#x4EEC;&#x5148;&#x8BB2;&#x4E0A;&#x9762;&#x8FD9;&#x90E8;&#x5206;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x4E0B;&#x9762;&#x548C;&#x4E4B;&#x524D;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x63A5;&#x53D7;&#x8FD9;&#x4E24;&#x4E2A;&#x5411;&#x91CF;&#xFF0C;h &#x662F;&#x524D;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#xFF0C;x &#x662F;&#x8F93;&#x5165;&#xFF0C;&#x6211;&#x4EEC;&#x7528; W &#x6620;&#x5C04;&#x5230; x &#x548C; h&#xFF0C;x &#x548C; h&#x7684;&#x5927;&#x5C0F;&#x90FD;&#x662F; n&#xFF0C;&#x4ED6;&#x4EEC;&#x90FD;&#x7531; n &#x4E2A;&#x6570;&#x5B57;&#x7EC4;&#x6210;&#xFF0C;&#x6700;&#x540E;&#x6211;&#x4EEC;&#x4F1A;&#x4EA7;&#x751F; 4n &#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x901A;&#x8FC7; W &#x77E9;&#x9635;&#x4EA7;&#x751F;&#x4E86; 4n * 2n&#x3002;<strong>&#x8FD9;&#x91CC;&#x6709; 4 &#x4E2A;&#x5411;&#x91CF;&#xFF0C;i, f, o, g&#xFF0C;&#x5206;&#x522B;&#x662F;&#x8F93;&#x5165; input&#xFF0C;&#x9057;&#x5FD8; forget&#xFF0C;&#x8F93;&#x51FA; output&#xFF0C;&#x7136;&#x540E;i, f, o&#x7ECF;&#x8FC7; sigmoid gate&#xFF0C;g&#x7ECF;&#x8FC7; tanh gate&#x3002;</strong></p>
<p><img src="/2017/11/02/LSTM/6.png" alt=""></p>
<p>&#x6240;&#x4EE5;<strong>&#x8FD9;&#x4E2A;&#x7F51;&#x7EDC;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;</strong>&#x5C31;&#x662F;&#xFF0C;&#x5BF9; c &#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x6839;&#x636E;&#x4F60;&#x4E4B;&#x524D;&#x7684;&#x72B6;&#x6001;&#x548C;&#x4F60;&#x4E0B;&#x5C42;&#x4F20;&#x4E0A;&#x6765;&#x7684;&#x503C;&#xFF0C;&#x4F7F;&#x7528; i, f, g, o &#x5B9E;&#x73B0;&#x4E86;&#x5BF9;&#x4E8E; c &#x7684;&#x64CD;&#x4F5C;&#x3002;&#x8FD9;&#x91CC;&#x6765;&#x89E3;&#x91CA;&#x4E00;&#x4E0B;&#x8FC7;&#x7A0B;&#xFF0C;&#x8981;&#x628A; i, f &#x548C; o &#x60F3;&#x8C61;&#x6210;&#x4E8C;&#x8FDB;&#x5236;&#x7684;&#xFF0C;&#x4E0D;&#x662F; 0 &#x5C31;&#x662F; 1&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x7528;&#x4ED6;&#x4EEC;&#x6765;&#x8868;&#x793A;&#x95E8;&#xFF08;gate&#xFF09;&#xFF0C;&#x4E4B;&#x540E;&#x6211;&#x4EEC;&#x5BF9;&#x4ED6;&#x4EEC;&#x8FDB;&#x884C; sigmoid&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x4F7F;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x5FAE;&#x5206;&#xFF0C;&#x7136;&#x540E;&#x961F;&#x53EF;&#x4EE5;&#x5BF9;&#x6240;&#x6709;&#x70B9;&#x8FDB;&#x884C; BP&#x3002;&#x57FA;&#x4E8E;&#x73AF;&#x5883;&#x5C31;&#x628A;&#x6240;&#x6709;&#x7684;&#x90FD;&#x5F53;&#x505A;&#x662F;&#x4E8C;&#x8FDB;&#x5236;&#x7684;&#x5C31;&#x884C;&#x4E86;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#x7684;&#x4F5C;&#x7528;&#x662F;&#xFF1A;&#x6839;&#x636E;&#x8FD9;&#x4E9B;&#x95E8;&#x548C; g&#xFF0C;&#x6211;&#x4EEC;&#x6700;&#x7EC8;&#x5C06;&#x5B8C;&#x6210;&#x5BF9; c &#x503C;&#x5F97;&#x66F4;&#x65B0;&#xFF0C;f &#x88AB;&#x79F0;&#x4F5C;&#x5FD8;&#x8BB0;&#x95E8;&#xFF0C;&#x901A;&#x5E38;&#x7528;&#x6765;&#x628A;&#x4E00;&#x4E9B;&#x7EC6;&#x80DE;&#xFF08;cells&#xFF09;&#x72B6;&#x6001;&#x7F6E; 0&#xFF0C;&#x8FD9;&#x4E9B;&#x7EC6;&#x80DE;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x8BA1;&#x6570;&#x5668;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; f &#x8FD0;&#x7B97;&#x91CD;&#x65B0;&#x7F6E; 0&#x3002;&#x8FD9;&#x91CC;&#x53D1;&#x751F;&#x7684;&#x662F;&#x6570;&#x7EC4;&#x8FD0;&#x7B97;&#x4E58;&#x6CD5;&#xFF0C;&#x5982;&#x679C; f &#x4E3A; 0&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0; c &#x901A;&#x8FC7;&#x4E0E; f &#x76F8;&#x4E58;&#x8F93;&#x51FA;&#x4E3A; 0&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;<strong>&#x5B9E;&#x73B0;&#x4E86;&#x8BA1;&#x6570;&#x5668;&#x91CD;&#x7F6E;</strong>&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x4E0E; i &#x548C; g &#x7684;&#x4E58;&#x79EF;&#x76F8;&#x52A0;&#xFF0C;&#x7531;&#x4E8E; i &#x53D6;&#x503C;&#x5728; 0 &#x5230; 1 &#x4E4B;&#x95F4;&#xFF0C;g &#x53D6;&#x503C; -1 &#x5230; 1 &#x4E4B;&#x95F4;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x5BF9;&#x6BCF;&#x4E00;&#x4E2A;&#x7EC6;&#x80DE;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x4ECB;&#x4E8E; -1 &#x5230; 1 &#x7684;&#x6570;&#x503C;&#xFF0C;&#x5728;&#x6BCF;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x5185;&#x90FD;&#x8FDB;&#x884C;&#x8FD9;&#x4E9B;&#x8FD0;&#x7B97;&#xFF0C;&#x5305;&#x62EC;&#x901A;&#x8FC7;&#x5FD8;&#x8BB0;&#x95E8;&#x628A;&#x5B83;&#x91CD;&#x7F6E;&#x4E3A; 0 &#x6216;&#x8005;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A; -1 &#x5230; 1 &#x4E4B;&#x95F4;&#x7684;&#x6570;&#x503C;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;<strong>&#x7EC6;&#x80DE;&#x72B6;&#x6001;&#x7684;&#x66F4;&#x65B0;</strong>&#x3002;</p>
<p>&#x9690;&#x85CF;&#x5C42;&#x51FD;&#x6570; h &#x66F4;&#x65B0;&#x662F;&#x4EE5;&#x6324;&#x538B;&#x7EC6;&#x80DE;&#x7684;&#x5F62;&#x5F0F;&#x8FDB;&#x884C;&#x7684;&#xFF0C;tanh(c)&#xFF0C;&#x6324;&#x538B;&#x7A0B;&#x5EA6;&#x7531;&#x8F93;&#x51FA;&#x95E8;&#x8FDB;&#x884C;&#x8C03;&#x6574;&#xFF0C;&#x6240;&#x4EE5;&#x7ECF;&#x8FC7; o &#x53C2;&#x6570;&#x8C03;&#x6574;&#x540E;&#x53EA;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x7EC6;&#x80DE;&#x8FDB;&#x5165;&#x9690;&#x542B;&#x72B6;&#x6001;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x5B66;&#x4E60;&#x9009;&#x62E9;&#x4E00;&#x90E8;&#x5206;&#x7EC6;&#x80DE;&#x72B6;&#x6001;&#x8FDB;&#x5165;&#x9690;&#x85CF;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x8FD9;&#x6709;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#x9700;&#x8981;&#x5F3A;&#x8C03;&#x4E00;&#x4E0B;&#xFF0C;<strong>&#x6211;&#x4EEC;&#x7528; -1 &#x5230; 1 &#x4E4B;&#x95F4;&#x7684;&#x6570;&#x503C; i &#x6765;&#x4E58; g</strong>&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x7528; g &#x66FF;&#x6362;&#xFF0C;g &#x53D6;&#x503C;&#x5DF2;&#x7ECF;&#x662F; -1 &#x5230; 1 &#x4E4B;&#x95F4;&#xFF0C;&#x90A3;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD8;&#x8981;&#x4E58;&#x4E0A; i &#x5462;&#xFF1F;&#x5728;&#x6211;&#x4EEC;&#x53EA;&#x60F3;&#x8981;&#x4E3A; c &#x589E;&#x52A0; -1 &#x5230; 1 &#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E00;&#x6B65;&#x6709;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x5417;&#xFF1F;&#x8FD9;&#x662F; LSTM &#x4E2D; cell &#x53C2;&#x6570;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x662F;&#x5982;&#x679C;&#x4F60;&#x8BA4;&#x4E3A; g &#x662F;&#x524D;&#x6587;&#x7684;&#x7EBF;&#x6027;&#x51FD;&#x6570; tanh &#x5F97;&#x5230;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x76F4;&#x63A5;&#x52A0;&#x4E0A; g &#x800C;&#x4E0D;&#x662F;&#x52A0;&#x4E0A; i * g&#xFF0C;&#x90A3;&#x5C06;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x901A;&#x8FC7;&#x52A0;&#x4E0A; i &#x4E58;&#x6CD5;&#x64CD;&#x4F5C;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x51FD;&#x6570;&#x66F4;&#x52A0;&#x590D;&#x6742;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x66F4;&#x80FD;&#x8868;&#x8FBE;&#x6211;&#x4EEC;&#x52A0;&#x5230;&#x7EC6;&#x80DE;&#x72B6;&#x6001;&#xFF08;cell state&#xFF09;&#x91CC;&#x7684;&#x4E1C;&#x897F;&#xFF1B;&#x53E6;&#x4E00;&#x79CD;&#x601D;&#x8003;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x628A;&#x8FD9;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#x5206;&#x5F00;&#x6765;&#x770B;&#xFF0C;g &#x8868;&#x793A;&#x6211;&#x4EEC;&#x8981;&#x5728;&#x7EC6;&#x80DE;&#x72B6;&#x6001;&#x91CC;&#x589E;&#x52A0;&#x591A;&#x5C11;&#xFF0C;i &#x8868;&#x793A;&#x6211;&#x4EEC;&#x662F;&#x5426;&#x8981;&#x8FDB;&#x884C;&#x589E;&#x52A0;&#x8FD9;&#x4E2A;&#x72B6;&#x6001;&#xFF0C;&#x6240;&#x4EE5; i &#x5C31;&#x50CF;&#x8868;&#x793A;&#x662F;&#x5426;&#x8981;&#x8FDB;&#x884C;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#xFF0C;g &#x8868;&#x793A;&#x6211;&#x4EEC;&#x8981;&#x589E;&#x52A0;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x901A;&#x8FC7;&#x5206;&#x79BB;&#x8FD9;&#x4E24;&#x4E2A;&#x53C2;&#x6570; LSTM &#x7684;&#x8BAD;&#x7EC3;&#x6548;&#x679C;&#x4F1A;&#x66F4;&#x597D;&#x3002;</p>
<p>&#x597D;&#x7684;&#x63A5;&#x4E0B;&#x6765;&#x6765;&#x770B;&#x4E0B;&#x9762;&#x90E8;&#x5206;&#x7684;&#x516C;&#x5F0F;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x5B83;&#x770B;&#x505A;&#x7EC6;&#x80DE;&#x6D41;&#x8FC7;&#xFF0C;<strong>&#x7B2C;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x662F; f &#x4E58;&#x4EE5; c</strong>&#xFF0C;f &#x662F; sigmoid &#x51FD;&#x6570;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x82E5; f &#x4E3A; 0&#xFF0C;&#x4F60;&#x5C06;&#x4F1A;&#x5173;&#x95ED;&#x7EC6;&#x80DE;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x8BA1;&#x6570;&#x5668;&#x91CD;&#x7F6E;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;</p>
<p><img src="/2017/11/02/LSTM/7.png" alt=""></p>
<p>&#x8FD9;&#x90E8;&#x5206;&#x662F; g&#xFF0C;&#x4ED6;&#x57FA;&#x672C;&#x662F;&#x52A0;&#x5230;&#x7EC6;&#x80DE;&#x72B6;&#x6001;&#xFF08;cell state&#xFF09;&#x91CC;&#x7684;&#xFF0C;&#x7136;&#x540E;&#x7EC6;&#x80DE;&#x72B6;&#x6001;&#x4E00;&#x90E8;&#x5206;&#x8FDB;&#x5165;&#x9690;&#x85CF;&#x72B6;&#x6001;&#xFF08;hidden state&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x4ED6;&#x8981;&#x5148;&#x7ECF;&#x8FC7; tanh &#x51FD;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x7ECF;&#x8FC7; o &#x53C2;&#x6570;&#x8C03;&#x6574;&#xFF0C;&#x7531;&#x6B64;&#x53EF;&#x89C1;&#xFF0C;o &#x5411;&#x91CF;&#x53EF;&#x4EE5;&#x51B3;&#x5B9A;&#x7EC6;&#x80DE;&#x72B6;&#x6001;&#x90A3;&#x4E00;&#x90E8;&#x5206;&#x8FDB;&#x5165;&#x9690;&#x85CF;&#x72B6;&#x6001;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x9690;&#x85CF;&#x72B6;&#x6001;&#x4E0D;&#x4EC5;&#x8FDB;&#x5165;&#x4E86; LSTM &#x7684;&#x4E0B;&#x4E00;&#x6B21;&#x8FED;&#x4EE3;&#x8FD0;&#x7B97;&#xFF0C;&#x8FD8;&#x4F1A;&#x4E0A;&#x6D6E;&#x5230;&#x66F4;&#x9AD8;&#x5C42;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x9690;&#x85CF;&#x72B6;&#x6001;&#x5411;&#x91CF;&#x8981;&#x63A5;&#x901A;&#x4E0A;&#x9762;&#x66F4;&#x8FDC;&#x7684; LSTM &#x7F51;&#x7EDC;&#x6216;&#x8005;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x9884;&#x6D4B;&#x3002;</p>
<p><img src="/2017/11/02/LSTM/8.png" alt=""></p>
<p>&#x6240;&#x4EE5;&#x5F53;&#x4F60;&#x5C55;&#x5F00;&#x7684;&#x65F6;&#x5019;&#x4ED6;&#x662F;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#xFF0C;&#x4ECE;&#x4E0B;&#x9762;&#x5F97;&#x5230;&#x8F93;&#x5165;&#xFF0C;&#x4ECE;&#x524D;&#x9762;&#x5F97;&#x5230;&#x9690;&#x85CF;&#x72B6;&#x6001;&#xFF0C;x &#x548C; h &#x51B3;&#x5B9A;&#x4E86;&#x4F60;&#x7684;&#x8FD0;&#x7B97;&#x95E8; f, i, g&#x548C;o&#xFF0C;&#x4ED6;&#x4EEC;&#x90FD;&#x662F; n &#x7EF4;&#x7684;&#x5411;&#x91CF;&#xFF0C;&#x6700;&#x540E;&#x5BF9;&#x7EC6;&#x80DE;&#x72B6;&#x6001;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5BF9;&#x5B83;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x91CD;&#x7F6E;&#x64CD;&#x4F5C;&#xFF0C;&#x4E00;&#x6B21;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A; -1 &#x5230; 1 &#x4E4B;&#x95F4;&#x7684;&#x503C;&#xFF0C;&#x4E00;&#x90E8;&#x5206;&#x7EC6;&#x80DE;&#x72B6;&#x6001;&#x4F1A;&#x4EE5;&#x5B66;&#x4E60;&#x7684;&#x65B9;&#x5F0F;&#x91CA;&#x653E;&#xFF0C;&#x4ED6;&#x53EF;&#x4EE5;&#x5411;&#x4E0A;&#x53BB;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5411;&#x524D;&#x8FDB;&#x5165; LSTM &#x7684;&#x4E0B;&#x4E00;&#x6B21;&#x8FED;&#x4EE3;&#x3002;</p>
<p><img src="/2017/11/02/LSTM/9.png" alt=""></p>
<p>&#x4E0B;&#x9762;&#x5C55;&#x793A;&#x7684;&#x5C31;&#x662F; LSTM &#x6B63;&#x5E38;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;</p>
<p><img src="/2017/11/02/LSTM/10.png" alt=""></p>
<h2 id="LSTM-&#x4E3A;&#x4EC0;&#x4E48;&#x6548;&#x679C;&#x6BD4;-RNN-&#x597D;&#xFF1F;"><a href="#LSTM-&#x4E3A;&#x4EC0;&#x4E48;&#x6548;&#x679C;&#x6BD4;-RNN-&#x597D;&#xFF1F;" class="headerlink" title="LSTM &#x4E3A;&#x4EC0;&#x4E48;&#x6548;&#x679C;&#x6BD4; RNN &#x597D;&#xFF1F;"></a>LSTM &#x4E3A;&#x4EC0;&#x4E48;&#x6548;&#x679C;&#x6BD4; RNN &#x597D;&#xFF1F;</h2><p>RNN &#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x72B6;&#x6001;&#x5411;&#x91CF;&#xFF0C;&#x4F60;&#x8981;&#x5BF9;&#x4ED6;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x901A;&#x8FC7;&#x9012;&#x5F52;&#x516C;&#x5F0F;&#x8FDB;&#x884C;&#x8F6C;&#x6362;&#xFF0C;&#x6700;&#x540E;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x4E0D;&#x65AD;&#x66F4;&#x65B0;&#x4F60;&#x7684;&#x9690;&#x85CF;&#x72B6;&#x6001;&#x5411;&#x91CF;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x5728; LSTM &#x4E2D;&#xFF0C;&#x8FD9;&#x4E9B;&#x7EC6;&#x80DE;&#x72B6;&#x6001;&#x8FDB;&#x5165;&#x7F51;&#x7EDC;&#xFF0C;&#x5E76;&#x4E14;&#x90E8;&#x5206;&#x7EC6;&#x80DE;&#x8FDB;&#x5165;&#x9690;&#x85CF;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6839;&#x636E;&#x9690;&#x85CF;&#x72B6;&#x6001;&#x51B3;&#x5B9A;&#x5982;&#x4F55;&#x5BF9;&#x7EC6;&#x80DE;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x3002;&#x5982;&#x679C;<strong>&#x5FFD;&#x7565;&#x5FD8;&#x8BB0;&#x95E8;</strong>&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x53EA;&#x662F;&#x5BF9;&#x7EC6;&#x80DE;&#x8FDB;&#x884C;&#x52A0;&#x6CD5;&#x8FED;&#x4EE3;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x6709;&#x4E00;&#x4E9B;&#x64CD;&#x4F5C;&#x53EF;&#x4EE5;&#x770B;&#x505A;&#x662F;&#x7EC6;&#x80DE;&#x72B6;&#x6001;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x4F46;&#x4E0D;&#x7BA1;&#x4ED6;&#x4EEC;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x6211;&#x4EEC;&#x6700;&#x540E;&#x90FD;&#x662F;&#x6211;&#x4EEC;&#x90FD;&#x662F;&#x95F4;&#x63A5;&#x7684;&#x6539;&#x53D8;&#x7EC6;&#x80DE;&#x72B6;&#x6001;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x5BF9;&#x4ED6;&#x8FDB;&#x884C;&#x53D8;&#x6362;&#xFF0C;&#x540C;&#x65F6;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x4F9D;&#x8D56;&#x4E8E;&#x52A0;&#x6CD5;&#x7684;&#x4E0D;&#x65AD;&#x7684;&#x8BA1;&#x7B97;&#x3002;</p>
<p><img src="/2017/11/02/LSTM/11.png" alt=""></p>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#x4ED6;&#x548C; ResNet &#x6709;&#x4E9B;&#x76F8;&#x4F3C;&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#x7528;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8FDB;&#x884C;&#x8F6C;&#x6362;&#x8BCD;&#x4E49;&#xFF0C;ResNet &#x52A0;&#x5165;&#x4E86;&#x8FD9;&#x4E9B;&#x8DF3;&#x8DC3;&#x7684;&#x94FE;&#x63A5;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x6B8B;&#x5DEE;&#x6709;&#x52A0;&#x6CD5;&#x64CD;&#x4F5C;&#xFF0C;&#x5373; x&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x57FA;&#x4E8E; x &#x8FDB;&#x884C;&#x8FD9;&#x4E9B;&#x8BA1;&#x7B97;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x52A0;&#x4E0A; x&#xFF0C;&#x8FD9;&#x4E9B;&#x662F;ResNet &#x4E2D;&#x7684;&#x57FA;&#x672C;&#x6A21;&#x5757;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x8FD9;&#x4E5F;&#x662F; LSTM &#x4E2D;&#x7684;&#x8FD0;&#x7B97;&#x65B9;&#x5F0F;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x8FD9;&#x4E9B;&#x52A0;&#x6CD5;&#x64CD;&#x4F5C;&#xFF0C;&#x5176;&#x4E2D;&#x7684; x &#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x7684;&#x7EC6;&#x80DE;&#xFF0C;&#x6211;&#x4EEC;&#x8FDB;&#x884C;&#x4E86;&#x4E00;&#x4E9B;&#x51FD;&#x6570;&#x8FD0;&#x7B97;&#xFF0C;&#x7136;&#x540E;&#x9009;&#x62E9;&#x52A0;&#x5230;&#x4F60;&#x7684;&#x7EC6;&#x80DE;&#x72B6;&#x6001;&#x4E2D;&#x4F46;&#x662F; LSTM &#x4E0E; ResNet &#x4E0D;&#x540C;&#xFF0C;&#x8FD8;&#x6709;&#x8FD9;&#x4E9B;&#x5FD8;&#x8BB0;&#x95E8;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x5173;&#x95ED;&#x4E00;&#x90E8;&#x5206;&#x4FE1;&#x53F7;&#x3002;</p>
<pre><code>&#x770B;&#x8D77;&#x6765;&#x62E5;&#x6709;&#x52A0;&#x6CD5;&#x64CD;&#x4F5C;&#x4F1A;&#x4F7F;&#x7F51;&#x7EDC;&#x53D8;&#x5F97;&#x66F4;&#x597D;&#xFF0C;&#x8FD9;&#x80FD;&#x4F7F;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x66F4;&#x52A0;&#x9AD8;&#x6548;&#x3002;
</code></pre><h2 id="&#x4E3A;&#x4F55;-RNN-&#x5B58;&#x5728;&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#x7684;&#x95EE;&#x9898;&#xFF1F;"><a href="#&#x4E3A;&#x4F55;-RNN-&#x5B58;&#x5728;&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#x7684;&#x95EE;&#x9898;&#xFF1F;" class="headerlink" title="&#x4E3A;&#x4F55; RNN &#x5B58;&#x5728;&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#x7684;&#x95EE;&#x9898;&#xFF1F;"></a>&#x4E3A;&#x4F55; RNN &#x5B58;&#x5728;&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#x7684;&#x95EE;&#x9898;&#xFF1F;</h2><p>&#x6765;&#x8003;&#x8651;&#x4E00;&#x4E0B; RNN &#x548C; LSTM &#x4E2D;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x7684;&#x52A8;&#x6001;&#x7279;&#x6027;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5728; LSTM &#x4E2D;&#x3002;&#x5982;&#x679C;&#x5728;&#x67D0;&#x4E9B;&#x65F6;&#x95F4;&#x4E2D;&#x8BF8;&#x5982;&#x4E00;&#x4E9B;&#x68AF;&#x5EA6;&#x4FE1;&#x53F7;&#x5C06;&#x4F1A;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x6E05;&#x695A;&#x3002;&#x5982;&#x679C;&#x6211;&#x5728;&#x4E0A;&#x5F20;&#x56FE;&#x7247;&#x7684;&#x6700;&#x540E;&#x6CE8;&#x5165;&#x68AF;&#x5EA6;&#x51FD;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x8FD9;&#x4E9B;&#x52A0;&#x6CD5;&#x64CD;&#x4F5C;&#x5C31;&#x50CF;&#x662F;&#x68AF;&#x5EA6;&#x7684;&#x9AD8;&#x901F;&#x516C;&#x8DEF;&#xFF0C;&#x8FD9;&#x4E9B;&#x68AF;&#x5EA6;&#x4F1A;&#x7ECF;&#x8FC7;&#x8FD9;&#x4E9B;&#x52A0;&#x6CD5;&#x95E8;&#x3002;&#x56E0;&#x4E3A;&#x52A0;&#x6CD5;&#x76F8;&#x7B49;&#x7684;&#x5206;&#x914D;&#x68AF;&#x5EA6;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x6211;&#x5728;&#x8FD9;&#x63A5;&#x5165;&#x68AF;&#x5EA6;&#xFF0C;&#x4ED6;&#x4F1A;&#x6CBF;&#x7740;&#x7F51;&#x7EDC;&#x4F20;&#x9012;&#x3002;&#x5F53;&#x7136;&#x68AF;&#x5EA6;&#x4E5F;&#x4F1A;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B; f&#xFF0C;&#x8FD9;&#x4E9B;&#x6709;&#x52A9;&#x4E8E;&#x68AF;&#x5EA6;&#x56DE;&#x5230;&#x68AF;&#x5EA6;&#x6D41;&#xFF0C;&#x8FD9;&#x6837;&#x4F7F;&#x4F60;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x9047;&#x5230;RNN&#x4E2D;&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x5728; RNN &#x91CC;&#x8FD9;&#x4E9B;&#x68AF;&#x5EA6;&#x4F1A;&#x5728;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x4E2D;&#x6B7B;&#x4EA1;&#x53D8;&#x6210; 0&#x3002;&#x5728; LSTM &#x4E2D;&#xFF0C;&#x7531;&#x4E8E;&#x52A0;&#x6CD5;&#x9AD8;&#x901F;&#x516C;&#x8DEF;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x95F4;&#x5185;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x4E0A;&#x9762;&#x6CE8;&#x5165; LSTM &#x7684;&#x68AF;&#x5EA6;&#xFF0C;&#x90FD;&#x4F1A;&#x6D41;&#x8FC7;&#x7EC6;&#x80DE;&#xFF0C;&#x4E0D;&#x4F1A;&#x6D88;&#x5931;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div><div class="line">17</div><div class="line">18</div></pre></td><td class="code"><pre><div class="line">H = 5	# dimensionality of hidden state</div><div class="line">T = 50	# number of time steps</div><div class="line">Whh = np.random.randn(H, H)</div><div class="line"></div><div class="line"># forward pass of an RNN (ignoring inputs x)</div><div class="line">hs = {}</div><div class="line">ss = {}</div><div class="line">hs[-1] = np.random.randn(H)</div><div class="line">for t in xrange(T):</div><div class="line">	ss[t] = np.dot(Whh, hs[t - 1])</div><div class="line">	hs[t] = np.maxinum(0, ss[t])</div><div class="line">	</div><div class="line"># backward pass of the RNN</div><div class="line">dhs = {}</div><div class="line">dss = {}</div><div class="line">dhs[T-1] = np.random.randn(H) 	# start off the chain with random gradient</div><div class="line">for t in reversed(xrange(T)):</div><div class="line">	dss[T] = (hs[t] &gt; 0) * dhs[t]		# back through the nonlinearity	dhs[t-1] = np.dot(Whh.T, dss[t])	# backprop into previous hidden state</div></pre></td></tr></table></figure>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5173;&#x4E8E;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x6211;&#x4EEC;&#x4E0D;&#x7BA1;&#x8FD9;&#x4E9B;&#x8F93;&#x5165;&#xFF0C;&#x53EA;&#x770B;&#x9690;&#x85CF;&#x72B6;&#x6001;&#x7684;&#x66F4;&#x65B0;&#x90E8;&#x5206;&#x3002;&#x6240;&#x4EE5;&#x8981;&#x6700;&#x5C0F;&#x5316;&#x6743;&#x503C; Whh&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x9690;&#x85CF;&#x72B6;&#x6001;&#x3002;&#x73B0;&#x5728;&#x8981;&#x5BF9;&#x8FD9;&#x4E2A; vanilla RNN &#x8FDB;&#x884C;&#x5411;&#x524D;&#x4F20;&#x64AD;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x7684;&#x65F6;&#x95F4;&#x957F;&#x5EA6; T &#x8BBE;&#x4E3A; 50&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x7528; Whh &#x4E58;&#x524D;&#x4E00;&#x65F6;&#x95F4;&#x957F;&#x5EA6;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x7528; ReLU &#x51FD;&#x6570;&#x6765;&#x8BA1;&#x7B97;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x5FFD;&#x7565;&#x6240;&#x6709;&#x8F93;&#x5165;&#x5411;&#x91CF;&#x7684;&#x524D;&#x5411;&#x4F20;&#x64AD;&#xFF0C;&#x5373;&#x7528; Whh &#x4E58;&#x4EE5; h &#x7136;&#x540E;&#x548C; 0 &#x6BD4;&#x5927;&#x5C0F;&#xFF0C;&#x518D;&#x4E58;&#x4EE5; h &#x518D;&#x6BD4;&#x5927;&#x5C0F;&#xFF0C;&#x5FAA;&#x73AF;&#x5F80;&#x590D;&#x3002;</p>
<p>&#x63A5;&#x7740;&#x8981;&#x8FDB;&#x884C;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#xFF0C;&#x5728;&#x6700;&#x540E;&#x4E00;&#x6B65;&#x65F6;&#x5728;&#x8FD9;&#x91CC;&#x63D2;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x7684;&#x68AF;&#x5EA6;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5728;&#x7B2C; 50 &#x65F6;&#x95F4;&#x957F;&#x5EA6;&#x63D2;&#x5165;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x7684;&#x68AF;&#x5EA6;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x505A;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x3002;&#x5728;&#x8FDB;&#x884C;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x65F6;&#x8981;&#x7528;&#x5230; ReLU &#x51FD;&#x6570;&#xFF0C;&#x5148;&#x7528; Whh &#x8FDB;&#x884C;&#x4E58;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7; ReLU &#x51FD;&#x6570;&#xFF0C;&#x518D;&#x8FDB;&#x884C;&#x4E58;&#x6CD5;&#x518D;&#x901A;&#x8FC7; ReLU&#x3002;&#x6709;&#x4EF6;&#x4E8B;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x4E00;&#x4E0B;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x518D;&#x505A;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x7684;&#x65F6;&#x5019;&#x7528;&#x5230;&#x4E86; ReLU&#xFF0C;&#x5BF9;&#x6240;&#x6709;&#x8F93;&#x5165;&#x503C;&#x53BB;&#x9608;&#x503C;&#xFF0C;&#x4E22;&#x6389;&#x6240;&#x6709;&#x5C0F;&#x4E8E; 0 &#x7684;&#x6570;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x5BF9; Whh &#x4E58;&#x4EE5; h &#x8FD0;&#x7B97;&#x7B26;&#x8FDB;&#x884C;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x6211;&#x4EEC;&#x5C31;&#x662F;&#x5728;&#x8FDB;&#x884C;&#x975E;&#x7EBF;&#x6027;&#x53D8;&#x6362;&#x4E4B;&#x524D;&#x4E58;&#x4E0A; Whh &#x77E9;&#x9635;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5728;&#x8FD0;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4E00;&#x904D;&#x53C8;&#x4E00;&#x904D;&#x7684;&#x4E58;&#x4EE5; Whh &#x8FD9;&#x4E2A;&#x77E9;&#x9635;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x5411;&#x524D;&#x4F20;&#x64AD;&#x4E2D;&#x6211;&#x4EEC;&#x6BCF;&#x4E00;&#x6B21;&#x5FAA;&#x73AF;&#x4E2D;&#x90FD;&#x4E58;&#x4E86; Whh&#xFF0C;&#x5E76;&#x4E14;&#x5BF9;&#x6240;&#x6709;&#x7684;&#x9690;&#x85CF;&#x72B6;&#x6001;&#x8FDB;&#x884C;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#xFF0C;&#x6700;&#x540E;&#x4E00;&#x516C;&#x5F0F; Whh &#x4E58;&#x4EE5; hs &#x7ED3;&#x675F;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#x4F60;&#x7684;&#x68AF;&#x5EA6;&#x548C; Whh &#x77E9;&#x9635;&#x76F8;&#x4E58;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x4ED6;&#x4EEC;&#x4F7F;&#x7528; ReLU&#xFF0C;&#x518D;&#x4E58;&#x4EE5; Whh &#x518D;&#x8FD0;&#x884C; RelU&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x4E58;&#x4E86;&#x8FD9;&#x4E2A;&#x77E9;&#x9635; 50 &#x6B21;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x4ED6;&#x53EF;&#x80FD;&#x4F1A;&#x4EA7;&#x751F;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x9996;&#x5148;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x6807;&#x91CF;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x77E9;&#x9635;&#xFF0C;&#x4F8B;&#x5982;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x5F97;&#x5230;&#x4E86;&#x7B2C;&#x4E8C;&#x4E2A;&#x6570;&#xFF0C;&#x6211;&#x4E0D;&#x505C;&#x7684;&#x7528;&#x7B2C;&#x4E8C;&#x4E2A;&#x6570;&#x53BB;&#x4E58;&#x4EE5;&#x7B2C;&#x4E00;&#x4E2A;&#x6570;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x5E8F;&#x5217;&#x4F1A;&#x53D8;&#x6210;&#x4EC0;&#x4E48;&#x6837;&#xFF1F;&#x6709;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x4E0D;&#x505C;&#x7684;&#x7528;&#x540C;&#x4E00;&#x4E2A;&#x6570;&#x53BB;&#x4E58;&#x4ED6;&#xFF0C;&#x4E0D;&#x7BA1;&#x4ED6;&#x662F; 0 &#x8FD8;&#x662F;&#x65E0;&#x9650;&#xFF0C;&#x5F53;&#x7136;&#x5982;&#x679C;&#x7B2C;&#x4E8C;&#x4E2A;&#x6570;&#x662F; 1&#xFF0C;&#x8FD9;&#x662F;&#x552F;&#x4E00;&#x4E00;&#x79CD;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x7206;&#x70B8;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5426;&#x5219;&#x4E0D;&#x7BA1;&#x662F;&#x6D88;&#x5931;&#x8FD8;&#x662F;&#x7206;&#x70B8;&#xFF0C;&#x90FD;&#x5C06;&#x662F;&#x5F88;&#x7CDF;&#x7CD5;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x867D;&#x7136;&#x8FD9;&#x91CC;&#x662F;&#x77E9;&#x9635;&#x800C;&#x4E0D;&#x662F;&#x6570;&#xFF0C;&#x4F46;&#x662F;&#x5B9E;&#x9645;&#x4E0A;&#x4ED6;&#x7684;&#x6CDB;&#x5316;&#x4E5F;&#x4F1A;&#x53D1;&#x751F;&#x8FD9;&#x6837;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x5982;&#x679C; Whh &#x77E9;&#x9635;&#x7684;&#x8C31;&#x534A;&#x5F84;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x77E9;&#x9635;&#x7684;&#x6700;&#x5927;&#x7279;&#x5F81;&#x503C;&#x8981;&#x6BD4;1&#x5927;&#x5F88;&#x591A;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4F1A;&#x7206;&#x70B8;&#xFF1B;&#x5982;&#x679C;&#x5C0F;&#x4E8E; 1&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4F1A;&#x6D88;&#x5931;&#x3002;<strong>&#x56E0;&#x4E3A; RNN &#x7684;&#x8FD9;&#x4E2A;&#x5FAA;&#x73AF;&#x7684;&#x8BA1;&#x7B97;&#xFF0C;&#x4F7F;&#x5F97;&#x5B83;&#x51FA;&#x73B0;&#x4E86;&#x8FD9;&#x4E9B;&#x5F88;&#x7CDF;&#x7CD5;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5B83;&#x975E;&#x5E38;&#x4E0D;&#x7A33;&#x5B9A;&#x6709;&#x65F6;&#x5019;&#x751A;&#x81F3;&#x4F1A;&#x5BFC;&#x81F4;&#x6D88;&#x5931;&#x6216;&#x8005;&#x7206;&#x70B8;&#x3002;</strong></p>
<p>&#x6240;&#x4EE5;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x91C7;&#x53D6;&#x4E00;&#x70B9;&#x5C0F;&#x6280;&#x5DE7;&#x6765;&#x63A7;&#x5236;&#x68AF;&#x5EA6;&#x7206;&#x70B8;&#xFF0C;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x4ED6;&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x4E0D;&#x5B8C;&#x6574;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x6BD4;&#x5982;&#x4F60;&#x61C2;&#x5F97;&#x68AF;&#x5EA6;&#x662F;&#x5927;&#x4E8E; 5 &#x7684;&#xFF0C;&#x90A3;&#x5C31;&#x5C06;&#x5143;&#x7D20;&#x5168;&#x90E8;&#x88C1;&#x526A;&#x4E3A; 5&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x53EB;&#x505A;<strong>&#x68AF;&#x5EA6;&#x88C1;&#x526A;</strong>&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x89E3;&#x51B3;&#x68AF;&#x5EA6;&#x7206;&#x70B8;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x7684;&#x5FAA;&#x73AF;&#x5C31;&#x4E0D;&#x4F1A;&#x5728;&#x53D1;&#x751F;&#x7206;&#x70B8;&#x4E86;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5728;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x4ECD;&#x7136;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x800C; LSTM &#x80FD;&#x5F88;&#x597D;&#x7684;&#x6291;&#x5236;&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x9AD8;&#x901F;&#x516C;&#x8DEF;&#x7684;&#x7EC6;&#x80DE;&#x72B6;&#x6001;&#x53EA;&#x6539;&#x53D8;&#x4E86;&#x52A0;&#x6CD5;&#x8FD0;&#x7B97;&#xFF0C;&#x4ED6;&#x7684;&#x68AF;&#x5EA6;&#x4F1A;&#x88AB;&#x4E00;&#x76F4;&#x4F20;&#x4E0B;&#x53BB;&#xFF0C;&#x4E0D;&#x4F1A;&#x6D88;&#x5931;&#x3002;</p>
<p>&#x8FD9;&#x5927;&#x81F4;&#x89E3;&#x91CA;&#x4E86;&#x4E3A;&#x4EC0;&#x4E48;&#x4ED6;&#x7684;&#x5DE5;&#x4F5C;&#x6548;&#x679C;&#x4F1A;&#x66F4;&#x597D;&#x3002;&#x901A;&#x5E38;&#x6211;&#x4EEC;&#x4F1A;&#x4F7F;&#x7528; LSTM&#xFF0C;&#x4E5F;&#x4F1A;&#x4F7F;&#x7528;&#x68AF;&#x5EA6;&#x88C1;&#x526A;&#xFF0C;&#x56E0;&#x4E3A; LSTM &#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x68AF;&#x5EA6;&#x7206;&#x70B8;&#xFF0C;&#x4F46;&#x5B83;&#x4E00;&#x822C;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#x3002;</p>
<h2 id="Summary"><a href="#Summary" class="headerlink" title="Summary"></a>Summary</h2><p>&#x9996;&#x5148; RNN &#x662F;&#x5F88;&#x4E0D;&#x9519;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x53EA;&#x7528; RNN &#x4E8B;&#x5B9E;&#x4E0A;&#x5DE5;&#x4F5C;&#x7684;&#x4E0D;&#x662F;&#x5F88;&#x597D;&#xFF0C;&#x6240;&#x4EE5;&#x901A;&#x5E38;&#x4F7F;&#x7528; LSTM &#x6765;&#x4EE3;&#x66FF;&#xFF0C;&#x4ED6;&#x4EEC;&#x6700;&#x597D;&#x7684;&#x5730;&#x65B9;&#x662F;&#x4ED6;&#x4EEC;&#x7684;&#x52A0;&#x6CD5;&#x8BA1;&#x7B97;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x68AF;&#x5EA6;&#x4F20;&#x64AD;&#x5DE5;&#x4F5C;&#x7684;&#x66F4;&#x597D;&#xFF0C;&#x5E76;&#x4E14;&#x4E5F;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#x7684;&#x95EE;&#x9898;.</p>

      
    </div><!-- .entry-content -->

    <footer class="entry-meta">
    <a href="/2017/11/02/LSTM/">
    <time datetime="2017-11-01T17:32:49.000Z" class="entry-date">
        2017-11-02
    </time>
</a>
    
  <span class="article-delim">&#8226;</span>
  <div class="article-category">
  <a class="article-category-link" href="/categories/ML/">ML</a>
  </div>

    
  <span class="article-delim">&#8226;</span>
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/Neural-Networks/">Neural Networks</a></li></ul>

    </footer>
</article>


    
<nav class="nav-single">
    <h3 class="assistive-text">文章导航</h3>
    
        <span class="nav-previous"><a href="/2017/11/17/如何在Xcode中添加-bits-stdc-h-头文件/" rel="prev"><span class="meta-nav">←</span> 如何在Xcode中添加&lt;bits/stdc++.h&gt;头文件</a></span>
    
    
        <span class="nav-next"><a href="/2017/11/01/循环神经网络-RNN/" rel="next">循环神经网络_RNN <span class="meta-nav">→</span></a></span>
    
</nav><!-- .nav-single -->







</div></div>
        <div id="secondary" class="widget-area" role="complementary">
  
    <aside id="search" class="widget widget_search"><form role="search" method="get" accept-charset="utf-8" id="searchform" class="searchform" action="//google.com/search">
    <div>
        <input type="text" value="" name="s" id="s" />
        <input type="submit" id="searchsubmit" value="搜索" />
    </div>
</form></aside>
  
    
  
    
  <aside class="widget">
    <h3 class="widget-title">Categories</h3>
    <div class="widget-content">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/LIFE/">LIFE</a><span class="category-list-count">3</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/MAC/">MAC</a><span class="category-list-count">3</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/ML/">ML</a><span class="category-list-count">26</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/PGM/">PGM</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/iOS/">iOS</a><span class="category-list-count">19</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/御宅文化/">御宅文化</a><span class="category-list-count">2</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/算法/">算法</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/编程/">编程</a><span class="category-list-count">35</span></li></ul>
    </div>
  </aside>

  
    
<div class="widget tag">
<h3 class="title">blogroll</h3>
<ul class="entry">


<li><a href="https://github.com/" target="_blank">我的github</a></li>


<li><a href="http://www.jianshu.com/users/41cd7711ed44/latest_articles" target="_blank">我的简书主页</a></li>


<li><a href="http://uuzdaisuki.com" target="_blank">leticia’s blog</a></li>


<li><a href="http://www.helloyzy.cn" target="_blank">acery</a></li>


<li><a href="http://wxjackie.com" target="_blank">WXJACKIE</a></li>


<li><a href="http://www.stephenzhang.me" target="_blank">stephenzhang</a></li>


<li><a href="blog.keybrl.com" target="_blank">keybrl</a></li>


<li><a href="http://blog.ciaran.cn" target="_blank">Ciaran</a></li>


<li><a href="http://1.dev.blog.qinka.pro" target="_blank">Qinka</a></li>


<li><a href="http://tobiasLee.top" target="_blank">TobiasLee</a></li>


<li><a href="http://blog.boileryao.com" target="_blank">bingo</a></li>

</ul>
</div>

  
    
  <aside class="widget">
    <h3 class="widget-title">Recents</h3>
    <div class="widget-content">
      <ul>
        
          <li>
            <a href="/2017/12/17/FastRCNN-FasterRCNN/">谈一谈 Fast R-CNN 和 Faster R-CNN</a>
          </li>
        
          <li>
            <a href="/2017/11/17/如何在Xcode中添加-bits-stdc-h-头文件/">如何在Xcode中添加&lt;bits/stdc++.h&gt;头文件</a>
          </li>
        
          <li>
            <a href="/2017/11/02/LSTM/">RNN 与 LSTM</a>
          </li>
        
          <li>
            <a href="/2017/11/01/循环神经网络-RNN/">循环神经网络_RNN</a>
          </li>
        
          <li>
            <a href="/2017/10/31/CNN之定位检测/">卷积神经网络之定位检测</a>
          </li>
        
      </ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Tags</h3>
    <div class="widget-content">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/Cloud-Computing/">Cloud Computing</a><span class="tag-list-count">3</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Cocoapods/">Cocoapods</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Linux/">Linux</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Machine-Learning/">Machine Learning</a><span class="tag-list-count">17</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Matlab/">Matlab</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Neural-Networks/">Neural Networks</a><span class="tag-list-count">6</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Probabilistic-Graphical-Models/">Probabilistic Graphical Models</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIColor/">UIColor</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView/">UIView</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView-圆角/">UIView-圆角</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Vim/">Vim</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/bug/">bug</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/hexo/">hexo</a><span class="tag-list-count">4</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/openCV/">openCV</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/二维码/">二维码</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/指针/">指针</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/操作系统/">操作系统</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/数据结构/">数据结构</a><span class="tag-list-count">19</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/算法/">算法</a><span class="tag-list-count">8</span></li></ul>
    </div>
  </aside>

  
</div>
      </div>
      <footer id="colophon" role="contentinfo">
    <p>&copy; 2018 SaberDa
    All rights reserved.</p>
    <p>Powered by <a href="http://hexo.io/" target="_blank">Hexo</a></p>
</footer>
    <script>window._bd_share_config={"common":{"bdSnsKey":{},"bdText":"","bdMini":"1","bdMiniList":false,"bdPic":"","bdStyle":"2","bdSize":"16"},"share":{}};with(document)0[(getElementsByTagName('head')[0]||body).appendChild(createElement('script')).src='http://bdimg.share.baidu.com/static/api/js/share.js?v=89860593.js?cdnversion='+~(-new Date()/36e5)];</script>

<script src="/js/jquery-2.0.3.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

<script src="/js/navigation.js"></script>

<div id="bg"></div>

  </div>
</body>
</html>