<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  
  <meta name="description" content="阿尔托利亚是我老婆~" />
  

  
  
  
  
  
  
  <title>支持向量机与核函数 | SaberDa的幻想乡</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x652F;&amp;#x6301;&amp;#x5411;&amp;#x91CF;&amp;#x673A;&amp;#xFF0C;support vector machines&amp;#xFF0C;&amp;#x7B80;&amp;#x79F0;SVM&amp;#x3002;&amp;#x4E00;&amp;#x4E0B;&amp;#x5168;&amp;#x6587;&amp;#x57FA;&amp;#x672C;&amp;#x90FD;&amp;#x662F;&amp;#x7528;SVM&amp;#x4E00;&amp;#x8BCD;&amp;#x">
<meta property="og:type" content="article">
<meta property="og:title" content="支持向量机与核函数">
<meta property="og:url" content="https://saberda.github.io/2017/04/17/支持向量机/index.html">
<meta property="og:site_name" content="SaberDa的幻想乡">
<meta property="og:description" content="&amp;#x652F;&amp;#x6301;&amp;#x5411;&amp;#x91CF;&amp;#x673A;&amp;#xFF0C;support vector machines&amp;#xFF0C;&amp;#x7B80;&amp;#x79F0;SVM&amp;#x3002;&amp;#x4E00;&amp;#x4E0B;&amp;#x5168;&amp;#x6587;&amp;#x57FA;&amp;#x672C;&amp;#x90FD;&amp;#x662F;&amp;#x7528;SVM&amp;#x4E00;&amp;#x8BCD;&amp;#x">
<meta property="og:updated_time" content="2017-04-17T13:32:22.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="支持向量机与核函数">
<meta name="twitter:description" content="&amp;#x652F;&amp;#x6301;&amp;#x5411;&amp;#x91CF;&amp;#x673A;&amp;#xFF0C;support vector machines&amp;#xFF0C;&amp;#x7B80;&amp;#x79F0;SVM&amp;#x3002;&amp;#x4E00;&amp;#x4E0B;&amp;#x5168;&amp;#x6587;&amp;#x57FA;&amp;#x672C;&amp;#x90FD;&amp;#x662F;&amp;#x7528;SVM&amp;#x4E00;&amp;#x8BCD;&amp;#x">
  
  
    <link rel="icon" href="/css/images/favicon.ico">
  
  <link rel="stylesheet" href="/css/style.css">
  

  
  <!-- baidu webmaster push -->
  <script src='//push.zhanzhang.baidu.com/push.js'></script>
</head>
<body class="home blog custom-background custom-font-enabled single-author">
  <div id="page" class="hfeed site">
      <header id="masthead" class="site-header" role="banner">
    <hgroup>
      <h1 class="site-title">
        <a href="/" title="SaberDa的幻想乡" rel="home">SaberDa的幻想乡</a>
      </h1>
      
        <h2 class="site-description">
          <a href="/" id="subtitle">　　iOS/ ML　　|　　二次元　　|　　saberda@qq.com　　|　　虽则如云，匪我思存</a>
        </h2>
      
    </hgroup>

    <nav id="site-navigation" class="main-navigation" role="navigation">
            <button class="menu-toggle">菜单</button>
            <a class="assistive-text" href="/#content" title="跳至内容">跳至内容</a><!--TODO-->
            <div class="menu-main-container">
                <ul id="menu-main" class="nav-menu">
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/archives">所有文章</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/">主页</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/编程/">编程</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/iOS/">iOS</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/ML/">ML</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/PGM/">PGM</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/MAC/">MAC</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/御宅文化/">御宅文化</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/LIFE/">LIFE</a></li>
                
                </ul>
            </div>
    </nav>
</header>
      <div id="main" class="wrapper">
        <div id="primary" class="site-content"><div id="content" role="main"><article id="post-支持向量机" class="post-支持向量机 post type-post status-publish format-standard hentry">
    <!---->

      <header class="entry-header">
        
        
  
    <h1 class="entry-title article-title">
      支持向量机与核函数
    </h1>
  

        
        <div class="comments-link">
            
            <a href="javascript:void(0);" data-url="https://saberda.github.io/2017/04/17/支持向量机/" data-id="cj8onfzo00070fib3mtx3gake" class="leave-reply bdsharebuttonbox" data-cmd="more">Share</a>
        </div><!-- .comments-link -->
      </header><!-- .entry-header -->

    <div class="entry-content">
      
        <p>&#x652F;&#x6301;&#x5411;&#x91CF;&#x673A;&#xFF0C;support vector machines&#xFF0C;&#x7B80;&#x79F0;SVM&#x3002;&#x4E00;&#x4E0B;&#x5168;&#x6587;&#x57FA;&#x672C;&#x90FD;&#x662F;&#x7528;SVM&#x4E00;&#x8BCD;&#x3002;</p>
<p>&#x5148;&#x5C06;&#x8FD9;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x6982;&#x5FF5;&#x5316;&#x5C0F;&#xFF0C;&#x4E2A;&#x4EBA;&#x7406;&#x89E3;&#xFF0C;SVM&#x5C31;&#x662F;&#x5F88;&#x597D;&#x7684;&#x73B0;&#x6210;&#x7684;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x201C;&#x73B0;&#x6210;&#x201D;&#x6307;&#x7684;&#x662F;&#x5206;&#x7C7B;&#x5668;&#x4E0D;&#x52A0;&#x4FEE;&#x6539;&#x5373;&#x53EF;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#x6570;&#x636E;&#x4E0A;&#x5E94;&#x7528;&#x57FA;&#x672C;&#x5F62;&#x5F0F;&#x7684;SVM&#x5206;&#x7C7B;&#x5668;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x4F4E;&#x9519;&#x8BEF;&#x7387;&#x7684;&#x7ED3;&#x679C;&#x3002;SVM&#x80FD;&#x591F;&#x5BF9;&#x8BAD;&#x7EC3;&#x96C6;&#x4E4B;&#x5916;&#x7684;&#x6570;&#x636E;&#x70B9;&#x505A;&#x51FA;&#x5F88;&#x597D;&#x7684;&#x5206;&#x7C7B;&#x51B3;&#x7B56;&#x3002;</p>
<p>&#x672C;&#x6587;&#x4E3B;&#x8981;&#x4ECB;&#x7ECD;&#x5F53;&#x524D;&#x6BD4;&#x8F83;&#x6D41;&#x884C;&#x7684;SMO&#x7B97;&#x6CD5;&#x4E0E;&#x6838;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x5173;&#x4E8E;&#x5177;&#x4F53;&#x7684;SVM&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x6211;&#x7684;&#x8FD9;&#x7BC7;&#x7B14;&#x8BB0;<br><a href="http://www.saberismywife.com/2016/12/19/Machine-Learning-7/" target="_blank" rel="external">SVM and Kernels</a></p>
<h2 id="&#x539F;&#x7406;&#x2013;&#x57FA;&#x4E8E;&#x6700;&#x5927;&#x95F4;&#x9694;&#x5206;&#x9694;&#x6570;&#x636E;"><a href="#&#x539F;&#x7406;&#x2013;&#x57FA;&#x4E8E;&#x6700;&#x5927;&#x95F4;&#x9694;&#x5206;&#x9694;&#x6570;&#x636E;" class="headerlink" title="&#x539F;&#x7406;&#x2013;&#x57FA;&#x4E8E;&#x6700;&#x5927;&#x95F4;&#x9694;&#x5206;&#x9694;&#x6570;&#x636E;"></a>&#x539F;&#x7406;&#x2013;&#x57FA;&#x4E8E;&#x6700;&#x5927;&#x95F4;&#x9694;&#x5206;&#x9694;&#x6570;&#x636E;</h2><a id="more"></a>
<pre><code>&#x652F;&#x6301;&#x5411;&#x91CF;&#x673A;
&#x4F18;&#x70B9;&#xFF1A;&#x6CDB;&#x534E;&#x9519;&#x8BEF;&#x7387;&#x4F4E;&#xFF0C;&#x8BA1;&#x7B97;&#x5F00;&#x9500;&#x4E0D;&#x5927;&#xFF0C;&#x7ED3;&#x679C;&#x6613;&#x89E3;&#x91CA;
&#x7F3A;&#x70B9;&#xFF1A;&#x5BF9;&#x53C2;&#x6570;&#x8C03;&#x8282;&#x548C;&#x6838;&#x51FD;&#x6570;&#x7684;&#x9009;&#x62E9;&#x654F;&#x611F;&#xFF0C;&#x539F;&#x59CB;&#x5206;&#x7C7B;&#x5668;&#x4E0D;&#x52A0;&#x4FEE;&#x6539;&#x4EC5;&#x9002;&#x7528;&#x4E8E;&#x5904;&#x7406;&#x4E8C;&#x7C7B;&#x95EE;&#x9898;
&#x4F7F;&#x7528;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF1A;&#x6570;&#x503C;&#x578B;&#x548C;&#x6807;&#x79F0;&#x578B;&#x6570;&#x636E;
</code></pre><p>&#x5728;&#x4ECB;&#x7ECD;SVM&#x8FD9;&#x4E2A;&#x4E3B;&#x9898;&#x4E4B;&#x524D;&#xFF0C;&#x5148;&#x89E3;&#x91CA;&#x51E0;&#x4E2A;&#x6982;&#x5FF5;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x73B0;&#x5728;&#x6709;&#x4E00;&#x7EC4;&#x4E8C;&#x7EF4;&#x6570;&#x636E;&#xFF0C;&#x5B83;&#x7684;&#x6570;&#x636E;&#x70B9;&#x4E4B;&#x95F4;&#x5DF2;&#x7ECF;&#x5206;&#x9694;&#x7684;&#x8DB3;&#x591F;&#x5F00;&#xFF0C;&#x56E0;&#x6B64;&#x5F88;&#x5BB9;&#x6613;&#x5C31;&#x53EF;&#x4EE5;&#x753B;&#x51FA;&#x4E00;&#x6761;&#x76F4;&#x7EBF;&#x5C06;&#x5176;&#x5206;&#x4E3A;&#x4E24;&#x7EC4;&#x6570;&#x636E;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x7EC4;&#x6570;&#x636E;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x7EBF;&#x6027;&#x53EF;&#x5206;(linearly separable)</strong>&#x3002;&#x5927;&#x5BB6;&#x5148;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x4E0A;&#x8BC9;&#x5047;&#x8BBE;&#x8FC7;&#x4E8E;&#x5B8C;&#x7F8E;&#xFF0C;&#x7A0D;&#x540E;&#x5F53;&#x76F4;&#x7EBF;&#x4E0D;&#x80FD;&#x5C06;&#x6570;&#x636E;&#x70B9;&#x5206;&#x5F00;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5BF9;&#x4E0A;&#x8BC9;&#x5047;&#x8BBE;&#x505A;&#x51FA;&#x4E00;&#x4E9B;&#x8C03;&#x6574;&#x3002;</p>
<p>&#x4E0A;&#x8BC9;&#x5C06;&#x6570;&#x636E;&#x96C6;&#x5206;&#x5F00;&#x7684;&#x76F4;&#x7EBF;&#x79F0;&#x4E3A;<strong>&#x5206;&#x9694;&#x8D85;&#x5E73;&#x9762;(separating hyperplane)</strong>&#x3002;&#x5728;&#x4E0A;&#x9762;&#x7ED9;&#x51FA;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x7531;&#x4E8E;&#x7ED9;&#x7684;&#x662F;&#x4E8C;&#x7EF4;&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x56E0;&#x6B64;&#x6B64;&#x65F6;&#x7684;&#x8D85;&#x5E73;&#x9762;&#x5C31;&#x53EA;&#x662F;&#x4E00;&#x6761;&#x76F4;&#x7EBF;&#x3002;&#x5982;&#x679C;&#x6240;&#x7ED9;&#x7684;&#x6570;&#x636E;&#x96C6;&#x662F;&#x4E09;&#x7EF4;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x4ED6;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5E73;&#x9762;&#x3002;&#x663E;&#x800C;&#x6613;&#x89C1;&#xFF0C;&#x66F4;&#x9AD8;&#x7EF4;&#x7684;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#x3002;&#x4F46;&#x662F;&#x8D85;&#x8FC7;&#x56DB;&#x7EF4;&#x7684;&#x5C31;&#x5DF2;&#x7ECF;&#x8D85;&#x51FA;&#x53EF;&#x63CF;&#x7ED8;&#x7684;&#x8303;&#x56F4;&#x4E86;&#xFF0C;&#x6B64;&#x65F6;&#x6211;&#x4EEC;&#x79F0;&#x8BE5;&#x53EF;&#x4EE5;&#x533A;&#x5206;&#x8FB9;&#x754C;&#x7684;&#x5BF9;&#x8C61;&#x4E3A;<strong>&#x8D85;&#x5E73;&#x9762;(hyperplane)</strong>&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5206;&#x7C7B;&#x7684;&#x51B3;&#x7B56;&#x8FB9;&#x754C;&#x3002;&#x5206;&#x5E03;&#x5728;&#x8D85;&#x5E73;&#x9762;&#x4E00;&#x4FA7;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x90FD;&#x5C5E;&#x4E8E;&#x67D0;&#x4E2A;&#x7C7B;&#x522B;&#xFF0C;&#x800C;&#x5206;&#x5E03;&#x5728;&#x53E6;&#x4E00;&#x4FA7;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x5219;&#x5C5E;&#x4E8E;&#x53E6;&#x4E00;&#x4E2A;&#x7C7B;&#x522B;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x6765;&#x6784;&#x5EFA;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x5373;&#x5982;&#x679C;&#x6570;&#x636E;&#x70B9;&#x79BB;&#x51B3;&#x7B56;&#x8FB9;&#x754C;&#x8D8A;&#x8FDC;&#xFF0C;&#x90A3;&#x4E48;&#x5176;&#x6700;&#x540E;&#x9884;&#x6D4B;&#x7684;&#x7ED3;&#x679C;&#x5C31;&#x8D8A;&#x53EF;&#x4FE1;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x6709;&#x65F6;&#x80FD;&#x533A;&#x5206;&#x6570;&#x636E;&#x7684;&#x76F4;&#x7EBF;&#x6216;&#x8005;&#x5E73;&#x9762;&#x4E0D;&#x6B62;&#x4E00;&#x4E2A;&#xFF0C;&#x6B64;&#x65F6;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x53EF;&#x80FD;&#x60F3;&#x5230;&#x7684;&#x5C31;&#x662F;&#x505A;&#x7C7B;&#x4F3C;&#x4E8E;&#x76F4;&#x7EBF;&#x62DF;&#x5408;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x5E76;&#x975E;&#x6700;&#x4F73;&#x65B9;&#x6848;&#x3002;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x80FD;&#x627E;&#x5230;&#x79BB;&#x5206;&#x9694;&#x8D85;&#x5E73;&#x9762;&#x6700;&#x8FD1;&#x7684;&#x70B9;&#xFF0C;&#x786E;&#x4FDD;&#x4ED6;&#x4EEC;&#x79BB;&#x5206;&#x9694;&#x9762;&#x5C3D;&#x53EF;&#x80FD;&#x8FDC;&#x3002;&#x8FD9;&#x91CC;&#x70B9;&#x5230;&#x5206;&#x9694;&#x9762;&#x7684;&#x8DDD;&#x79BB;&#x79F0;&#x4E3A;&#x201C;&#x95F4;&#x9694;&#x201D;(margin)&#x3002;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x95F4;&#x9694;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x5927;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x72AF;&#x9519;&#x6216;&#x8005;&#x5728;&#x6709;&#x9650;&#x6570;&#x636E;&#x96C6;&#x4E0A;&#x8BAD;&#x7EC3;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x5206;&#x7C7B;&#x5668;&#x5C3D;&#x53EF;&#x80FD;&#x529F;&#x80FD;&#x5B8C;&#x5584;&#x5E76;&#x5065;&#x58EE;&#x3002;</p>
<p><strong>&#x652F;&#x6301;&#x5411;&#x91CF;(support vector)</strong>&#x5C31;&#x662F;&#x79BB;&#x5206;&#x9694;&#x8D85;&#x5E73;&#x9762;&#x6700;&#x8FD1;&#x7684;&#x90A3;&#x4E9B;&#x70B9;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x8981;&#x8BD5;&#x7740;&#x6700;&#x5927;&#x5316;&#x652F;&#x6301;&#x5411;&#x91CF;&#x5230;&#x5206;&#x9694;&#x9762;&#x7684;&#x8DDD;&#x79BB;&#xFF0C;&#x9700;&#x8981;&#x5BFB;&#x6C42;&#x6B64;&#x95EE;&#x9898;&#x7684;&#x4F18;&#x5316;&#x6C42;&#x89E3;&#x65B9;&#x6CD5;&#x3002;</p>
<h2 id="&#x5BFB;&#x627E;&#x6700;&#x5927;&#x95F4;&#x9694;"><a href="#&#x5BFB;&#x627E;&#x6700;&#x5927;&#x95F4;&#x9694;" class="headerlink" title="&#x5BFB;&#x627E;&#x6700;&#x5927;&#x95F4;&#x9694;"></a>&#x5BFB;&#x627E;&#x6700;&#x5927;&#x95F4;&#x9694;</h2><p>&#x5173;&#x4E8E;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x7406;&#x8BBA;&#x6C42;&#x89E3;&#x5728;&#x672C;&#x6587;&#x5F00;&#x5934;&#x65F6;&#x7684;&#x90A3;&#x7BC7;&#x94FE;&#x63A5;&#x7684;&#x6587;&#x7AE0;&#x4E2D;&#x5DF2;&#x7ECF;&#x4ECB;&#x7ECD;&#x7684;&#x5F88;&#x5168;&#x9762;&#x4E86;&#xFF0C;&#x8FD9;&#x91CC;&#x5C31;&#x4E0D;&#x591A;&#x8D39;&#x53E3;&#x820C;&#x8BB2;&#x89E3;&#x96C6;&#x4F53;&#x7684;&#x6570;&#x5B66;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x76F4;&#x63A5;&#x8DF3;&#x5230;SVM&#x7684;&#x4E00;&#x822C;&#x6D41;&#x7A0B;&#xFF0C;&#x82E5;&#x4F60;&#x5BF9;&#x6570;&#x5B66;&#x63A8;&#x5BFC;&#x5F88;&#x6709;&#x5174;&#x8DA3;&#x90A3;&#x4E48;&#x5C31;&#x5F3A;&#x70C8;&#x5EFA;&#x8BAE;&#x4F60;&#x5148;&#x53BB;&#x770B;&#x90A3;&#x7BC7;&#x6587;&#x7AE0;&#x3002;</p>
<p><strong>SVM&#x7684;&#x4E00;&#x822C;&#x6D41;&#x7A0B;</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div></pre></td><td class="code"><pre><div class="line">1&#xFF09;&#x6536;&#x96C6;&#x6570;&#x636E;</div><div class="line">2&#xFF09;&#x51C6;&#x5907;&#x6570;&#x636E;&#xFF1A;&#x9700;&#x8981;&#x6570;&#x503C;&#x578B;&#x6570;&#x636E;</div><div class="line">3&#xFF09;&#x5206;&#x6790;&#x6570;&#x636E;&#xFF1A;&#x6709;&#x52A9;&#x4E8E;&#x53EF;&#x89C6;&#x5316;&#x5206;&#x9694;&#x8D85;&#x5E73;&#x9762;</div><div class="line">4&#xFF09;&#x8BAD;&#x7EC3;&#x7B97;&#x6CD5;&#xFF1A;SVM&#x7684;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#x90FD;&#x6E90;&#x81EA;&#x8BAD;&#x7EC3;&#xFF0C;&#x8BE5;&#x8FC7;&#x7A0B;&#x4E3B;&#x8981;&#x5B9E;&#x73B0;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x8C03;&#x4F18;</div><div class="line">5&#xFF09;&#x6D4B;&#x8BD5;&#x7B97;&#x6CD5;&#xFF1A;&#x5341;&#x5206;&#x7B80;&#x5355;&#x7684;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;</div><div class="line">6&#xFF09;&#x4F7F;&#x7528;&#x7B97;&#x6CD5;&#xFF1A;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x90FD;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;SVM&#xFF0C;&#x503C;&#x5F97;&#x4E00;&#x63D0;&#x7684;&#x662F;&#xFF0C;SVM&#x672C;&#x8EAB;&#x662F;&#x4E00;&#x4E2A;&#x4E8C;&#x7C7B;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x5BF9;&#x591A;&#x7C7B;&#x95EE;&#x9898;&#x5E94;&#x7528;SVM&#x9700;&#x8981;&#x5BF9;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x4FEE;&#x6539;</div></pre></td></tr></table></figure>
<h2 id="SMO&#x2013;&#x9AD8;&#x6548;&#x4F18;&#x5316;&#x7B97;&#x6CD5;"><a href="#SMO&#x2013;&#x9AD8;&#x6548;&#x4F18;&#x5316;&#x7B97;&#x6CD5;" class="headerlink" title="SMO&#x2013;&#x9AD8;&#x6548;&#x4F18;&#x5316;&#x7B97;&#x6CD5;"></a>SMO&#x2013;&#x9AD8;&#x6548;&#x4F18;&#x5316;&#x7B97;&#x6CD5;</h2><p>1996&#x5E74;&#xFF0C;John Platt&#x53D1;&#x5E03;&#x4E86;&#x4E00;&#x4E2A;&#x79F0;&#x8C13;SMO&#x7684;&#x5F3A;&#x5927;&#x7B97;&#x6CD5;&#xFF0C;&#x7528;&#x4E8E;&#x8BAD;&#x7EC3;SVM&#x3002;SMO&#x8868;&#x793A;<strong>&#x5E8F;&#x5217;&#x6700;&#x5C0F;&#x4F18;&#x5316;(sequential minimal optimization)</strong>&#x3002;Platt&#x7684;SMO&#x7B97;&#x6CD5;&#x662F;&#x5C06;&#x5927;&#x4F18;&#x5316;&#x95EE;&#x9898;&#x5206;&#x89E3;&#x4E3A;&#x591A;&#x4E2A;&#x5C0F;&#x4F18;&#x5316;&#x95EE;&#x9898;&#x6765;&#x6C42;&#x89E3;&#x7684;&#x3002;&#x8FD9;&#x4E9B;&#x5C0F;&#x4F18;&#x5316;&#x95EE;&#x9898;&#x5F80;&#x5F80;&#x5F88;&#x5BB9;&#x6613;&#x6C42;&#x89E3;&#xFF0C;&#x5E76;&#x4E14;&#x5BF9;&#x4ED6;&#x4EEC;&#x8FDB;&#x884C;&#x987A;&#x5E8F;&#x6C42;&#x89E3;&#x7684;&#x7ED3;&#x679C;&#x4E0E;&#x5C06;&#x4ED6;&#x4EEC;&#x4F5C;&#x4E3A;&#x6574;&#x4F53;&#x6765;&#x6C42;&#x89E3;&#x7684;&#x7ED3;&#x679C;&#x5B8C;&#x5168;&#x4E00;&#x81F4;&#x3002;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;SMO&#x7B97;&#x6CD5;&#x7684;&#x6C42;&#x89E3;&#x65F6;&#x95F4;&#x77ED;&#x5F88;&#x591A;&#x3002;</p>
<p><strong>SMO&#x7B97;&#x6CD5;&#x7684;&#x76EE;&#x6807;</strong>&#x662F;&#x6C42;&#x51FA;&#x4E00;&#x7CFB;&#x5217; alpha &#x548C; b &#xFF0C; &#x4E00;&#x65E6;&#x6C42;&#x51FA;&#x4E86;&#x8FD9;&#x4E9B; alpha&#xFF0C;&#x5C31;&#x5F88;&#x5BB9;&#x6613;&#x8BA1;&#x7B97;&#x51FA;&#x6743;&#x91CD;&#x5411;&#x91CF; w &#x5E76;&#x5F97;&#x5230;&#x5206;&#x9694;&#x8D85;&#x5E73;&#x9762;&#x3002;</p>
<p><strong>SMO&#x7B97;&#x6CD5;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;</strong>&#xFF1A;&#x6BCF;&#x6B21;&#x5FAA;&#x73AF;&#x4E2D;&#x9009;&#x62E9;&#x4E24;&#x4E2A; alpha &#x8FDB;&#x884C;&#x4F18;&#x5316;&#x5904;&#x7406;&#x3002;&#x4E00;&#x65E6;&#x627E;&#x5230;&#x4E00;&#x5BF9;&#x5408;&#x9002;&#x7684; alpha&#xFF0C;&#x90A3;&#x4E48;&#x4E45;&#x589E;&#x5927;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x540C;&#x65F6;&#x51CF;&#x5C0F;&#x53E6;&#x4E00;&#x4E2A;&#x3002;&#x8FD9;&#x91CC;&#x6240;&#x8C13;&#x7684;&#x201C;&#x5408;&#x9002;&#x201D;&#x662F;&#x6307;&#x4E24;&#x4E2A; alpha &#x5FC5;&#x987B;&#x8981;&#x7B26;&#x5408;&#x4E00;&#x5B9A;&#x7684;&#x6761;&#x4EF6;&#xFF0C;&#x6761;&#x4EF6;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x8FD9;&#x4E24;&#x4E2A; alpha &#x5FC5;&#x987B;&#x8981;&#x5728;&#x95F4;&#x9694;&#x8FB9;&#x754C;&#x4E4B;&#x5916;&#xFF0C;&#x800C;&#x5176;&#x4E2D;&#x7B2C;&#x4E8C;&#x4E2A;&#x6761;&#x4EF6;&#x662F;&#x8FD9;&#x4E24;&#x4E2A; alpha &#x8FD8;&#x6CA1;&#x6709;&#x8FDB;&#x884C;&#x8FC7;&#x533A;&#x95F4;&#x5316;&#x5904;&#x7406;&#x6216;&#x8005;&#x4E0D;&#x5728;&#x8FB9;&#x754C;&#x4E0A;&#x3002;</p>
<p>Platt&#x7684;SMO&#x7B97;&#x6CD5;&#x7684;&#x5B8C;&#x6574;&#x5B9E;&#x73B0;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x5927;&#x91CF;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x7531;&#x6D45;&#x5165;&#x6DF1;&#xFF0C;&#x5148;&#x5C06;&#x5176;&#x8FDB;&#x884C;&#x7B80;&#x5316;&#x5904;&#x7406;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E86;&#x89E3;&#x7B97;&#x6CD5;&#x7684;&#x57FA;&#x672C;&#x5DE5;&#x4F5C;&#x601D;&#x8DEF;&#xFF0C;&#x4E4B;&#x540E;&#x518D;&#x57FA;&#x4E8E;&#x7B80;&#x5316;&#x7248;&#x7ED9;&#x51FA;&#x5B8C;&#x6574;&#x7248;&#x3002;&#x7B80;&#x5316;&#x7248;&#x7684;&#x4EE3;&#x7801;&#x867D;&#x7136;&#x91CF;&#x5C11;&#xFF0C;&#x4F46;&#x662F;&#x6267;&#x884C;&#x901F;&#x5EA6;&#x6162;&#x3002;Platt SMO&#x7B97;&#x6CD5;&#x4E2D;&#x7684;&#x5916;&#x5FAA;&#x73AF;&#x786E;&#x5B9A;&#x8981;&#x4F18;&#x5316;&#x7684;&#x6700;&#x4F73; alpha &#x5BF9;&#x3002;&#x800C;&#x7B80;&#x5316;&#x7248;&#x5374;&#x4F1A;&#x8DF3;&#x8FC7;&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x9996;&#x5148;&#x5728;&#x6570;&#x636E;&#x96C6;&#x4E0A;&#x505A;&#x4E00;&#x6B21;&#x904D;&#x5386;&#xFF0C;&#x904D;&#x5386;&#x6BCF;&#x4E00;&#x4E2A; alpha&#xFF0C;&#x7136;&#x540E;&#x5728;&#x5269;&#x4F59;&#x7684; alpha &#x96C6;&#x5408;&#x4E2D;&#x968F;&#x673A;&#x9009;&#x62E9;&#x53E6;&#x4E00;&#x4E2A; alpha&#xFF0C;&#x4ECE;&#x800C;&#x6784;&#x6210; alpha &#x5BF9;&#x3002;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x70B9;&#x76F8;&#x5F53;&#x91CD;&#x8981;&#xFF0C;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x540C;&#x65F6;&#x6539;&#x53D8;&#x4E24;&#x4E2A; alpha&#x3002;&#x4E4B;&#x6240;&#x4EE5;&#x8FD9;&#x6837;&#x505A;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x6709;&#x4E2A;&#x7EA6;&#x675F;&#x6761;&#x4EF6;&#xFF1A;</p>
<center>&#x2211;&#x3B1;<sub>i</sub>*label<sup>(i)</sup> = 0</center>

<p>&#x7531;&#x4E8E;&#x5355;&#x72EC;&#x6539;&#x53D8;&#x4E00;&#x4E2A; alpha &#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x8BE5;&#x7EA6;&#x675F;&#x6761;&#x4EF6;&#x5931;&#x6548;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x603B;&#x662F;&#x540C;&#x65F6;&#x8C03;&#x6574;&#x4E24;&#x4E2A; alpha&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x8F85;&#x52A9;&#x51FD;&#x6570;&#xFF0C;&#x7528;&#x4E8E;&#x5728;&#x67D0;&#x4E2A;&#x533A;&#x95F4;&#x8303;&#x56F4;&#x5185;&#x968F;&#x673A;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x9700;&#x8981;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x8F85;&#x52A9;&#x51FD;&#x6570;&#xFF0C;&#x7528;&#x4E8E;&#x5728;&#x6570;&#x503C;&#x592A;&#x5927;&#x65F6;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x8C03;&#x6574;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x4E86;&#x8FD9;&#x4E24;&#x4E2A;&#x51FD;&#x6570;&#x3002;&#x9996;&#x5148;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;&#x53EB; svmMLiA.py &#x7684;&#x6587;&#x4EF6;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div><div class="line">17</div><div class="line">18</div><div class="line">19</div><div class="line">20</div><div class="line">21</div></pre></td><td class="code"><pre><div class="line">def loadDataSet(fileName):</div><div class="line">    dataMat = []; labelMat = []</div><div class="line">    fr = open(fileName)</div><div class="line">    for line in fr.readlines():</div><div class="line">        lineArr = line.strip().split(&apos;\t&apos;)</div><div class="line">        dataMat.append([float(lineArr[0]), float(lineArr[1])])</div><div class="line">        labelMat.append(float(lineArr[2]))</div><div class="line">    return dataMat,labelMat</div><div class="line"></div><div class="line">def selectJrand(i,m):</div><div class="line">    j=i #we want to select any J not equal to i</div><div class="line">    while (j==i):</div><div class="line">        j = int(random.uniform(0,m))</div><div class="line">    return j</div><div class="line"></div><div class="line">def clipAlpha(aj,H,L):</div><div class="line">    if aj &gt; H: </div><div class="line">        aj = H</div><div class="line">    if L &gt; aj:</div><div class="line">        aj = L</div><div class="line">    return aj</div></pre></td></tr></table></figure>
<p>&#x4E0A;&#x8BC9;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x5C31;&#x662F;&#x5E38;&#x89C1;&#x7684; loadDatSet() &#x51FD;&#x6570;&#xFF0C;&#x8BE5;&#x51FD;&#x6570;&#x7684;&#x529F;&#x80FD;&#x663E;&#x800C;&#x6613;&#x89C1;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x51FD;&#x6570; selectJrand() &#x6709;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x503C;&#xFF0C;&#x5176;&#x4E2D; i &#x662F;&#x7B2C;&#x4E00;&#x4E2A; alpha &#x7684;&#x4E0B;&#x6807;&#xFF0C;m &#x662F;&#x6240;&#x6709; alpha &#x7684;&#x6570;&#x76EE;&#x3002;&#x53EA;&#x8981;&#x51FD;&#x6570;&#x503C;&#x4E0D;&#x7B49;&#x4E8E;&#x8F93;&#x5165;&#x503C; i&#xFF0C;&#x51FD;&#x6570;&#x5C31;&#x4F1A;&#x8FDB;&#x884C;&#x968F;&#x673A;&#x9009;&#x62E9;&#x3002;</p>
<p>&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x8F85;&#x52A9;&#x51FD;&#x6570;&#x662F; clipAlpha()&#xFF0C;&#x5B83;&#x662F;&#x7528;&#x4E8E;&#x8C03;&#x6574;&#x5927;&#x4E8E;H &#x6216;&#x5C0F;&#x4E8E; L &#x7684; alpha &#x503C;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x4E0A;&#x8BC9;&#x4E09;&#x4E2A;&#x8F85;&#x52A9;&#x51FD;&#x6570;&#x672C;&#x8EAB;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x4E0D;&#x662F;&#x5F88;&#x591A;&#xFF0C;&#x4F46;&#x5728;&#x5206;&#x7C7B;&#x5668;&#x4E2D;&#x5374;&#x5F88;&#x6709;&#x7528;&#x3002;</p>
<p>&#x7136;&#x540E;&#x6211;&#x4EEC;&#x8FDB;&#x5165;&#x5230;python&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x8F93;&#x5165;&#x5982;&#x4E0B;&#x8BED;&#x53E5;&#xFF0C;&#x770B;&#x770B;&#x9884;&#x671F;&#x6548;&#x679C;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div></pre></td><td class="code"><pre><div class="line">import svmPLiA</div><div class="line">dataArr, labelArr = avmPLiA.loadDataSet(&apos;testSet.txt&apos;)</div><div class="line">labelArr</div></pre></td></tr></table></figure>
<p>&#x4ECE;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x4E2D;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x8FD9;&#x91CC;&#x91C7;&#x7528;&#x7684;&#x7C7B;&#x522B;&#x6807;&#x7B7E;&#x662F;-1&#x548C;1&#xFF0C;&#x800C;&#x4E0D;&#x662F;0&#x548C;1&#x3002;</p>
<p>&#x4E0A;&#x8BC9;&#x5DE5;&#x4F5C;&#x5B8C;&#x6210;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;SMO&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x4E86;&#xFF0C;&#x4F2A;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div></pre></td><td class="code"><pre><div class="line">&#x521B;&#x5EFA;&#x4E00;&#x4E2A; alpha &#x5411;&#x91CF;&#x5E76;&#x5C06;&#x5176;&#x521D;&#x59CB;&#x5316;&#x4E3A;&#x96F6;&#x5411;&#x91CF;</div><div class="line">&#x5F53;&#x8FED;&#x4EE3;&#x6B21;&#x6570;&#x5C0F;&#x4E8E;&#x6700;&#x5927;&#x8FED;&#x4EE3;&#x6B21;&#x6570;&#x65F6;&#xFF08;&#x5916;&#x5FAA;&#x73AF;&#xFF09;</div><div class="line">	&#x5BF9;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x5411;&#x91CF;&#xFF08;&#x5185;&#x5FAA;&#x73AF;&#xFF09;&#xFF1A;</div><div class="line">		&#x5982;&#x679C;&#x8BE5;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x88AB;&#x4F18;&#x5316;&#xFF1A;</div><div class="line">			&#x968F;&#x673A;&#x9009;&#x62E9;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5411;&#x91CF;</div><div class="line">			&#x540C;&#x65F6;&#x4F18;&#x5316;&#x8FD9;&#x4E24;&#x4E2A;&#x5411;&#x91CF;</div><div class="line">			&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x5411;&#x91CF;&#x90FD;&#x4E0D;&#x80FD;&#x88AB;&#x4F18;&#x5316;&#xFF0C;&#x9000;&#x51FA;&#x5185;&#x5FAA;&#x73AF;</div><div class="line">		&#x5982;&#x679C;&#x6240;&#x6709;&#x5411;&#x91CF;&#x90FD;&#x6CA1;&#x6709;&#x88AB;&#x4F18;&#x5316;&#xFF0C;&#x589E;&#x52A0;&#x8FED;&#x4EE3;&#x6570;&#x76EE;&#xFF0C;&#x8FDB;&#x884C;&#x4E0B;&#x4E00;&#x6B21;&#x5FAA;&#x73AF;</div></pre></td></tr></table></figure>
<p>&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x662F;&#x4EE3;&#x7801;&#x90E8;&#x5206;&#x4E86;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div><div class="line">17</div><div class="line">18</div><div class="line">19</div><div class="line">20</div><div class="line">21</div><div class="line">22</div><div class="line">23</div><div class="line">24</div><div class="line">25</div><div class="line">26</div><div class="line">27</div><div class="line">28</div><div class="line">29</div><div class="line">30</div><div class="line">31</div><div class="line">32</div><div class="line">33</div><div class="line">34</div><div class="line">35</div><div class="line">36</div><div class="line">37</div><div class="line">38</div><div class="line">39</div><div class="line">40</div><div class="line">41</div><div class="line">42</div><div class="line">43</div><div class="line">44</div></pre></td><td class="code"><pre><div class="line">def smoSimple(dataMatIn, classLabels, C, toler, maxIter):</div><div class="line">    dataMatrix = mat(dataMatIn); labelMat = mat(classLabels).transpose()</div><div class="line">    b = 0; m,n = shape(dataMatrix)</div><div class="line">    alphas = mat(zeros((m,1)))</div><div class="line">    iter = 0</div><div class="line">    while (iter &lt; maxIter):</div><div class="line">        alphaPairsChanged = 0</div><div class="line">        for i in range(m):</div><div class="line">            fXi = float(multiply(alphas,labelMat).T*(dataMatrix*dataMatrix[i,:].T)) + b</div><div class="line">            Ei = fXi - float(labelMat[i])#if checks if an example violates KKT conditions</div><div class="line">            # &#x5982;&#x679C; alpha &#x53EF;&#x4EE5;&#x66F4;&#x6539;&#x8FDB;&#x5165;&#x4F18;&#x5316;&#x8FC7;&#x7A0B;</div><div class="line">            if ((labelMat[i]*Ei &lt; -toler) and (alphas[i] &lt; C)) or ((labelMat[i]*Ei &gt; toler) and (alphas[i] &gt; 0)):</div><div class="line">            	# &#x968F;&#x673A;&#x9009;&#x62E9;&#x7B2C;&#x4E8C;&#x4E2A; alpha</div><div class="line">                j = selectJrand(i,m)</div><div class="line">                fXj = float(multiply(alphas,labelMat).T*(dataMatrix*dataMatrix[j,:].T)) + b</div><div class="line">                Ej = fXj - float(labelMat[j])</div><div class="line">                alphaIold = alphas[i].copy(); alphaJold = alphas[j].copy();</div><div class="line">                # &#x4FDD;&#x8BC1; alpha &#x5728; 0 &#x4E0E; C &#x4E4B;&#x95F4;</div><div class="line">                if (labelMat[i] != labelMat[j]):</div><div class="line">                    L = max(0, alphas[j] - alphas[i])</div><div class="line">                    H = min(C, C + alphas[j] - alphas[i])</div><div class="line">                else:</div><div class="line">                    L = max(0, alphas[j] + alphas[i] - C)</div><div class="line">                    H = min(C, alphas[j] + alphas[i])</div><div class="line">                if L==H: print &quot;L==H&quot;; continue</div><div class="line">                eta = 2.0 * dataMatrix[i,:]*dataMatrix[j,:].T - dataMatrix[i,:]*dataMatrix[i,:].T - dataMatrix[j,:]*dataMatrix[j,:].T</div><div class="line">                if eta &gt;= 0: print &quot;eta&gt;=0&quot;; continue</div><div class="line">                alphas[j] -= labelMat[j]*(Ei - Ej)/eta</div><div class="line">                alphas[j] = clipAlpha(alphas[j],H,L)</div><div class="line">                if (abs(alphas[j] - alphaJold) &lt; 0.00001): print &quot;j not moving enough&quot;; continue</div><div class="line">                # &#x5BF9; i &#x8FDB;&#x884C;&#x4FEE;&#x6539;&#xFF0C;&#x4FEE;&#x6539;&#x91CF;&#x4E0E; j &#x76F8;&#x540C;&#xFF0C;&#x4F46;&#x65B9;&#x5411;&#x76F8;&#x53CD;</div><div class="line">                alphas[i] += labelMat[j]*labelMat[i]*(alphaJold - alphas[j])</div><div class="line">                # &#x8BBE;&#x7F6E;&#x5E38;&#x6570;&#x9879;</div><div class="line">                b1 = b - Ei- labelMat[i]*(alphas[i]-alphaIold)*dataMatrix[i,:]*dataMatrix[i,:].T - labelMat[j]*(alphas[j]-alphaJold)*dataMatrix[i,:]*dataMatrix[j,:].T</div><div class="line">                b2 = b - Ej- labelMat[i]*(alphas[i]-alphaIold)*dataMatrix[i,:]*dataMatrix[j,:].T - labelMat[j]*(alphas[j]-alphaJold)*dataMatrix[j,:]*dataMatrix[j,:].T</div><div class="line">                if (0 &lt; alphas[i]) and (C &gt; alphas[i]): b = b1</div><div class="line">                elif (0 &lt; alphas[j]) and (C &gt; alphas[j]): b = b2</div><div class="line">                else: b = (b1 + b2)/2.0</div><div class="line">                alphaPairsChanged += 1</div><div class="line">                print &quot;iter: %d i:%d, pairs changed %d&quot; % (iter,i,alphaPairsChanged)</div><div class="line">        if (alphaPairsChanged == 0): iter += 1</div><div class="line">        else: iter = 0</div><div class="line">        print &quot;iteration number: %d&quot; % iter</div><div class="line">    return b,alphas</div></pre></td></tr></table></figure>
<p>&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x53EF;&#x80FD;&#x6BD4;&#x8F83;&#x5927;&#xFF0C;&#x54B1;&#x4EEC;&#x6162;&#x6162;&#x6765;&#x770B;&#x3002;</p>
<p>&#x4E0A;&#x8BC9;&#x51FD;&#x6570;&#x9996;&#x5148;&#x5148;&#x5C06;&#x591A;&#x4E2A;&#x5217;&#x8868;&#x548C;&#x8F93;&#x5165;&#x53C2;&#x6570;&#x8F6C;&#x6362;&#x6210; NumPy &#x77E9;&#x9635;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x7B80;&#x5316;&#x5F88;&#x591A;&#x6570;&#x5B66;&#x64CD;&#x4F5C;&#x3002;&#x7531;&#x4E8E;&#x8F6C;&#x7F6E;&#x4E86;&#x7C7B;&#x522B;&#x6807;&#x7B7E;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x5217;&#x5411;&#x91CF;&#x800C;&#x4E0D;&#x662F;&#x5217;&#x8868;&#x3002;&#x4E8E;&#x662F;&#x7C7B;&#x522B;&#x6807;&#x7B7E;&#x5411;&#x91CF;&#x7684;&#x6BCF;&#x884C;&#x5143;&#x7D20;&#x90FD;&#x4E0E;&#x6570;&#x636E;&#x77E9;&#x9635;&#x4E2D;&#x7684;&#x884C;&#x4E00;&#x4E00;&#x5BF9;&#x5E94;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x77E9;&#x9635; dataMatIn &#x7684; shape &#x5C5E;&#x6027;&#x5F97;&#x5230;&#x5E38;&#x6570; m &#x548C; n&#x3002;&#x6700;&#x540E;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6784;&#x5EFA;&#x4E00;&#x4E2A; alpha &#x5217;&#x77E9;&#x9635;&#xFF0C;&#x77E9;&#x9635;&#x5143;&#x7D20;&#x90FD;&#x521D;&#x59CB;&#x5316;&#x4E3A;0&#xFF0C;&#x5E76;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A; iter &#x53D8;&#x91CF;&#x3002;&#x8BE5;&#x53D8;&#x91CF;&#x5B58;&#x50A8;&#x7684;&#x5219;&#x662F;&#x5728;&#x6CA1;&#x6709;&#x4EFB;&#x4F55; alpha &#x6539;&#x53D8;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x904D;&#x5386;&#x6570;&#x636E;&#x96C6;&#x7684;&#x6B21;&#x6570;&#x3002;&#x5F53;&#x8BE5;&#x53D8;&#x91CF;&#x8FBE;&#x5230;&#x8F93;&#x5165;&#x503C; maxIter &#x65F6;&#x51FD;&#x6570;&#x7ED3;&#x675F;&#x8FD0;&#x884C;&#x5E76;&#x9000;&#x51FA;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x5728;&#x4F18;&#x5316;&#x8FC7;&#x7A0B;&#x7ED3;&#x675F;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x5FC5;&#x987B;&#x786E;&#x4FDD;&#x5728;&#x5408;&#x9002;&#x7684;&#x65F6;&#x673A;&#x7ED3;&#x675F;&#x5FAA;&#x73AF;&#x3002;&#x5982;&#x679C;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x5230; for &#x5FAA;&#x73AF;&#x7684;&#x6700;&#x540E;&#x4E00;&#x884C;&#x90FD;&#x4E0D;&#x6267;&#x884C; continue &#x8BED;&#x53E5;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x5DF2;&#x7ECF;&#x6210;&#x529F;&#x7684;&#x6539;&#x53D8;&#x4E86;&#x4E00;&#x5BF9; alpha&#xFF0C;&#x540C;&#x65F6;&#x53EF;&#x4EE5;&#x589E;&#x52A0; alphaPairsChanged &#x7684;&#x503C;&#x3002;&#x5728; for &#x5FAA;&#x73AF;&#x4E4B;&#x5916;&#xFF0C;&#x9700;&#x8981;&#x68C0;&#x67E5; alpha &#x503C;&#x662F;&#x5426;&#x505A;&#x4E86;&#x66F4;&#x65B0;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x66F4;&#x65B0;&#x5219;&#x5C06; iter &#x8BBE;&#x4E3A;0&#x540E;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#x3002;&#x53EA;&#x6709;&#x5728;&#x6240;&#x6709;&#x6570;&#x636E;&#x96C6;&#x4E0A;&#x904D;&#x5386; maxIter &#x6B21;&#xFF0C;&#x4E14;&#x4E0D;&#x518D;&#x53D1;&#x751F;&#x4EFB;&#x4F55; alpha &#x4FEE;&#x6539;&#x4E4B;&#x540E;&#xFF0C;&#x7A0B;&#x5E8F;&#x624D;&#x4F1A;&#x505C;&#x6B62;&#x5E76;&#x9000;&#x51FA; while &#x5FAA;&#x73AF;&#x3002;</p>
<p>&#x7531;&#x4E8E;SMO&#x7B97;&#x6CD5;&#x7684;&#x968F;&#x673A;&#x6027;&#xFF0C;&#x5927;&#x5BB6;&#x5728;&#x591A;&#x8FD0;&#x884C;&#x51E0;&#x6B21;&#x540E;&#x6240;&#x5F97;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x53EF;&#x80FD;&#x4F1A;&#x4E0D;&#x4E00;&#x6837;&#x3002;</p>
<p><strong>&#x5229;&#x7528;&#x5B8C;&#x6574;&#x7684; Platt SMO&#x7B97;&#x6CD5;&#x52A0;&#x901F;&#x4F18;&#x5316;</strong> </p>
<p>&#x5728;&#x51E0;&#x767E;&#x4E2A;&#x70B9;&#x7EC4;&#x6210;&#x7684;&#x5C0F;&#x89C4;&#x6A21;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#xFF0C;&#x7B80;&#x5316;&#x7248;SMO&#x7B97;&#x6CD5;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x95F4;&#x662F;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x66F4;&#x5927;&#x7684;&#x6570;&#x636E;&#x96C6;&#x4E0A;&#x7684;&#x8FD0;&#x884C;&#x901F;&#x5EA6;&#x5C31;&#x4F1A;&#x53D8;&#x6162;&#x3002;&#x521A;&#x624D;&#x5DF2;&#x7ECF;&#x8BA8;&#x8BBA;&#x4E86;SMO&#x7684;&#x7B80;&#x5316;&#x7248;&#x7B97;&#x6CD5;&#xFF0C;&#x73B0;&#x5728;&#x6765;&#x8C08;&#x8C08;&#x5B8C;&#x6574;&#x7248;&#x7684;SMO&#x7B97;&#x6CD5;&#x3002;&#x5728;&#x8FD9;&#x4E24;&#x4E2A;&#x7248;&#x672C;&#x4E2D;&#xFF0C;&#x5B9E;&#x73B0; alpha &#x7684;&#x66F4;&#x6539;&#x548C;&#x4EE3;&#x6570;&#x8FD0;&#x7B97;&#x7684;&#x4F18;&#x5316;&#x73AF;&#x8282;&#x4E00;&#x6A21;&#x4E00;&#x6837;&#x3002;&#x5728;&#x4F18;&#x5316;&#x8FC7;&#x7A0B;&#x4E2D;&#x552F;&#x4E00;&#x7684;&#x4E0D;&#x540C;&#x5C31;&#x662F;&#x9009;&#x62E9; alpha &#x7684;&#x65B9;&#x5F0F;&#x3002;&#x5B8C;&#x6574;&#x7248;&#x7684; Platt SMO &#x7B97;&#x6CD5;&#x5E94;&#x7528;&#x4E86;&#x4E00;&#x4E9B;&#x80FD;&#x591F;&#x63D0;&#x901F;&#x7684;&#x542F;&#x53D1;&#x65B9;&#x6CD5;&#x3002;&#x6216;&#x8BB8;&#x6709;&#x4E9B;&#x6280;&#x672F;&#x5389;&#x5BB3;&#x7684;&#x8BFB;&#x8005;&#x5DF2;&#x7ECF;&#x610F;&#x8BC6;&#x5230;&#x4E0A;&#x8BC9;&#x4EE3;&#x7801;&#x8FD8;&#x53EF;&#x4EE5;&#x4F18;&#x5316;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x3002;</p>
<p>Platt SMO &#x7B97;&#x6CD5;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x5916;&#x5FAA;&#x73AF;&#x6765;&#x9009;&#x62E9;&#x7B2C;&#x4E00;&#x4E2A; alpha &#x503C;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x5176;&#x9009;&#x62E9;&#x8FC7;&#x7A0B;&#x4F1A;&#x5728;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x4EA4;&#x66FF;&#xFF1A;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x662F;&#x5728;&#x6240;&#x6709;&#x6570;&#x636E;&#x96C6;&#x4E0A;&#x8FDB;&#x884C;&#x5355;&#x904D;&#x626B;&#x63CF;&#xFF0C;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x5219;&#x662F;&#x5728;&#x975E;&#x8FB9;&#x754C; alpha &#x4E2D;&#x5B9E;&#x73B0;&#x5355;&#x904D;&#x626B;&#x63CF;&#x3002;&#x800C;&#x6240;&#x8C13;&#x7684;&#x975E;&#x8FB9;&#x754C; alpha &#x503C;&#x7684;&#x5C31;&#x662F;&#x90A3;&#x4E9B;&#x4E0D;&#x7B49;&#x4E0E;&#x8FB9;&#x754C;0&#x6216;C&#x7684; alpha &#x503C;&#x3002;&#x5BF9;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x7684;&#x626B;&#x63CF;&#x76F8;&#x5F53;&#x5BB9;&#x6613;&#xFF0C;&#x800C;&#x5B9E;&#x73B0;&#x975E;&#x8FB9;&#x754C; alpha &#x503C;&#x7684;&#x626B;&#x63CF;&#x65F6;&#xFF0C;&#x9996;&#x5148;&#x9700;&#x8981;&#x5EFA;&#x7ACB;&#x8FD9;&#x4E9B; alpha &#x7684;&#x503C;&#x7684;&#x5217;&#x8868;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x8FD9;&#x4E2A;&#x8868;&#x8FDB;&#x884C;&#x904D;&#x5386;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x8BE5;&#x6B65;&#x9AA4;&#x4F1A;&#x8DF3;&#x8FC7;&#x90A3;&#x4E9B;&#x5DF2;&#x77E5;&#x7684;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#x7684; alpha &#x7684;&#x503C;&#x3002;</p>
<p>&#x5728;&#x9009;&#x62E9;&#x7B2C;&#x4E00;&#x4E2A; alpha &#x503C;&#x540E;&#xFF0C;&#x7B97;&#x6CD5;&#x4F1A;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x5185;&#x5FAA;&#x73AF;&#x6765;&#x9009;&#x62E9;&#x7B2C;&#x4E8C;&#x4E2A; alpha &#x503C;&#x3002;&#x5728;&#x4F18;&#x5316;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F1A;&#x901A;&#x8FC7;<strong>&#x6700;&#x5927;&#x5316;&#x6B65;&#x957F;</strong>&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x83B7;&#x5F97;&#x7B2C;&#x4E8C;&#x4E2A; alpha &#x503C;&#x3002;&#x5728;&#x7B80;&#x5316;&#x7248;SMO&#x7B97;&#x6CD5;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5728;&#x9009;&#x62E9; j &#x4E4B;&#x540E;&#x8BA1;&#x7B97;&#x9519;&#x8BEF;&#x7387; Ej&#x3002;&#x4F46;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x7684;&#x7F13;&#x5B58;&#x7528;&#x4E8E;&#x4FDD;&#x5B58;&#x8BEF;&#x5DEE;&#x503C;&#xFF0C;&#x5E76;&#x4ECE;&#x4E2D;&#x9009;&#x62E9;&#x6B65;&#x957F;&#x6216;&#x8005;&#x8BF4; Ei-Ej &#x6700;&#x5927;&#x7684; alpha &#x503C;&#x3002;</p>
<p><strong>&#x5B8C;&#x6574;&#x7248; SMO &#x7684;&#x8F85;&#x52A9;&#x51FD;&#x6570;</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div><div class="line">17</div><div class="line">18</div><div class="line">19</div><div class="line">20</div><div class="line">21</div><div class="line">22</div><div class="line">23</div><div class="line">24</div><div class="line">25</div><div class="line">26</div><div class="line">27</div><div class="line">28</div><div class="line">29</div><div class="line">30</div><div class="line">31</div><div class="line">32</div><div class="line">33</div><div class="line">34</div><div class="line">35</div><div class="line">36</div><div class="line">37</div><div class="line">38</div><div class="line">39</div><div class="line">40</div><div class="line">41</div><div class="line">42</div></pre></td><td class="code"><pre><div class="line">class optStruct:</div><div class="line">    def __init__(self,dataMatIn, classLabels, C, toler, kTup):  </div><div class="line">        self.X = dataMatIn</div><div class="line">        self.labelMat = classLabels</div><div class="line">        self.C = C</div><div class="line">        self.tol = toler</div><div class="line">        self.m = shape(dataMatIn)[0]</div><div class="line">        self.alphas = mat(zeros((self.m,1)))</div><div class="line">        self.b = 0</div><div class="line">        self.eCache = mat(zeros((self.m,2))) #first column is valid flag</div><div class="line">        self.K = mat(zeros((self.m,self.m)))</div><div class="line">        for i in range(self.m):</div><div class="line">        # &#x7F13;&#x5B58;&#x8BEF;&#x5DEE;</div><div class="line">            self.K[:,i] = kernelTrans(self.X, self.X[i,:], kTup)</div><div class="line">        </div><div class="line">def calcEk(oS, k):</div><div class="line">    fXk = float(multiply(oS.alphas,oS.labelMat).T*oS.K[:,k] + oS.b)</div><div class="line">    Ek = fXk - float(oS.labelMat[k])</div><div class="line">    return Ek</div><div class="line">        </div><div class="line">def selectJ(i, oS, Ei):        </div><div class="line">	# &#x5185;&#x5FAA;&#x73AF;&#x7684;&#x542F;&#x53D1;&#x5F0F;&#x65B9;&#x6CD5;</div><div class="line">    maxK = -1; maxDeltaE = 0; Ej = 0</div><div class="line">    oS.eCache[i] = [1,Ei]  </div><div class="line">    validEcacheList = nonzero(oS.eCache[:,0].A)[0]</div><div class="line">    if (len(validEcacheList)) &gt; 1:</div><div class="line">        for k in validEcacheList:   </div><div class="line">            if k == i: continue </div><div class="line">            Ek = calcEk(oS, k)</div><div class="line">            deltaE = abs(Ei - Ek)</div><div class="line">            # &#x9009;&#x62E9;&#x5177;&#x6709;&#x6700;&#x957F;&#x6B65;&#x957F;&#x7684; j</div><div class="line">            if (deltaE &gt; maxDeltaE):</div><div class="line">                maxK = k; maxDeltaE = deltaE; Ej = Ek</div><div class="line">        return maxK, Ej</div><div class="line">    else:  </div><div class="line">        j = selectJrand(i, oS.m)</div><div class="line">        Ej = calcEk(oS, j)</div><div class="line">    return j, Ej</div><div class="line"></div><div class="line">def updateEk(oS, k):</div><div class="line">    Ek = calcEk(oS, k)</div><div class="line">    oS.eCache[k] = [1,Ek]</div></pre></td></tr></table></figure>
<p>&#x9996;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#x5C31;&#x5C31;&#x662F;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6765;&#x4FDD;&#x5B58;&#x6240;&#x6709;&#x7684;&#x91CD;&#x8981;&#x503C;&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x6765;&#x5B8C;&#x6210;&#x3002;&#x8FD9;&#x91CC;&#x4F7F;&#x7528;&#x5BF9;&#x8C61;&#x7684;&#x76EE;&#x7684;&#x5E76;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#xFF0C;&#x800C;&#x53EA;&#x662F;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6765;&#x4F7F;&#x7528;&#x5BF9;&#x8C61;&#x3002;&#x5728;&#x5C06;&#x503C;&#x4F20;&#x7ED9;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5C06;&#x6240;&#x6709;&#x6570;&#x636E;&#x79FB;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x7ED3;&#x6784;&#x4E2D;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x7701;&#x6389;&#x624B;&#x5DE5;&#x8F93;&#x5165;&#x7684;&#x9EBB;&#x70E6;&#x4E86;&#x3002;&#x800C;&#x6B64;&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x6765;&#x8FDB;&#x884C;&#x4F20;&#x9012;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x7ED9;&#x5B9A;&#x7684; alpha &#x503C;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x8F85;&#x52A9;&#x51FD;&#x6570; caleEk() &#x80FD;&#x591F;&#x8BA1;&#x7B97; E &#x503C;&#x5E76;&#x8FD4;&#x56DE;&#x3002;&#x4EE5;&#x524D;&#xFF0C;&#x8BE5;&#x8FC7;&#x7A0B;&#x662F;&#x91C7;&#x7528;&#x5185;&#x5D4C;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5B8C;&#x6210;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x8BE5;&#x8FC7;&#x7A0B;&#x5728;&#x8FD9;&#x4E2A;&#x7248;&#x672C;&#x7684;SMO&#x7B97;&#x6CD5;&#x4E2D;&#x51FA;&#x73B0;&#x9891;&#x7E41;&#xFF0C;&#x8FD9;&#x91CC;&#x5FC5;&#x987B;&#x8981;&#x5C06;&#x5176;&#x5355;&#x72EC;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x4E0B;&#x4E00;&#x4E2A;&#x51FD;&#x6570; selectJ() &#x7528;&#x4E8E;&#x9009;&#x62E9;&#x7B2C;&#x4E8C;&#x4E2A; alpha &#x503C;&#x3002;</p>
<p>&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x8F85;&#x52A9;&#x51FD;&#x6570; updateEk()&#xFF0C;&#x5B83;&#x4F1A;&#x8BA1;&#x7B97;&#x8BEF;&#x5DEE;&#x503C;&#x5E76;&#x5B58;&#x5165;&#x7F13;&#x5B58;&#x4E2D;&#x3002;&#x5728;&#x5BF9; alpha &#x8FDB;&#x884C;&#x4F18;&#x5316;&#x4E4B;&#x540E;&#x5C31;&#x4F1A;&#x7528;&#x5230;&#x8FD9;&#x4E2A;&#x503C;&#x3002;</p>
<p><strong>&#x5B8C;&#x6574; Platt SMO &#x7B97;&#x6CD5;&#x4E2D;&#x7684;&#x4F18;&#x5316;</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div><div class="line">17</div><div class="line">18</div><div class="line">19</div><div class="line">20</div><div class="line">21</div><div class="line">22</div><div class="line">23</div><div class="line">24</div><div class="line">25</div><div class="line">26</div><div class="line">27</div></pre></td><td class="code"><pre><div class="line">def innerL(i, oS):</div><div class="line">    Ei = calcEk(oS, i)</div><div class="line">    if ((oS.labelMat[i]*Ei &lt; -oS.tol) and (oS.alphas[i] &lt; oS.C)) or ((oS.labelMat[i]*Ei &gt; oS.tol) and (oS.alphas[i] &gt; 0)):</div><div class="line">        j,Ej = selectJ(i, oS, Ei) </div><div class="line">        alphaIold = oS.alphas[i].copy(); alphaJold = oS.alphas[j].copy();</div><div class="line">        if (oS.labelMat[i] != oS.labelMat[j]):</div><div class="line">            L = max(0, oS.alphas[j] - oS.alphas[i])</div><div class="line">            H = min(oS.C, oS.C + oS.alphas[j] - oS.alphas[i])</div><div class="line">        else:</div><div class="line">            L = max(0, oS.alphas[j] + oS.alphas[i] - oS.C)</div><div class="line">            H = min(oS.C, oS.alphas[j] + oS.alphas[i])</div><div class="line">        if L==H: print &quot;L==H&quot;; return 0</div><div class="line">        eta = 2.0 * oS.K[i,j] - oS.K[i,i] - oS.K[j,j] </div><div class="line">        if eta &gt;= 0: print &quot;eta&gt;=0&quot;; return 0</div><div class="line">        oS.alphas[j] -= oS.labelMat[j]*(Ei - Ej)/eta</div><div class="line">        oS.alphas[j] = clipAlpha(oS.alphas[j],H,L)</div><div class="line">        updateEk(oS, j) </div><div class="line">        if (abs(oS.alphas[j] - alphaJold) &lt; 0.00001): print &quot;j not moving enough&quot;; return 0</div><div class="line">        oS.alphas[i] += oS.labelMat[j]*oS.labelMat[i]*(alphaJold - oS.alphas[j])</div><div class="line">        updateEk(oS, i) </div><div class="line">        b1 = oS.b - Ei- oS.labelMat[i]*(oS.alphas[i]-alphaIold)*oS.K[i,i] - oS.labelMat[j]*(oS.alphas[j]-alphaJold)*oS.K[i,j]</div><div class="line">        b2 = oS.b - Ej- oS.labelMat[i]*(oS.alphas[i]-alphaIold)*oS.K[i,j]- oS.labelMat[j]*(oS.alphas[j]-alphaJold)*oS.K[j,j]</div><div class="line">        if (0 &lt; oS.alphas[i]) and (oS.C &gt; oS.alphas[i]): oS.b = b1</div><div class="line">        elif (0 &lt; oS.alphas[j]) and (oS.C &gt; oS.alphas[j]): oS.b = b2</div><div class="line">        else: oS.b = (b1 + b2)/2.0</div><div class="line">        return 1</div><div class="line">    else: return 0</div></pre></td></tr></table></figure>
<p>&#x4E0A;&#x9762;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x51E0;&#x4E4E;&#x4E0E;&#x7B80;&#x5316;&#x7248;&#x4E2D;&#x7684; smoSimple() &#x51FD;&#x6570;&#x4E00;&#x6A21;&#x4E00;&#x6837;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x91CC;&#x7684;&#x4EE3;&#x7801;&#x5DF2;&#x7ECF;&#x4F7F;&#x7528;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x8BE5;&#x7ED3;&#x6784;&#x5728;&#x53C2;&#x6570; oS &#x4E2D;&#x4F20;&#x9012;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x4FEE;&#x6539;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x4E86;&#x8F85;&#x52A9;&#x51FD;&#x6570; selectJ() &#x6765;&#x6539;&#x53D8;&#x7B2C;&#x4E8C;&#x4E2A; alpha &#x7684;&#x503C;&#x3002;&#x6700;&#x540E;&#x5728; alpha &#x503C;&#x6539;&#x53D8;&#x65F6;&#x66F4;&#x65B0; Ecache&#x3002;</p>
<p><strong>&#x5B8C;&#x6574;&#x7248; SMO &#x7684;&#x5916;&#x5FAA;&#x73AF;&#x4EE3;&#x7801;</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div><div class="line">17</div><div class="line">18</div><div class="line">19</div><div class="line">20</div><div class="line">21</div></pre></td><td class="code"><pre><div class="line">def smoP(dataMatIn, classLabels, C, toler, maxIter,kTup=(&apos;lin&apos;, 0)):    </div><div class="line">    oS = optStruct(mat(dataMatIn),mat(classLabels).transpose(),C,toler, kTup)</div><div class="line">    iter = 0</div><div class="line">    entireSet = True; alphaPairsChanged = 0</div><div class="line">    while (iter &lt; maxIter) and ((alphaPairsChanged &gt; 0) or (entireSet)):</div><div class="line">        alphaPairsChanged = 0</div><div class="line">        if entireSet:   </div><div class="line">            for i in range(oS.m):        </div><div class="line">                alphaPairsChanged += innerL(i,oS)</div><div class="line">                print &quot;fullSet, iter: %d i:%d, pairs changed %d&quot; % (iter,i,alphaPairsChanged)</div><div class="line">            iter += 1</div><div class="line">        else:</div><div class="line">            nonBoundIs = nonzero((oS.alphas.A &gt; 0) * (oS.alphas.A &lt; C))[0]</div><div class="line">            for i in nonBoundIs:</div><div class="line">                alphaPairsChanged += innerL(i,oS)</div><div class="line">                print &quot;non-bound, iter: %d i:%d, pairs changed %d&quot; % (iter,i,alphaPairsChanged)</div><div class="line">            iter += 1</div><div class="line">        if entireSet: entireSet = False #toggle entire set loop</div><div class="line">        elif (alphaPairsChanged == 0): entireSet = True  </div><div class="line">        print &quot;iteration number: %d&quot; % iter</div><div class="line">    return oS.b,oS.alphas</div></pre></td></tr></table></figure>
<p>&#x5176;&#x8F93;&#x5165;&#x51FD;&#x6570;&#x4E0E; smoSimple() &#x5B8C;&#x5168;&#x4E00;&#x6837;&#x3002;&#x51FD;&#x6570;&#x4E00;&#x5F00;&#x59CB;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6765;&#x5BB9;&#x7EB3;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x540E;&#x9700;&#x8981;&#x5BF9;&#x63A7;&#x5236;&#x51FD;&#x6570;&#x7684;&#x9000;&#x51FA;&#x7684;&#x4E00;&#x4E9B;&#x53D8;&#x91CF;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x5316;&#x3002;&#x6574;&#x4E2A;&#x4EE3;&#x7801;&#x7684;&#x4E3B;&#x9898;&#x4E5F;&#x662F; while &#x5FAA;&#x73AF;&#xFF0C;&#x4F46;&#x662F;&#x9000;&#x51FA;&#x6761;&#x4EF6;&#x66F4;&#x591A;&#x4E00;&#x4E9B;&#x3002;&#x5F53;&#x8FED;&#x4EE3;&#x6B21;&#x6570;&#x8D85;&#x8FC7;&#x6307;&#x5B9A;&#x6700;&#x5927;&#x503C;&#xFF0C;&#x6216;&#x8005;&#x904D;&#x5386;&#x6574;&#x4E2A;&#x96C6;&#x5408;&#x90FD;&#x672A;&#x5BF9; alpha &#x5BF9;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x65F6;&#xFF0C;&#x5C31;&#x9000;&#x51FA;&#x5FAA;&#x73AF;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9; for &#x5FAA;&#x73AF;&#x5728;&#x975E;&#x8FB9;&#x754C;&#x5FAA;&#x73AF;&#x548C;&#x5B8C;&#x6574;&#x904D;&#x5386;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x5207;&#x6362;&#xFF0C;&#x5E76;&#x6253;&#x5370;&#x51FA;&#x8FED;&#x4EE3;&#x6B21;&#x6570;&#x3002;&#x6700;&#x540E;&#x7A0B;&#x5E8F;&#x4F1A;&#x8FD4;&#x56DE;&#x8FB9;&#x754C;0&#x6216;C&#x4E0A;&#x7684;&#x503C;&#x3002;</p>
<p>&#x5927;&#x5BB6;&#x53EF;&#x80FD;&#x4F1A;&#x60F3;&#xFF0C;&#x521A;&#x624D;&#x6211;&#x4EEC;&#x82B1;&#x4E86;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x6765;&#x8BA1;&#x7B97; alpha &#x503C;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x4F55;&#x5229;&#x7528;&#x4ED6;&#x4EEC;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x5462;&#xFF1F;&#x8FD9;&#x4E0D;&#x6210;&#x95EE;&#x9898;&#xFF0C;&#x9996;&#x5148;&#x5FC5;&#x987B;&#x57FA;&#x4E8E; alpha &#x503C;&#x5F97;&#x5230;&#x8D85;&#x5E73;&#x9762;&#xFF0C;&#x8FD9;&#x4E5F;&#x5305;&#x62EC;&#x4E86; w &#x7684;&#x8BA1;&#x7B97;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4E00;&#x4E2A;&#x5C0F;&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x4E0A;&#x8BC9;&#x4EFB;&#x52A1;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div></pre></td><td class="code"><pre><div class="line">def calcWs(alphas,dataArr,classLabels):</div><div class="line">    X = mat(dataArr); labelMat = mat(classLabels).transpose()</div><div class="line">    m,n = shape(X)</div><div class="line">    w = zeros((n,1))</div><div class="line">    for i in range(m):</div><div class="line">        w += multiply(alphas[i]*labelMat[i],X[i,:].T)</div><div class="line">    return w</div></pre></td></tr></table></figure>
<p>&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x6210;&#x529F;&#x8BAD;&#x7EC3;&#x51FA;&#x5206;&#x7C7B;&#x5668;&#x4E86;&#xFF0C;&#x6211;&#x60F3;&#x6307;&#x51FA;&#x7684;&#x5C31;&#x662F;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x4E24;&#x4E2A;&#x7C7B;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x70B9;&#x5206;&#x5E03;&#x5728;&#x4E00;&#x6761;&#x76F4;&#x7EBF;&#x7684;&#x4E24;&#x8FB9;&#x3002;&#x4F46;&#x662F;&#x5018;&#x82E5;&#x4E24;&#x7C7B;&#x6570;&#x636E;&#x70B9;&#x5206;&#x522B;&#x5206;&#x5E03;&#x5728;&#x4E00;&#x4E2A;&#x5706;&#x7684;&#x5185;&#x90E8;&#x4E0E;&#x5916;&#x90E8;&#xFF0C;&#x90A3;&#x4E48;&#x4F1A;&#x5F97;&#x5230;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x7684;&#x5206;&#x7C7B;&#x9762;&#x5462;&#xFF1F;&#x4E0B;&#x9762;&#x6211;&#x4F1A;&#x4ECB;&#x7ECD;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x5BF9;&#x5206;&#x7C7B;&#x5668;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#xFF0C;&#x4EE5;&#x8BF4;&#x660E;&#x7C7B;&#x522B;&#x533A;&#x57DF;&#x5F62;&#x72B6;&#x4E0D;&#x540C;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x6570;&#x636E;&#x96C6;&#x5206;&#x9694;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="&#x5728;&#x590D;&#x6742;&#x6570;&#x636E;&#x4E0A;&#x4F7F;&#x7528;&#x6838;&#x51FD;&#x6570;"><a href="#&#x5728;&#x590D;&#x6742;&#x6570;&#x636E;&#x4E0A;&#x4F7F;&#x7528;&#x6838;&#x51FD;&#x6570;" class="headerlink" title="&#x5728;&#x590D;&#x6742;&#x6570;&#x636E;&#x4E0A;&#x4F7F;&#x7528;&#x6838;&#x51FD;&#x6570;"></a>&#x5728;&#x590D;&#x6742;&#x6570;&#x636E;&#x4E0A;&#x4F7F;&#x7528;&#x6838;&#x51FD;&#x6570;</h2><p>&#x8FD9;&#x91CC;&#x6211;&#x4E3B;&#x8981;&#x4ECB;&#x7ECD;&#x7684;&#x662F;<strong>&#x5F84;&#x5411;&#x57FA;&#x6838;&#x51FD;&#x6570;</strong>&#xFF0C;&#x5173;&#x4E8E;&#x6838;&#x51FD;&#x6570;&#x7684;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x8FD8;&#x662F;&#x53C2;&#x89C1;&#x672C;&#x6587;&#x5F00;&#x5934;&#x7684;&#x90A3;&#x4E2A;&#x8FDE;&#x63A5;&#x7684;&#x6587;&#x7AE0;&#x3002;</p>
<p><strong>&#x6838;&#x51FD;&#x6570;&#x7684;&#x539F;&#x7406;&#x2013;&#x5C06;&#x6570;&#x636E;&#x6620;&#x5C04;&#x5230;&#x9AD8;&#x7EF4;&#x7A7A;&#x95F4;</strong></p>
<p>&#x4ECE;&#x67D0;&#x4E2A;&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#x7684;&#x6620;&#x5C04;&#x662F;&#x901A;&#x8FC7;&#x6838;&#x51FD;&#x6570;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x628A;&#x6838;&#x51FD;&#x6570;&#x60F3;&#x8C61;&#x4E3A;&#x4E00;&#x4E2A;<strong>&#x5305;&#x88C5;&#x5668;(wrapper)</strong>&#x6216;&#x8005;&#x662F;<strong>&#x63A5;&#x53E3;(interface)</strong>&#xFF0C;&#x5B83;&#x80FD;&#x628A;&#x6570;&#x636E;&#x4ECE;&#x67D0;&#x4E2A;&#x96BE;&#x5904;&#x7406;&#x7684;&#x5F62;&#x5F0F;&#x8F6C;&#x6362;&#x4E3A;&#x53E6;&#x4E00;&#x4E2A;&#x8F83;&#x5BB9;&#x6613;&#x5904;&#x7406;&#x7684;&#x5F62;&#x5F0F;&#x3002;&#x5982;&#x679C;&#x4E0A;&#x8BC9;&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#x542C;&#x8D77;&#x6765;&#x5F88;&#x6A21;&#x7CCA;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x5C06;&#x5B83;&#x60F3;&#x8C61;&#x6210;&#x4E00;&#x79CD;&#x8BA1;&#x7B97;&#x8DDD;&#x79BB;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x524D;&#x9762;&#x6211;&#x4EEC;&#x63D0;&#x5230;&#x8FC7;&#x8DDD;&#x79BB;&#x8BA1;&#x7B97;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x8DDD;&#x79BB;&#x8BA1;&#x7B97;&#x7684;&#x65B9;&#x6CD5;&#x6709;&#x5F88;&#x591A;&#x79CD;&#xFF0C;&#x6838;&#x51FD;&#x6570;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x79CD;&#x3002;&#x7ECF;&#x8FC7;&#x7A7A;&#x95F4;&#x8F6C;&#x6362;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x9AD8;&#x7EF4;&#x7A7A;&#x95F4;&#x4E2D;&#x89E3;&#x51B3;&#x7EBF;&#x6027;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E5F;&#x5C31;&#x7B49;&#x4EF7;&#x4E8E;&#x5728;&#x4F4E;&#x7EF4;&#x7A7A;&#x95F4;&#x4E2D;&#x89E3;&#x51B3;&#x975E;&#x7EBF;&#x6027;&#x95EE;&#x9898;&#x3002;</p>
<p>SVM &#x4F18;&#x5316;&#x4E2D;&#x4E00;&#x4E2A;&#x7279;&#x522B;&#x597D;&#x7684;&#x5730;&#x65B9;&#x5C31;&#x662F;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x8FD0;&#x7B97;&#x90FD;&#x53EF;&#x4EE5;&#x5199;&#x6210;<strong>&#x5185;&#x79EF;(inner product &#x6216;&#x8005;&#x70B9;&#x79EF;)</strong>&#x7684;&#x5F62;&#x5F0F;&#x3002;&#x5411;&#x91CF;&#x7684;&#x5185;&#x79EF;&#x503C;&#x7684;&#x662F;&#x4E24;&#x4E2A;&#x5411;&#x91CF;&#x76F8;&#x4E58;&#xFF0C;&#x4E4B;&#x540E;&#x5F97;&#x5230;&#x5355;&#x4E2A;&#x6807;&#x91CF;&#x6216;&#x8005;&#x6570;&#x503C;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;&#x5185;&#x79EF;&#x8FD0;&#x7B97;&#x66FF;&#x6362;&#x6210;&#x6838;&#x51FD;&#x6570;&#xFF0C;&#x800C;&#x4E0D;&#x505A;&#x7B80;&#x5316;&#x5904;&#x7406;&#x3002;&#x5C06;&#x5185;&#x79EF;&#x66FF;&#x6362;&#x4E3A;&#x6838;&#x51FD;&#x6570;&#x7684;&#x65B9;&#x5F0F;&#x79F0;&#x4E3A;<strong>&#x6838;&#x6280;&#x5DE7;(kernal trick)</strong>&#x3002;</p>
<p>&#x6838;&#x51FD;&#x6570;&#x5E76;&#x4E0D;&#x4EC5;&#x4EC5;&#x652F;&#x6301; SVM&#xFF0C;&#x5F88;&#x591A;&#x5176;&#x4ED6;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x90FD;&#x7528;&#x5230;&#x6838;&#x51FD;&#x6570;&#x3002;</p>
<p><strong>&#x5F84;&#x5411;&#x57FA;&#x6838;&#x51FD;&#x6570;</strong></p>
<p>&#x5F84;&#x5411;&#x57FA;&#x6838;&#x51FD;&#x6570;&#x662F; SVM &#x4E2D;&#x5E38;&#x7528;&#x7684;&#x4E00;&#x4E2A;&#x6838;&#x51FD;&#x6570;&#x3002;&#x5F84;&#x5411;&#x57FA;&#x51FD;&#x6570;&#x662F;&#x4E00;&#x4E2A;&#x91C7;&#x7528;&#x5411;&#x91CF;&#x4F5C;&#x4E3A;&#x81EA;&#x53D8;&#x91CF;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x80FD;&#x591F;&#x57FA;&#x4E8E;&#x5411;&#x91CF;&#x8DDD;&#x79BB;&#x8FD0;&#x7B97;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x6807;&#x91CF;&#x3002;&#x8FD9;&#x4E2A;&#x8DDD;&#x79BB;&#x53EF;&#x4EE5;&#x662F;&#x4ECE; <0,0> &#x5411;&#x91CF;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x5411;&#x91CF;&#x5F00;&#x59CB;&#x8BA1;&#x7B97;&#x7684;&#x8DDD;&#x79BB;&#x3002;</0,0></p>
<p>&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x4F7F;&#x7528;&#x5F84;&#x5411;&#x57FA;&#x6838;&#x51FD;&#x6570;&#xFF0C;&#x5C31;&#x8981;&#x5728;&#x539F;&#x4EE3;&#x7801;&#x4E2D;&#x8FDB;&#x884C;&#x9002;&#x5F53;&#x7684;&#x4FEE;&#x6539;&#x3002;</p>
<p><strong>&#x6838;&#x8F6C;&#x6362;&#x51FD;&#x6570;</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div><div class="line">17</div><div class="line">18</div><div class="line">19</div><div class="line">20</div><div class="line">21</div><div class="line">22</div><div class="line">23</div><div class="line">24</div></pre></td><td class="code"><pre><div class="line">def kernalTrains(X, A, kTup):</div><div class="line">    m, n = shape(X)</div><div class="line">    K = mat(zeros((m,1)))</div><div class="line">    if kTup[0] == &apos;lin&apos;: </div><div class="line">        K = X * A.T</div><div class="line">    elif kTup[0] == &apos;rbf&apos;:</div><div class="line">        for j in range(m):</div><div class="line">            deltaRow = X[j,:] - A</div><div class="line">            K[j] = deltaRow * deltaRow.T</div><div class="line">        K = exp(K / (-1*kTup[1]**2))</div><div class="line">    else:</div><div class="line">        raise NameError(&apos;Wrong&apos;)</div><div class="line">    return K</div><div class="line"></div><div class="line">class optStructK:</div><div class="line">    def __init__(self,dataMatIn, classLabels, C, toler):  # Initialize the structure with the parameters </div><div class="line">        self.X = dataMatIn</div><div class="line">        self.labelMat = classLabels</div><div class="line">        self.C = C</div><div class="line">        self.tol = toler</div><div class="line">        self.m = shape(dataMatIn)[0]</div><div class="line">        self.alphas = mat(zeros((self.m,1)))</div><div class="line">        self.b = 0</div><div class="line">        self.eCache = mat(zeros((self.m,2)))</div></pre></td></tr></table></figure>
<p>&#x5728;&#x521D;&#x59CB;&#x5316;&#x65B9;&#x6CD5;&#x7ED3;&#x675F;&#x540E;&#xFF0C;&#x77E9;&#x9635;K&#x5148;&#x88AB;&#x5EFA;&#x7ACB;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x901A;&#x8FC7;&#x8C03;&#x7528;&#x51FD;&#x6570; kernalTrains() &#x8FDB;&#x884C;&#x586B;&#x5145;&#x3002;&#x5168;&#x5C40;&#x7684;K&#x53EA;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x4E00;&#x6B21;&#x3002;&#x7136;&#x540E;&#x5F53;&#x60F3;&#x4F7F;&#x7528;&#x6838;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5BF9;&#x5B83;&#x8FDB;&#x884C;&#x8C03;&#x7528;&#x3002;</p>
<p>&#x6700;&#x540E;&#x5982;&#x679C;&#x9047;&#x5230;&#x4E00;&#x4E2A;&#x65E0;&#x6CD5;&#x8BC6;&#x522B;&#x7684;&#x5143;&#x7EC4;&#xFF0C;&#x7A0B;&#x5E8F;&#x4F1A;&#x629B;&#x51FA;&#x4E00;&#x4E2A;&#x5F02;&#x5E38;&#x3002;</p>
<p>&#x540C;&#x65F6;&#xFF0C;&#x4E3A;&#x4E86;&#x4F7F;&#x7528;&#x6838;&#x51FD;&#x6570;&#xFF0C;&#x5148;&#x524D;&#x7684; innerL() &#x4E0E; calcEk() &#x51FD;&#x6570;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x4FEE;&#x6539;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div><div class="line">17</div><div class="line">18</div><div class="line">19</div><div class="line">20</div><div class="line">21</div><div class="line">22</div><div class="line">23</div><div class="line">24</div><div class="line">25</div><div class="line">26</div><div class="line">27</div><div class="line">28</div><div class="line">29</div><div class="line">30</div><div class="line">31</div><div class="line">32</div></pre></td><td class="code"><pre><div class="line">def innerLK(i, oS):</div><div class="line">    Ei = calcEk(oS, i)</div><div class="line">    if ((oS.labelMat[i]*Ei &lt; -oS.tol) and (oS.alphas[i] &lt; oS.C)) or ((oS.labelMat[i]*Ei &gt; oS.tol) and (oS.alphas[i] &gt; 0)):</div><div class="line">        j,Ej = selectJ(i, oS, Ei) #this has been changed from selectJrand</div><div class="line">        alphaIold = oS.alphas[i].copy(); alphaJold = oS.alphas[j].copy();</div><div class="line">        if (oS.labelMat[i] != oS.labelMat[j]):</div><div class="line">            L = max(0, oS.alphas[j] - oS.alphas[i])</div><div class="line">            H = min(oS.C, oS.C + oS.alphas[j] - oS.alphas[i])</div><div class="line">        else:</div><div class="line">            L = max(0, oS.alphas[j] + oS.alphas[i] - oS.C)</div><div class="line">            H = min(oS.C, oS.alphas[j] + oS.alphas[i])</div><div class="line">        if L==H: print &quot;L==H&quot;; return 0</div><div class="line">        eta = 2.0 * oS.X[i,:]*oS.X[j,:].T - oS.X[i,:]*oS.X[i,:].T - oS.X[j,:]*oS.X[j,:].T</div><div class="line">        if eta &gt;= 0: print &quot;eta&gt;=0&quot;; return 0</div><div class="line">        oS.alphas[j] -= oS.labelMat[j]*(Ei - Ej)/eta</div><div class="line">        oS.alphas[j] = clipAlpha(oS.alphas[j],H,L)</div><div class="line">        updateEk(oS, j) #added this for the Ecache</div><div class="line">        if (abs(oS.alphas[j] - alphaJold) &lt; 0.00001): print &quot;j not moving enough&quot;; return 0</div><div class="line">        oS.alphas[i] += oS.labelMat[j]*oS.labelMat[i]*(alphaJold - oS.alphas[j])#update i by the same amount as j</div><div class="line">        updateEk(oS, i) #added this for the Ecache                    #the update is in the oppostie direction</div><div class="line">        b1 = oS.b - Ei- oS.labelMat[i]*(oS.alphas[i]-alphaIold)*oS.X[i,:]*oS.X[i,:].T - oS.labelMat[j]*(oS.alphas[j]-alphaJold)*oS.X[i,:]*oS.X[j,:].T</div><div class="line">        b2 = oS.b - Ej- oS.labelMat[i]*(oS.alphas[i]-alphaIold)*oS.X[i,:]*oS.X[j,:].T - oS.labelMat[j]*(oS.alphas[j]-alphaJold)*oS.X[j,:]*oS.X[j,:].T</div><div class="line">        if (0 &lt; oS.alphas[i]) and (oS.C &gt; oS.alphas[i]): oS.b = b1</div><div class="line">        elif (0 &lt; oS.alphas[j]) and (oS.C &gt; oS.alphas[j]): oS.b = b2</div><div class="line">        else: oS.b = (b1 + b2)/2.0</div><div class="line">        return 1</div><div class="line">    else: return 0</div><div class="line"></div><div class="line">def calcEkK(oS, k):</div><div class="line">    fXk = float(multiply(oS.alphas,oS.labelMat).T*(oS.X*oS.X[k,:].T)) + oS.b</div><div class="line">    Ek = fXk - float(oS.labelMat[k])</div><div class="line">    return Ek</div></pre></td></tr></table></figure>
<h2 id="&#x5C0F;&#x7ED3;"><a href="#&#x5C0F;&#x7ED3;" class="headerlink" title="&#x5C0F;&#x7ED3;"></a>&#x5C0F;&#x7ED3;</h2><p>SVM &#x662F;&#x4E00;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#x3002;&#x4E4B;&#x6240;&#x4EE5;&#x6210;&#x4E3A;&#x201C;machine&#x201D;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x4E8C;&#x503C;&#x51B3;&#x7B56;&#x6548;&#x679C;&#xFF0C;&#x5373;&#x662F;&#x4E00;&#x79CD;&#x51B3;&#x7B56;&#x201C;&#x673A;&#x201D;&#x3002;SVM&#x7684;&#x6CDB;&#x5316;&#x9519;&#x8BEF;&#x7387;&#x4F4E;&#xFF0C;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#x5B83;&#x6709;&#x7740;&#x826F;&#x597D;&#x7684;&#x5B66;&#x4E60;&#x80FD;&#x529B;&#xFF0C;&#x4E14;&#x5F97;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x5177;&#x6709;&#x5F88;&#x597D;&#x7684;&#x63A8;&#x5E7F;&#x6027;&#x3002;&#x8FD9;&#x4E9B;&#x4F18;&#x70B9;&#x4F7F;&#x5F97;SVM&#x5341;&#x5206;&#x6D41;&#x884C;&#x3002;</p>
<p>SVM &#x7684;&#x4E3B;&#x8981;&#x6C42;&#x89E3;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x8BD5;&#x56FE;&#x901A;&#x8FC7;&#x6C42;&#x89E3;&#x4E00;&#x4E2A;&#x4E8C;&#x6B21;&#x4F18;&#x5316;&#x95EE;&#x9898;&#x6765;&#x6700;&#x5927;&#x5316;&#x5206;&#x7C7B;&#x95F4;&#x9694;&#x3002;</p>
<p>&#x6838;&#x65B9;&#x6CD5;&#x4F1A;&#x5C06;&#x6570;&#x636E;&#x4ECE;&#x4E00;&#x4E2A;&#x4F4E;&#x7EF4;&#x7A7A;&#x95F4;&#x6620;&#x5C04;&#x5230;&#x4E00;&#x4E2A;&#x9AD8;&#x7EF4;&#x7A7A;&#x95F4;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x4E00;&#x4E2A;&#x5728;&#x4F4E;&#x7EF4;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x975E;&#x7EBF;&#x6027;&#x95EE;&#x9898;&#x8F6C;&#x6362;&#x4E3A;&#x9AD8;&#x7EF4;&#x7A7A;&#x95F4;&#x4E0B;&#x7684;&#x7EBF;&#x6027;&#x95EE;&#x9898;&#x6C42;&#x89E3;&#x3002;</p>
<p>SVM &#x662F;&#x4E00;&#x4E2A;&#x4E8C;&#x7C7B;&#x5206;&#x7C7B;&#x5668;&#x3002;&#x5F53;&#x7528;&#x5176;&#x89E3;&#x51B3;&#x591A;&#x7C7B;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x989D;&#x5916;&#x7684;&#x65B9;&#x6CD5;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x6269;&#x5C55;&#x3002;&#x8FD9;&#x70B9;&#x6211;&#x5728;&#x672C;&#x7BC7;&#x6587;&#x7AE0;&#x5F00;&#x5934;&#x65F6;&#x7684;&#x90A3;&#x4E2A;&#x8FDE;&#x63A5;&#x6587;&#x7AE0;&#x4E2D;&#x7684;&#x6700;&#x540E;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x4E86;&#x3002;</p>
<p>&#x770B;&#xFF0C;&#x5176;&#x5B9E;&#x652F;&#x6301;&#x5411;&#x91CF;&#x673A;&#x4E0E;&#x6838;&#x51FD;&#x6570;&#x4E3B;&#x8981;&#x5C31;&#x8FD9;&#x4E9B;&#x3002;</p>

      
    </div><!-- .entry-content -->

    <footer class="entry-meta">
    <a href="/2017/04/17/支持向量机/">
    <time datetime="2017-04-17T08:53:54.000Z" class="entry-date">
        2017-04-17
    </time>
</a>
    
  <span class="article-delim">&#8226;</span>
  <div class="article-category">
  <a class="article-category-link" href="/categories/ML/">ML</a>
  </div>

    
  <span class="article-delim">&#8226;</span>
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/Machine-Learning/">Machine Learning</a></li></ul>

    </footer>
</article>


    
<nav class="nav-single">
    <h3 class="assistive-text">文章导航</h3>
    
        <span class="nav-previous"><a href="/2017/04/21/模拟退火/" rel="prev"><span class="meta-nav">←</span> 模拟退火</a></span>
    
    
        <span class="nav-next"><a href="/2017/04/01/RBF-径向基函数网络-1/" rel="next">详细谈谈RBF-1 <span class="meta-nav">→</span></a></span>
    
</nav><!-- .nav-single -->







</div></div>
        <div id="secondary" class="widget-area" role="complementary">
  
    <aside id="search" class="widget widget_search"><form role="search" method="get" accept-charset="utf-8" id="searchform" class="searchform" action="//google.com/search">
    <div>
        <input type="text" value="" name="s" id="s" />
        <input type="submit" id="searchsubmit" value="搜索" />
    </div>
</form></aside>
  
    
  
    
  <aside class="widget">
    <h3 class="widget-title">Categories</h3>
    <div class="widget-content">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/LIFE/">LIFE</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/MAC/">MAC</a><span class="category-list-count">3</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/ML/">ML</a><span class="category-list-count">19</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/PGM/">PGM</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/iOS/">iOS</a><span class="category-list-count">22</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/御宅文化/">御宅文化</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/编程/">编程</a><span class="category-list-count">58</span></li></ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Recents</h3>
    <div class="widget-content">
      <ul>
        
          <li>
            <a href="/2017/09/28/Cloud-Service-Models/">Cloud Service Models</a>
          </li>
        
          <li>
            <a href="/2017/09/18/Cloud-Introduction/">Cloud Introduction</a>
          </li>
        
          <li>
            <a href="/2017/09/07/中断以及中断处理/">中断以及中断处理</a>
          </li>
        
          <li>
            <a href="/2017/07/19/MapReduce-and-Hadoop/">MapReduce &amp; Hadoop</a>
          </li>
        
          <li>
            <a href="/2017/05/15/二维码/">详细谈谈二维码生成原理与编码（一）</a>
          </li>
        
      </ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Tags</h3>
    <div class="widget-content">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/Cloud-Computing/">Cloud Computing</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Cocoapods/">Cocoapods</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/HTML/">HTML</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Linux/">Linux</a><span class="tag-list-count">15</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Machine-Learning/">Machine Learning</a><span class="tag-list-count">17</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Matlab/">Matlab</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Probabilistic-Graphical-Models/">Probabilistic Graphical Models</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIColor/">UIColor</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView/">UIView</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView-圆角/">UIView-圆角</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Vim/">Vim</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/bug/">bug</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/hexo/">hexo</a><span class="tag-list-count">4</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/openCV/">openCV</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/二维码/">二维码</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/指针/">指针</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/操作系统/">操作系统</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/数据库/">数据库</a><span class="tag-list-count">3</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/数据结构/">数据结构</a><span class="tag-list-count">20</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/算法/">算法</a><span class="tag-list-count">9</span></li></ul>
    </div>
  </aside>

  
    
<div class="widget tag">
<h3 class="title">blogroll</h3>
<ul class="entry">


<li><a href="https://github.com/" target="_blank">github</a></li>


<li><a href="http://www.jianshu.com/users/41cd7711ed44/latest_articles" target="_blank">我的简书主页</a></li>

</ul>
</div>

  
</div>
      </div>
      <footer id="colophon" role="contentinfo">
    <p>&copy; 2017 SaberDa
    All rights reserved.</p>
    <p>Powered by <a href="http://hexo.io/" target="_blank">Hexo</a></p>
</footer>
    <script>window._bd_share_config={"common":{"bdSnsKey":{},"bdText":"","bdMini":"1","bdMiniList":false,"bdPic":"","bdStyle":"2","bdSize":"16"},"share":{}};with(document)0[(getElementsByTagName('head')[0]||body).appendChild(createElement('script')).src='http://bdimg.share.baidu.com/static/api/js/share.js?v=89860593.js?cdnversion='+~(-new Date()/36e5)];</script>

<script src="/js/jquery-2.0.3.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

<script src="/js/navigation.js"></script>

<div id="bg"></div>

  </div>
</body>
</html>