<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  
  <meta name="description" content="阿尔托利亚是我老婆~" />
  

  
  
  
  
  
  
  <title>不有行者，无以图将来 | SaberDa的幻想乡</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x8FD9;&amp;#x7BC7;&amp;#x6587;&amp;#x7AE0;&amp;#x662F;&amp;#x6211;&amp;#x4E3A;&amp;#x4E86;&amp;#x8FD1;&amp;#x4EE3;&amp;#x53F2;&amp;#x6F14;&amp;#x8BB2;&amp;#x800C;&amp;#x5199;&amp;#x7684;&amp;#x4E00;&amp;#x7BC7;&amp;#x6F14;&amp;#x8BB2;&amp;#x7A3F;&amp;#xFF0C;&amp;#x4EC5;&amp;#x6B64;&amp;#x800C;">
<meta property="og:type" content="article">
<meta property="og:title" content="不有行者，无以图将来">
<meta property="og:url" content="https://saberda.github.io/2016/10/17/近代史演讲稿/index.html">
<meta property="og:site_name" content="SaberDa的幻想乡">
<meta property="og:description" content="&amp;#x8FD9;&amp;#x7BC7;&amp;#x6587;&amp;#x7AE0;&amp;#x662F;&amp;#x6211;&amp;#x4E3A;&amp;#x4E86;&amp;#x8FD1;&amp;#x4EE3;&amp;#x53F2;&amp;#x6F14;&amp;#x8BB2;&amp;#x800C;&amp;#x5199;&amp;#x7684;&amp;#x4E00;&amp;#x7BC7;&amp;#x6F14;&amp;#x8BB2;&amp;#x7A3F;&amp;#xFF0C;&amp;#x4EC5;&amp;#x6B64;&amp;#x800C;">
<meta property="og:updated_time" content="2016-10-23T14:52:06.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="不有行者，无以图将来">
<meta name="twitter:description" content="&amp;#x8FD9;&amp;#x7BC7;&amp;#x6587;&amp;#x7AE0;&amp;#x662F;&amp;#x6211;&amp;#x4E3A;&amp;#x4E86;&amp;#x8FD1;&amp;#x4EE3;&amp;#x53F2;&amp;#x6F14;&amp;#x8BB2;&amp;#x800C;&amp;#x5199;&amp;#x7684;&amp;#x4E00;&amp;#x7BC7;&amp;#x6F14;&amp;#x8BB2;&amp;#x7A3F;&amp;#xFF0C;&amp;#x4EC5;&amp;#x6B64;&amp;#x800C;">
  
  
    <link rel="icon" href="/css/images/favicon.ico">
  
  <link rel="stylesheet" href="/css/style.css">
  

  
  <!-- baidu webmaster push -->
  <script src='//push.zhanzhang.baidu.com/push.js'></script>
</head>
<body class="home blog custom-background custom-font-enabled single-author">
  <div id="page" class="hfeed site">
      <header id="masthead" class="site-header" role="banner">
    <hgroup>
      <h1 class="site-title">
        <a href="/" title="SaberDa的幻想乡" rel="home">SaberDa的幻想乡</a>
      </h1>
      
        <h2 class="site-description">
          <a href="/" id="subtitle">　　iOS　　|　　二次元　　|　　630991493@qq.com　　|　　没人是真正高冷的 只不过暖的不再是你</a>
        </h2>
      
    </hgroup>

    <nav id="site-navigation" class="main-navigation" role="navigation">
            <button class="menu-toggle">菜单</button>
            <a class="assistive-text" href="/#content" title="跳至内容">跳至内容</a><!--TODO-->
            <div class="menu-main-container">
                <ul id="menu-main" class="nav-menu">
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/archives">所有文章</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/">主页</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/编程/">编程</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/iOS/">iOS</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/MAC/">MAC</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/御宅文化/">御宅文化</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/LIFE/">LIFE</a></li>
                
                </ul>
            </div>
    </nav>
</header>
      <div id="main" class="wrapper">
        <div id="primary" class="site-content"><div id="content" role="main"><article id="post-近代史演讲稿" class="post-近代史演讲稿 post type-post status-publish format-standard hentry">
    <!---->

      <header class="entry-header">
        
        
  
    <h1 class="entry-title article-title">
      不有行者，无以图将来
    </h1>
  

        
        <div class="comments-link">
            
            <a href="javascript:void(0);" data-url="https://saberda.github.io/2016/10/17/近代史演讲稿/" data-id="civmducf70068t5b3v62xcwjg" class="leave-reply bdsharebuttonbox" data-cmd="more">Share</a>
        </div><!-- .comments-link -->
      </header><!-- .entry-header -->

    <div class="entry-content">
      
        <pre><code>&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x662F;&#x6211;&#x4E3A;&#x4E86;&#x8FD1;&#x4EE3;&#x53F2;&#x6F14;&#x8BB2;&#x800C;&#x5199;&#x7684;&#x4E00;&#x7BC7;&#x6F14;&#x8BB2;&#x7A3F;&#xFF0C;&#x4EC5;&#x6B64;&#x800C;&#x5DF2;
</code></pre><h2 id="&#x4E0D;&#x6709;&#x884C;&#x8005;&#xFF0C;&#x65E0;&#x4EE5;&#x56FE;&#x5C06;&#x6765;"><a href="#&#x4E0D;&#x6709;&#x884C;&#x8005;&#xFF0C;&#x65E0;&#x4EE5;&#x56FE;&#x5C06;&#x6765;" class="headerlink" title="&#x4E0D;&#x6709;&#x884C;&#x8005;&#xFF0C;&#x65E0;&#x4EE5;&#x56FE;&#x5C06;&#x6765;"></a>&#x4E0D;&#x6709;&#x884C;&#x8005;&#xFF0C;&#x65E0;&#x4EE5;&#x56FE;&#x5C06;&#x6765;</h2><pre><code>&#x7EAA;&#x5FF5;&#x9769;&#x547D;&#x5148;&#x9A71;&#x8C2D;&#x55E3;&#x540C;
</code></pre><a id="more"></a>
<p>&#x5728;&#x620A;&#x620C;&#x53D8;&#x6CD5;&#x5931;&#x8D25;&#x540E;&#xFF0C;&#x8C2D;&#x55E3;&#x540C;&#x7684;&#x5BFC;&#x5E08;&#x6881;&#x542F;&#x8D85;&#x66FE;&#x7ECF;&#x5EFA;&#x8BAE;&#x4ED6;&#xFF0C;&#x9003;&#x5230;&#x65E5;&#x672C;&#x53BB;&#x5427;&#x3002;&#x8C2D;&#x55E3;&#x540C;&#x4EC5;&#x7528;&#x4E8C;&#x5341;&#x516D;&#x4E2A;&#x5B57;&#x56DE;&#x7B54;&#xFF1A;&#x201C;<em>&#x4E0D;&#x6709;&#x884C;&#x8005;&#xFF0C;&#x65E0;&#x4EE5;&#x56FE;&#x5C06;&#x6765;&#xFF1B;&#x4E0D;&#x6709;&#x6B7B;&#x8005;&#xFF0C;&#x65E0;&#x4EE5;&#x62DB;&#x540E;&#x8D77;&#x3002;&#x541B;&#x884C;&#x5176;&#x96BE;&#xFF0C;&#x543E;&#x884C;&#x5176;&#x6613;</em>&#x3002;&#x201D;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x6211;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x9898;&#x76EE;&#x7684;&#x7531;&#x6765;&#x3002;<br>&#x8C2D;&#x55E3;&#x540C;&#x8FD9;&#x4E2A;&#x4EBA;&#x7684;&#x4E00;&#x751F;&#x5C31;&#x662F;&#x4E00;&#x7BC7;&#x60CA;&#x4EBA;&#x7684;&#x53F2;&#x8BD7;&#xFF0C;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7528;&#x4E00;&#x7BC7;&#x4EC5;&#x4EC5;20&#x5206;&#x949F;&#x7684;&#x6F14;&#x8BB2;&#x4ECB;&#x7ECD;&#x5B8C;&#x7684;&#xFF0C;&#x5F53;&#x7136;&#x6211;&#x7684;&#x4E3B;&#x9898;&#x4E5F;&#x4E0D;&#x662F;&#x4ECB;&#x7ECD;&#x8C2D;&#x55E3;&#x540C;&#x5766;&#x5766;&#x8361;&#x8361;&#x7684;&#x4EBA;&#x751F;&#x7684;&#x3002;&#x5177;&#x4F53;&#x6211;&#x8BB2;&#x4EC0;&#x4E48;&#xFF0C;&#x8BF7;&#x542C;&#x6211;&#x5A13;&#x5A13;&#x9053;&#x6765;&#x3002;</p>
<p>1898&#x5E74;9&#x6708;28&#x65E5;&#xFF0C;&#x8C2D;&#x55E3;&#x540C;&#x7B49;&#x620A;&#x620C;&#x516D;&#x541B;&#x5B50;&#x88AB;&#x6740;&#x5BB3;&#x4E8E;&#x5317;&#x4EAC;&#x83DC;&#x5E02;&#x53E3;&#x5211;&#x573A;&#x3002;&#x4E00;&#x6B21;&#x6C11;&#x65CF;&#x53D8;&#x9769;&#x56FE;&#x5B58;&#x7684;&#x7EF4;&#x65B0;&#x53D8;&#x6CD5;&#x767E;&#x65E5;&#x800C;&#x6B62;&#x3002;&#x4E16;&#x4E0A;&#x4E00;&#x5207;&#x4E8B;&#x7269;&#x7686;&#x56E0;&#x4EF7;&#x503C;&#x800C;&#x5B58;&#x5728;&#xFF0C;&#x6B7B;&#x4EA1;&#x4E5F;&#x4E0D;&#x4F8B;&#x5916;&#x3002;&#x672A;&#x6709;&#x6B7B;&#x8005;&#xFF0C;&#x65E0;&#x4EE5;&#x62DB;&#x540E;&#x8D77;&#x3002;&#x6015;&#x5C31;&#x6015;&#xFF0C;&#x6B7B;&#x4E86;&#x5374;&#x65E0;&#x4EBA;&#x60E6;&#x8BB0;&#xFF0C;&#x8840;&#x8350;&#x8F69;&#x8F95;&#x6210;&#x4E3A;&#x4E86;&#x4E00;&#x4EF6;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;&#x4E8B;&#x3002;&#x81F3;&#x5C11;&#xFF0C;&#x8C2D;&#x55E3;&#x540C;&#x7684;&#x6B7B;&#x5B9E;&#x73B0;&#x4E86;&#x4ED6;&#x201C;&#x62DB;&#x540E;&#x8D77;&#x201D;&#x201C;&#x62A5;&#x5723;&#x4E3B;&#x201D;&#x7684;&#x5919;&#x613F;&#x3002;</p>
<p>&#x5728;&#x8C2D;&#x55E3;&#x540C;&#x7B49;&#x4EBA;&#x5C31;&#x4E49;&#x540E;&#x4E00;&#x5E74;&#xFF0C;&#x516B;&#x56FD;&#x8054;&#x519B;&#x5360;&#x9886;&#x5317;&#x4EAC;&#xFF0C;&#x533A;&#x533A;&#x5341;&#x4E09;&#x5E74;&#x540E;&#x5927;&#x6E05;&#x706D;&#x4EA1;&#x3002;&#x4E00;&#x4E2A;&#x653F;&#x6743;&#x5F00;&#x59CB;&#x5927;&#x8086;&#x6355;&#x6740;&#x4EC1;&#x4EBA;&#x5FD7;&#x58EB;&#x3001;&#x56FD;&#x5BB6;&#x680B;&#x6881;&#x65F6;&#xFF0C;&#x5DF2;&#x4E3A;&#x653F;&#x6743;&#x7684;&#x8986;&#x706D;&#x57CB;&#x4E0B;&#x4E86;&#x590D;&#x4EC7;&#x7684;&#x79CD;&#x5B50;&#x3002;&#x738B;&#x671D;&#x8986;&#x706D;&#x7684;&#x5386;&#x53F2;&#x50CF;&#x5E7B;&#x706F;&#x7247;&#x4E00;&#x6837;&#x4E0D;&#x65AD;&#x7684;&#x91CD;&#x6F14;&#x3002;&#x5D07;&#x796F;&#x4E09;&#x5E74;&#xFF0C;1901&#x5E74;9&#x6708;22&#x65E5;&#xFF0C;&#x660E;&#x738B;&#x671D;&#x5728;&#x6740;&#x6389;&#x6587;&#x5B98;&#x5C06;&#x9886;&#x8881;&#x5D07;&#x7115;&#x540E;&#x5341;&#x4E09;&#x5E74;&#xFF0C;&#x5927;&#x660E;&#x706D;&#x4EA1;&#x3002;&#x6B63;&#x6240;&#x8C13;&#x4EE5;&#x53F2;&#x4E3A;&#x955C;&#xFF0C;&#x4F46;&#x771F;&#x6B63;&#x9762;&#x955C;&#x8005;&#x5343;&#x53E4;&#x53C8;&#x6709;&#x51E0;&#x4EBA;&#xFF1F;&#x51A5;&#x51A5;&#x4E4B;&#x4E2D;&#x81EA;&#x6709;&#x5B9A;&#x6570;&#x3002;&#x53C8;&#x662F;&#x4E00;&#x4E2A;13&#x5E74;&#x7684;&#x91CD;&#x8E48;&#x8D1F;&#x8D23;&#x3002;</p>
<p>&#x5199;&#x5230;&#x8FD9;&#x91CC;&#x6211;&#x4E0D;&#x7981;&#x60F3;&#x8D77;&#x7535;&#x5F71;&#x300A;&#x8C2D;&#x55E3;&#x540C;&#x300B;&#x4E2D;&#xFF0C;&#x8C2D;&#x55E3;&#x540C;&#x4E0E;&#x59BB;&#x5B50;&#x8BC0;&#x522B;&#xFF0C;&#x8C2D;&#x8BF4;&#xFF1A;&#x201C;&#x544A;&#x8BC9;&#x540E;&#x6765;&#x7684;&#x4EBA;&#x4EEC;&#xFF0C;&#x6211;&#xFF0C;&#x4E3A;&#x4E86;&#x4EC0;&#x4E48;&#x800C;&#x6B7B;&#x201D;&#xFF0C;&#x8C2D;&#x59BB;&#x8BF4;&#xFF1A;&#x201C;&#x53EF;&#x662F;&#x6211;&#x4EEC;&#x8FD8;&#x6CA1;&#x6709;&#x5B69;&#x5B50;&#x201D;&#xFF0C;&#x4E00;&#x5411;&#x5F3A;&#x786C;&#x7684;&#x8C2D;&#x55E3;&#x540C;&#x4E00;&#x4E0B;&#x5B50;&#x54FD;&#x54BD;&#x4E86;&#xFF0C;&#x8BF4;&#x51FA;&#x4E86;&#x6700;&#x7EDD;&#x671B;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#x201C;&#x8FD9;&#x6837;&#x7684;&#x4E2D;&#x56FD;&#xFF0C;&#x591A;&#x4E00;&#x4E2A;&#x5B69;&#x5B50;&#x4E0D;&#x662F;&#x591A;&#x4E00;&#x4E2A;&#x5974;&#x96B6;&#x5417;&#xFF1F;&#x201D;&#x5F53;&#x65F6;&#x6211;&#x770B;&#x5230;&#x8FD9;&#x91CC;&#x771F;&#x7684;&#x77AC;&#x95F4;&#x6CEA;&#x76EE;&#x4E86;&#x3002;</p>
<p>&#x4E09;&#x767E;&#x5E74;&#x6765;&#xFF0C;&#x4E49;&#x8584;&#x4E91;&#x5929;&#xFF1B;&#x4E09;&#x767E;&#x5E74;&#x6765;&#xFF0C;&#x7A7A;&#x524D;&#x7EDD;&#x540E;&#xFF1B;&#x4E09;&#x767E;&#x5E74;&#x6765;&#xFF0C;&#x632F;&#x804B;&#x53D1;&#x8058;&#xFF01;<em>&#x201C;&#x6709;&#x5FC3;&#x6740;&#x8D3C;&#xFF0C;&#x65E0;&#x529B;&#x56DE;&#x5929;&#x3002;&#x6B7B;&#x5F97;&#x5176;&#x6240;&#xFF0C;&#x5FEB;&#x54C9;&#x5FEB;&#x54C9;&#x3002;&#x201D;</em>&#x77ED;&#x77ED;16&#x4E2A;&#x5B57;&#x6572;&#x54CD;&#x4E86;&#x6E05;&#x738B;&#x671D;&#x706D;&#x4EA1;&#x7684;&#x4E27;&#x949F;&#xFF01;&#x5728;&#x4E1C;&#x65B9;&#x4EBA;&#x7684;&#x5730;&#x5E73;&#x7EBF;&#x4E0A;&#xFF0C;&#x8C2D;&#x55E3;&#x540C;&#x662F;&#x5185;&#x5FE7;&#x5916;&#x60A3;&#x7684;&#x4E2D;&#x56FD;&#x4E00;&#x9053;&#x6700;&#x8000;&#x773C;&#x7684;&#x66D9;&#x5149;&#xFF01;&#x4ED6;&#x8BD5;&#x56FE;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x5934;&#x9885;&#x548C;&#x9C9C;&#x8840;&#x5524;&#x9192;&#x6C11;&#x4F17;&#xFF1A;<em>&#x201C;&#x5404;&#x56FD;&#x53D8;&#x6CD5;&#xFF0C;&#x65E0;&#x4E0D;&#x4ECE;&#x6D41;&#x8840;&#x5F00;&#x59CB;&#xFF0C;&#x4ECA;&#x4E2D;&#x56FD;&#x672A;&#x95FB;&#x6709;&#x56E0;&#x53D8;&#x6CD5;&#x6D41;&#x8840;&#x8005;&#xFF0C;&#x6B64;&#x56FD;&#x4E4B;&#x6240;&#x4EE5;&#x4E0D;&#x660C;&#x4E5F;&#x3002;&#x6709;&#x4E4B;&#xFF0C;&#x8BF7;&#x81EA;&#x55E3;&#x540C;&#x59CB;&#xFF01;&#x201D;</em></p>
<p>&#x6211;&#x4E0D;&#x7981;&#x60F3;&#x8C61;&#x516D;&#x541B;&#x5B50;&#x5728;&#x884C;&#x5211;&#x524D;&#x7684;&#x4ECE;&#x5BB9;&#x3002;</p>
<hr>
<p>&#x5218;&#x5149;&#x7B2C;&#x53D1;&#x8BDD;&#x9053;&#xFF1A;&#x201C;&#x590D;&#x751F;&#xFF08;&#x8C2D;&#x55E3;&#x540C;&#x5B57;&#xFF09;&#xFF0C;&#x4F60;&#x8FD8;&#x5728;&#x72B9;&#x8C6B;&#x4EC0;&#x4E48;&#x3002;&#x6211;&#x4EEC;6&#x4EBA;&#x5F53;&#x4E2D;&#xFF0C;&#x4F60;&#x58F0;&#x671B;&#x6700;&#x9AD8;&#xFF0C;&#x5730;&#x4F4D;&#x6700;&#x9AD8;&#xFF0C;&#x5EB7;&#x6881;&#x4E8C;&#x5144;&#x4E4B;&#x4E0B;&#xFF0C;&#x5929;&#x4E0B;&#x7EF4;&#x65B0;&#x4E4B;&#x58EB;&#x7686;&#x4EF0;&#x8D56;&#x4E8E;&#x8C2D;&#x5144;&#x4F60;&#x3002;&#x5144;&#x5982;&#x80FD;&#x6709;&#x5E78;&#x9003;&#x8DD1;&#xFF0C;&#x662F;&#x6211;&#x5927;&#x6E05;&#x4E4B;&#x5E78;&#xFF0C;&#x662F;&#x7EF4;&#x65B0;&#x4E4B;&#x5E78;&#x554A;&#x3002;&#x201D;</p>
<p>&#x8C2D;&#x55E3;&#x540C;&#x6447;&#x4E86;&#x6447;&#x5934;&#x9053;&#xFF1A;&#x201C;&#x53D8;&#x6CD5;&#x4E4B;&#x65F6;&#xFF0C;&#x8C2D;&#x67D0;&#x9519;&#x62DB;&#x9891;&#x51FA;&#xFF0C;&#x5DF2;&#x65E0;&#x989C;&#x89C1;&#x5929;&#x4E0B;&#x5FD7;&#x58EB;&#xFF1B;&#x897F;&#x540E;&#x593A;&#x5BAB;&#x4E4B;&#x673A;&#xFF0C;&#x8C2D;&#x67D0;&#x4E3E;&#x63AA;&#x5931;&#x5BF9;&#xFF0C;&#x4E0D;&#x80FD;&#x5C31;&#x5723;&#x4E0A;&#x4E8E;&#x6C34;&#x706B;&#xFF0C;&#x6709;&#x8D1F;&#x7687;&#x4E0A;&#x7684;&#x5723;&#x6069;&#x3002;&#x5982;&#x6211;&#x8FD9;&#x7B49;&#x65E0;&#x80FD;&#x4E3A;&#x529B;&#x4E4B;&#x8F88;&#xFF0C;&#x5DF2;&#x7136;&#x4E0D;&#x6562;&#x82DF;&#x6D3B;&#x201D;</p>
<p>&#x4E00;&#x65C1;&#x7684;&#x6768;&#x79C0;&#x68EE;&#x8BF4;&#x9053;&#xFF1A;&#x201C;&#x590D;&#x751F;&#xFF0C;&#x4F60;&#x8FC7;&#x4E8E;&#x8FC2;&#x8150;&#x4E86;&#x3002;&#x4F60;&#x6211;&#x8BF8;&#x4F4D;&#x7686;&#x4EE5;&#x6F84;&#x6E05;&#x5929;&#x4E0B;&#x4E3A;&#x5DF1;&#x4EFB;&#xFF0C;&#x4E3A;&#x4E86;&#x6C11;&#x65CF;&#x5927;&#x4E1A;&#xFF0C;&#x600E;&#x80FD;&#x79F0;&#x4E4B;&#x82DF;&#x6D3B;&#x3002;&#x201D;</p>
<p>&#x8C2D;&#x55E3;&#x540C;&#x4F9D;&#x65E7;&#x6447;&#x5934;&#x3002;&#x4ED6;&#x5FFD;&#x7136;&#x8F6C;&#x5411;&#x4E00;&#x65C1;&#x7684;&#x5EB7;&#x5149;&#x4EC1;&#x8BF4;&#x9053;&#xFF1A;&#x201C;&#x5E7F;&#x4EC1;&#xFF0C;&#x4F60;&#x4E43;&#x662F;&#x4EE3;&#x5144;&#x9876;&#x7F6A;&#xFF0C;&#x53C8;&#x662F;&#x5E03;&#x8863;&#x4E4B;&#x8EAB;&#xFF0C;&#x8FD9;&#x53D8;&#x6CD5;&#x4E00;&#x4E8B;&#xFF0C;&#x4F60;&#x5E76;&#x672A;&#x591A;&#x53C2;&#x4E0E;&#xFF0C;&#x4F55;&#x5FC5;&#x4E0E;&#x6211;&#x7B49;&#x4E00;&#x9F50;&#x4E27;&#x547D;&#x5462;&#xFF1F;&#x201D;</p>
<p>&#x5EB7;&#x5E7F;&#x4EC1;&#x95FB;&#x8A00;&#xFF0C;&#x53EA;&#x662F;&#x6DE1;&#x6DE1;&#x4E00;&#x7B11;&#x9053;&#xFF1A;&#x201C;&#x5E7F;&#x4EC1;&#x4E0D;&#x8FC7;&#x5E73;&#x5934;&#x767E;&#x59D3;&#xFF0C;&#x6B7B;&#x4E0D;&#x8DB3;&#x60DC;&#xFF0C;&#x80FD;&#x4EE3;&#x5144;&#x4E00;&#x6B7B;&#xFF0C;&#x4E0D;&#x751A;&#x58EE;&#x4E4E;&#xFF1F;&#x4ECA;&#x516B;&#x80A1;&#x5DF2;&#x5E9F;&#xFF0C;&#x4EBA;&#x624D;&#x5C06;&#x8F88;&#x51FA;&#xFF0C;&#x6211;&#x8F88;&#x6B7B;&#xFF0C;&#x4E2D;&#x56FD;&#x5F3A;&#x77E3;&#x3002;&#x201D;</p>
<p>&#x6797;&#x65ED;&#x95FB;&#x8A00;&#x626C;&#x58F0;&#x957F;&#x7B11;&#x9053;&#xFF1A;&#x201C;&#x58EE;&#x54C9;&#xFF01;&#x5E7F;&#x4EC1;&#x3002;&#x9EC4;&#x6CC9;&#x8DEF;&#x4E0A;&#xFF0C;&#x6211;&#x7B49;&#x5144;&#x5F1F;&#x516D;&#x4EBA;&#x643A;&#x624B;&#x63FD;&#x8155;&#xFF0C;&#x53C8;&#x6709;&#x4F55;&#x61BE;&#xFF01;&#x201D;</p>
<p>&#x6768;&#x9510;&#x4E5F;&#x5728;&#x4E00;&#x65C1;&#x8BF4;&#x9053;&#xFF1A;&#x201C;&#x540C;&#x53BB;&#xFF0C;&#x540C;&#x53BB;&#x201D;</p>
<p>&#x8C2D;&#x55E3;&#x540C;&#x6B23;&#x6170;&#x5730;&#x770B;&#x5411;&#x8EAB;&#x8FB9;&#x4E94;&#x4EBA;&#xFF0C;&#x5BF9;&#x7740;&#x82CD;&#x5929;&#x8BF4;&#x9053;&#xFF1A;&#x201C;&#x5404;&#x56FD;&#x53D8;&#x6CD5;&#x65E0;&#x4E0D;&#x4ECE;&#x6D41;&#x8840;&#x800C;&#x6210;&#xFF0C;&#x4ECA;&#x65E5;&#x4E2D;&#x56FD;&#x672A;&#x95FB;&#x6709;&#x56E0;&#x53D8;&#x6CD5;&#x800C;&#x6D41;&#x8840;&#x8005;&#xFF0C;&#x6B64;&#x56FD;&#x4E4B;&#x6240;&#x4EE5;&#x4E0D;&#x660C;&#x4E5F;&#x3002;&#x6709;&#x4E4B;&#xFF0C;&#x8BF7;&#x81EA;&#x55E3;&#x540C;&#x59CB;&#xFF01;&#x201D;</p>
<p>&#x4E5D;&#x6708;&#x672B;&#x7684;&#x5317;&#x4EAC;&#xFF0C;&#x5C45;&#x7136;&#x98D8;&#x8D77;&#x4E86;&#x5F53;&#x5E74;&#x7684;&#x7B2C;&#x4E00;&#x573A;&#x96EA;&#x3002;&#x83DC;&#x5E02;&#x53E3;&#x5211;&#x573A;&#xFF0C;&#x4EBA;&#x5934;&#x6512;&#x52A8;&#xFF0C;&#x65E0;&#x77E5;&#x7684;&#x767E;&#x59D3;&#x6709;&#x8BF4;&#x6709;&#x7B11;&#x7684;&#x56F4;&#x7740;&#x884C;&#x5211;&#x53F0;&#x7B49;&#x7740;&#x770B;&#x70ED;&#x95F9;&#x3002;&#x5728;&#x4ED6;&#x4EEC;&#x773C;&#x91CC;&#xFF0C;&#x5211;&#x573A;&#x5C31;&#x5982;&#x540C;&#x620F;&#x53F0;&#xFF0C;&#x6740;&#x4EBA;&#x5C31;&#x662F;&#x4E00;&#x51FA;&#x7CBE;&#x5F69;&#x7684;&#x8868;&#x6F14;&#xFF0C;&#x81F3;&#x4E8E;&#x6740;&#x7684;&#x662F;&#x8C01;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x6740;&#xFF0C;&#x8001;&#x767E;&#x59D3;&#x603B;&#x662F;&#x5BF9;&#x8FD9;&#x4E9B;&#x6CA1;&#x6709;&#x5174;&#x8DA3;&#x7684;&#x3002;</p>
<p>&#x8C2D;&#x55E3;&#x540C;&#x548C;&#x5176;&#x4ED6;&#x4E94;&#x4EBA;&#x6602;&#x9996;&#x633A;&#x7ACB;&#x5728;&#x6CD5;&#x573A;&#xFF0C;&#x4ED6;&#x770B;&#x7740;&#x53F0;&#x4E0B;&#x90A3;&#x4E9B;&#x8BAA;&#x7B11;&#x7684;&#x8138;&#x542C;&#x7740;&#x4EBA;&#x4EEC;&#x8BA5;&#x5632;&#x7684;&#x8BED;&#xFF0C;&#x4ED6;&#x60F3;&#x5BF9;&#x7740;&#x8FD9;&#x4E9B;&#x9EBB;&#x6728;&#x4E0D;&#x4EC1;&#x7684;&#x8822;&#x8822;&#x6C11;&#x4F17;&#x8BF4;&#x4E9B;&#x4EC0;&#x4E48;&#xFF0C;&#x53C8;&#x751F;&#x751F;&#x5730;&#x628A;&#x8BDD;&#x54BD;&#x4E86;&#x4E0B;&#x53BB;&#x3002;&#x5FFD;&#x7136;&#xFF0C;&#x4ED6;&#x548B;&#x90A3;&#x7247;&#x98DE;&#x96EA;&#x4E2D;&#x770B;&#x5230;&#x4E00;&#x62B9;&#x4EAE;&#x8272;&#xFF0C;&#x4E00;&#x53EA;&#x84DD;&#x8272;&#x7684;&#x873B;&#x8713;&#x5728;&#x7A7A;&#x4E2D;&#x95F2;&#x7BC7;&#x8E41;&#x8DF9;&#xFF08;xian&#xFF09;&#xFF0C;&#x4EFF;&#x4F5B;&#x662F;&#x5728;&#x4E3A;&#x4ED6;&#x4EEC;&#x9001;&#x522B;&#xFF0C;&#x53C8;&#x4EFF;&#x4F5B;&#x662F;&#x5728;&#x4E3A;&#x4ED6;&#x4EEC;&#x6307;&#x8DEF;&#x3002;<br>&#x8C2D;&#x55E3;&#x540C;&#x5FAE;&#x5FAE;&#x4E00;&#x7B11;&#xFF0C;&#x8131;&#x53E3;&#x541F;&#x548F;&#x9053;&#xFF1A;&#x201C;&#x671B;&#x95E8;&#x6295;&#x6B62;&#x601D;&#x5F20;&#x4FED;&#xFF0C;&#x5FCD;&#x6B7B;&#x987B;&#x81FE;&#x5F85;&#x675C;&#x6839;&#x3002;&#x6211;&#x81EA;&#x6A2A;&#x5200;&#x5411;&#x5929;&#x7B11;&#xFF0C;&#x53BB;&#x7559;&#x809D;&#x80C6;&#x4E24;&#x6606;&#x4ED1;&#xFF01;&#x201D;</p>
<hr>
<p>&#x65F6;&#x5149;&#x8F6C;&#x8DF3;&#xFF0C;&#x4FBF;&#x6765;&#x5230;&#x4E86;&#x5E9A;&#x5B50;&#x4E4B;&#x4E71;&#x3002;&#x4E24;&#x5BAB;&#x592A;&#x540E;&#x72FC;&#x72C8;&#x897F;&#x9003;&#xFF0C;&#x5DF2;&#x662F;&#x66AE;&#x5E74;&#x7684;&#x6148;&#x79A7;&#x6DF1;&#x53D7;&#x523A;&#x6FC0;&#x3002;&#x5979;&#x6E05;&#x695A;&#x5730;&#x610F;&#x8BC6;&#x5230;&#xFF0C;&#x65E7;&#x5236;&#x5EA6;&#x5DF2;&#x65E0;&#x6CD5;&#x6709;&#x6548;&#x8FD0;&#x8F6C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;1901&#x5E74;1&#x6708;28&#x65E5;&#xFF0C;&#x4E24;&#x5BAB;&#x5728;&#x897F;&#x5B89;&#x53D1;&#x5E03;&#x300A;&#x53D8;&#x6CD5;&#x4E0A;&#x8C15;&#x300B;&#xFF0C;&#x628A;&#x5F53;&#x5E74;&#x7EF4;&#x65B0;&#x6D3E;&#x63D0;&#x51FA;&#x7684;&#x53D8;&#x6CD5;&#x7EB2;&#x9886;&#x539F;&#x5C01;&#x4E0D;&#x52A8;&#x5730;&#x62FF;&#x51FA;&#x6765;&#xFF0C;&#x5E76;&#x53D8;&#x6210;&#x73B0;&#x5B9E;&#x3002;&#x60B2;&#x5929;&#x60AF;&#x4EBA;&#xFF0C;&#x6CE3;&#x8840;&#x8D28;&#x95EE;&#xFF1A;&#x620A;&#x620C;&#x516D;&#x541B;&#x5B50;&#x9EC4;&#x6CC9;&#x6709;&#x77E5;&#xFF0C;&#x4F1A;&#x4F5C;&#x4F55;&#x611F;&#x60F3;&#xFF1F;&#xFF01;&#x5149;&#x7EEA;&#x4E09;&#x5341;&#x56DB;&#x5E74;&#x516B;&#x6708;&#x521D;&#x4E00;&#xFF08;1908&#x5E74;8&#x6708;27&#x65E5;&#xFF09;&#xFF0C;&#x671D;&#x5EF7;&#x9881;&#x5E03;&#x300A;&#x94A6;&#x5B9A;&#x5BAA;&#x6CD5;&#x5927;&#x7EB2;&#x300B;&#x548C;&#x300A;&#x8BAE;&#x9662;&#x6CD5;&#x9009;&#x4E3E;&#x6CD5;&#x8981;&#x9886;&#x53CA;&#x9010;&#x5E74;&#x7B79;&#x5907;&#x4E8B;&#x5B9C;&#x6298;&#x300B;&#xFF0C;&#x786E;&#x5B9A;&#x4E5D;&#x5E74;&#x7ACB;&#x5BAA;&#x89C4;&#x5212;&#x3002;&#x4F46;&#x4E00;&#x5207;&#x4E3A;&#x65F6;&#x5DF2;&#x665A;&#xFF0C;&#x51E0;&#x4E2A;&#x6708;&#x540E;&#xFF0C;&#x6148;&#x79A7;&#x3001;&#x5149;&#x7EEA;&#x76F8;&#x7EE7;&#x6B7B;&#x4EA1;&#xFF0C;&#x5927;&#x6E05;&#x706D;&#x4EA1;&#x5728;&#x5373;&#x3002;</p>
<p>&#x9762;&#x5BF9;&#x5927;&#x56BC;&#x201C;&#x4EBA;&#x8840;&#x9992;&#x5934;&#x201D;&#x7684;&#x82B8;&#x82B8;&#x770B;&#x5BA2;&#xFF0C;&#x9C81;&#x8FC5;&#x5766;&#x8A00;&#xFF1A;&#x201C;&#x4E2D;&#x56FD;&#x4E00;&#x5411;&#x5C31;&#x5C11;&#x6709;&#x5931;&#x8D25;&#x7684;&#x82F1;&#x96C4;&#xFF0C;&#x5C11;&#x6709;&#x97E7;&#x6027;&#x7684;&#x53CD;&#x6297;&#xFF0C;&#x5C11;&#x6709;&#x6562;&#x5355;&#x8EAB;&#x93D6;&#x6218;&#x7684;&#x6B66;&#x4EBA;&#xFF0C;&#x5C11;&#x6709;&#x6562;&#x629A;&#x54ED;&#x53DB;&#x5F92;&#x7684;&#x540A;&#x5BA2;&#xFF1B;&#x89C1;&#x80DC;&#x5146;&#x5219;&#x7EB7;&#x7EB7;&#x805A;&#x96C6;&#xFF0C;&#x89C1;&#x8D25;&#x5146;&#x5219;&#x7EB7;&#x7EB7;&#x9003;&#x4EA1;&#x3002;&#x201D;&#x201C;&#x771F;&#x7684;&#x731B;&#x58EB;&#xFF0C;&#x6562;&#x4E8E;&#x76F4;&#x9762;&#x60E8;&#x6DE1;&#x7684;&#x4EBA;&#x751F;&#xFF0C;&#x6562;&#x4E8E;&#x6B63;&#x89C6;&#x6DCB;&#x6F13;&#x7684;&#x9C9C;&#x8840;&#x3002;&#x201D;&#x6211;&#x4EE5;&#x6211;&#x8840;&#x8350;&#x8F69;&#x8F95;&#x7684;&#x201C;&#x6C11;&#x56FD;&#x5148;&#x89C9;&#x201D;&#x8005;&#x8C2D;&#x55E3;&#x540C;&#x662F;&#x4E94;&#x5343;&#x5E74;&#x6765;&#x9876;&#x5929;&#x7ACB;&#x5730;&#x7684;&#x5927;&#x4E08;&#x592B;&#x3001;&#x771F;&#x541B;&#x5B50;&#xFF0C;&#x5F53;&#x4E0E;&#x4E2D;&#x534E;&#x6C11;&#x65CF;&#x81EA;&#x5F3A;&#x4E0D;&#x606F;&#x4E4B;&#x7CBE;&#x795E;&#x6C38;&#x5B58;&#xFF01;&#xFEFF;</p>
<p>&#x8C2D;&#x55E3;&#x540C;&#x82E5;&#x4E0D;&#x53C2;&#x52A0;&#x53D8;&#x6CD5;&#xFF0C;&#x4ED6;&#x4E5F;&#x662F;&#x4E00;&#x4EE3;&#x4EBA;&#x624D;&#x3002;</p>
<p>&#x4ED6;&#x66FE;&#x4E00;&#x8BED;&#x9053;&#x7834;&#x4E13;&#x5236;&#x7EDF;&#x6CBB;&#x4E0E;&#x5B66;&#x672F;&#x7684;&#x79D8;&#x5BC6;&#xFF1A;&#x201C;&#x4E8C;&#x5343;&#x5E74;&#x6765;&#x4E4B;&#x653F;&#xFF0C;&#x79E6;&#x653F;&#x4E5F;&#xFF0C;&#x7686;&#x5927;&#x76D7;&#x4E5F;&#xFF1B;&#x4E8C;&#x5343;&#x6765;&#x4E4B;&#x5B66;&#xFF0C;&#x8340;&#xFF08;xun&#xFF09;&#x5B66;&#x4E5F;&#xFF0C;&#x7686;&#x4E61;&#x613F;&#x4E5F;&#xFF1B;&#x60DF;&#x5927;&#x76D7;&#x5229;&#x7528;&#x4E61;&#x613F;&#xFF0C;&#x60DF;&#x4E61;&#x613F;&#x5DE5;&#x5A9A;&#x5927;&#x76D7;&#x3002;&#x201D;&#xFF08;&#x300A;&#x4EC1;&#x5B66;&#x300B;&#x5377;&#x4E0B;&#xFF09;&#x3002;&#x4ED6;&#x5728;&#x300A;&#x4EC1;&#x5B66;&#x81EA;&#x53D9;&#x300B;&#x4E2D;&#x8BF4;&#xFF1A;&#x201C;&#x543E;&#x5C06;&#x54C0;&#x53F7;&#x6D41;&#x6D95;&#xFF0C;&#x5F3A;&#x8052;&#x4E0D;&#x820D;&#xFF0C;&#x4EE5;&#x901F;&#x5176;&#x51B2;&#x51B3;&#x7F51;&#x7F57;&#x3002;&#x51B2;&#x51B3;&#x5229;&#x7984;&#x4E4B;&#x7F51;&#x7F57;&#xFF0C;&#x51B2;&#x51B3;&#x4FD7;&#x5B66;&#x82E5;&#x8003;&#x636E;&#x82E5;&#x8BCD;&#x7AE0;&#x4E4B;&#x7F51;&#x7F57;&#xFF0C;&#x51B2;&#x51B3;&#x5168;&#x7403;&#x7FA4;&#x5B66;&#x7FA4;&#x6559;&#x4E4B;&#x7F51;&#x7F57;&#xFF0C;&#x51B2;&#x51B3;&#x541B;&#x4E3B;&#x4E4B;&#x7F51;&#x7F57;&#xFF0C;&#x51B2;&#x51B3;&#x4F26;&#x5E38;&#x4E4B;&#x7F51;&#x7F57;&#xFF0C;&#x51B2;&#x51B3;&#x5929;&#x4E4B;&#x7F51;&#x7F57;&#x3002;&#x2026;&#x2026;&#x7136;&#x65E2;&#x53EF;&#x51B2;&#x51B3;&#xFF0C;&#x81EA;&#x65E0;&#x7F51;&#x7F57;&#xFF1B;&#x771F;&#x65E0;&#x7F51;&#x7F57;&#xFF0C;&#x4E43;&#x53EF;&#x8A00;&#x51B2;&#x51B3;&#x3002;&#x2026;&#x2026;&#x201D;&#xFEFF;</p>
<p>1897&#x5E74;&#xFF0C;&#x8C2D;&#x55E3;&#x540C;&#x6DF1;&#x601D;&#x7CBE;&#x8FDB;&#x8457;&#x6210;5&#x4E07;&#x5B57;&#x5DE8;&#x8457;&#x300A;&#x4EC1;&#x5B66;&#x300B;&#xFF0C;&#x6784;&#x5EFA;&#x4E86;&#x4E2D;&#x56FD;&#x53D8;&#x6CD5;&#x5168;&#x65B0;&#x7684;&#x7406;&#x8BBA;&#x4F53;&#x7CFB;&#x3002;&#x300A;&#x4EC1;&#x5B66;&#x300B;&#x535A;&#x91C7;&#x300A;&#x8BBA;&#x8BED;&#x300B;&#x300A;&#x793C;&#x8BB0;&#x300B;&#x300A;&#x5E84;&#x5B50;&#x300B;&#x300A;&#x53F2;&#x8BB0;&#x300B;&#x7B49;&#x5112;&#x3001;&#x4F5B;&#x3001;&#x9053;&#x3001;&#x58A8;&#x6539;&#x9769;&#x4E4B;&#x957F;&#xFF0C;&#x5E7F;&#x7EB3;&#x897F;&#x65B9;&#x6C11;&#x4E3B;&#x3001;&#x81EA;&#x7531;&#x3001;&#x4EBA;&#x6743;&#x7B49;&#x53D8;&#x9769;&#x4E4B;&#x9053;&#xFF0C;&#x63D0;&#x51FA;&#x201C;&#x914C;&#x53D6;&#x897F;&#x6CD5;&#xFF0C;&#x4EE5;&#x8865;&#x543E;&#x4E2D;&#x56FD;&#x53E4;&#x6CD5;&#x4E4B;&#x4EA1;&#x201D;&#xFF0C;&#x88AB;&#x4E2D;&#x56FD;&#x601D;&#x60F3;&#x754C;&#x8A89;&#x4E3A;&#x201C;&#x9A87;&#x4FD7;&#x4E4B;&#x6587;&#x201D;&#x548C;&#x201C;&#x4EBA;&#x6743;&#x5BA3;&#x8A00;&#x201D;&#x3002;&#xFEFF;</p>
<p>&#x7687;&#x6743;&#x662F;&#x6C11;&#x6743;&#x7684;&#x6B7B;&#x654C;&#x3002;&#x4E2D;&#x56FD;&#x5386;&#x4EE3;&#x653F;&#x6743;&#x90FD;&#x8FF7;&#x4FE1;&#x519B;&#x961F;&#xFF0C;&#x6B63;&#x5982;&#x6444;&#x653F;&#x738B;&#x8F7D;&#x6CA3;&#x6240;&#x8A00;&#xFF1A;&#x201C;&#x6709;&#x5175;&#x5728;&#x201D; &#xFF0C;&#x6240;&#x4EE5;&#x65E0;&#x6240;&#x987E;&#x5FCC;&#x3002;&#x4F46;&#x5BF9;&#x6E05;&#x653F;&#x6743;&#x6253;&#x54CD;&#x7B2C;&#x4E00;&#x67AA;&#x7684;&#x6070;&#x6070;&#x662F;&#x6E05;&#x671D;&#x81EA;&#x5DF1;&#x7684;&#x6B66;&#x660C;&#x65B0;&#x519B;&#x3002;&#x6C34;&#x80FD;&#x8F7D;&#x821F;&#x4EA6;&#x53EF;&#x8D5B;&#x8247;&#x3002;&#x4E16;&#x754C;&#x6F6E;&#x6D41;&#xFF0C;&#x6D69;&#x6D69;&#x8361;&#x8361;&#xFF0C;&#x987A;&#x4E4B;&#x5219;&#x660C;&#xFF0C;&#x9006;&#x4E4B;&#x5219;&#x4EA1;&#x3002;&#x6700;&#x540E;&#x7684;&#x51B3;&#x5B9A;&#x529B;&#x91CF;&#x4E0D;&#x53EF;&#x80FD;&#x662F;&#x67AA;&#x6746;&#x5B50;&#xFF01;&#x6C11;&#x5FC3;&#x7684;&#x529B;&#x91CF;&#x52BF;&#x5982;&#x7834;&#x7AF9;&#xFF0C;&#x4E0D;&#x53EF;&#x963B;&#x6321;&#xFF01;&#xFEFF;</p>
<p>&#x8C2D;&#x55E3;&#x540C;&#x8BF4;&#xFF1A;&#x201C;&#x6C11;&#x4E3A;&#x672C;&#xFF0C;&#x541B;&#x4E3A;&#x672B;&#x3002;&#x5982;&#x679C;&#x541B;&#x4E3B;&#x9A84;&#x6DEB;&#x7EB5;&#x6B32;&#xFF0C;&#x4E0D;&#x80FD;&#x66FF;&#x5929;&#x4E0B;&#x529E;&#x4E8B;&#xFF0C;&#x8001;&#x767E;&#x59D3;&#x5C31;&#x6709;&#x6743;&#x5E9F;&#x6389;&#x4ED6;&#x3002;&#x5B9E;&#x884C;&#x53D8;&#x6CD5;&#xFF0C;&#x5C31;&#x662F;&#x8981;&#x5E9F;&#x6389;&#x541B;&#x4E3B;&#x4E13;&#x5236;&#xFF0C;&#x8FD8;&#x653F;&#x4E8E;&#x6C11;&#xFF0C;&#x8FD9;&#x624D;&#x662F;&#x6551;&#x56FD;&#x7684;&#x6839;&#x672C;&#x4E4B;&#x9053;&#xFF01;&#x201D;&#x8868;&#x9762;&#x4E0A;&#x8C2D;&#x55E3;&#x540C;&#x6B7B;&#x4E8E;&#x5E1D;&#x515A;&#x4E0E;&#x540E;&#x515A;&#x4E4B;&#x4E89;&#x3001;&#x6539;&#x9769;&#x4E0E;&#x5B88;&#x65E7;&#x4E4B;&#x4E89;&#xFF0C;&#x5B9E;&#x8D28;&#x4E0A;&#x8C2D;&#x541B;&#x6B7B;&#x4E8E;&#x4E00;&#x4E2A;&#x201C;&#x4E49;&#x201D;&#x5B57;&#xFF0C;&#x4ED6;&#x7684;&#x6B7B;&#x548C;&#x611A;&#x5FE0;&#x65E0;&#x5173;&#xFF0C;&#x8FD9;&#x662F;&#x4ED6;&#x7684;&#x5BBF;&#x547D;&#x3002;&#x8C2D;&#x55E3;&#x540C;&#x662F;&#x4E3A;&#x793E;&#x7A37;&#x82CD;&#x751F;&#x800C;&#x6B7B;&#xFF0C;&#x662F;&#x4E3A;&#x6C11;&#x6743;&#x53D8;&#x6CD5;&#x800C;&#x6B7B;&#xFF0C;&#x662F;&#x4E3A;&#x6211;&#x4EEC;&#x800C;&#x6B7B;&#xFF0C;&#x662F;&#x4E24;&#x5343;&#x4F59;&#x5E74;&#x58A8;&#x5BB6;&#x4FA0;&#x4E49;&#x8840;&#x8109;&#x6700;&#x540E;&#x7684;&#x7EDD;&#x54CD;&#xFF0C;&#x662F;&#x534E;&#x590F;&#x793E;&#x4F1A;&#x8FC8;&#x5411;&#x73B0;&#x4EE3;&#x6587;&#x660E;&#x7684;&#x5343;&#x53E4;&#x7EDD;&#x5531;&#xFF01;&#xFEFF;</p>
<p>&#x5F53;&#x4F60;&#x770B;&#x5230;&#x201C;&#x8C2D;&#x55E3;&#x540C;&#x201D;&#x4E09;&#x4E2A;&#x5B57;&#x65F6;&#xFF0C;&#x4F60;&#x4F1A;&#x60F3;&#x5230;&#x8C01;&#xFF1F;&#x6587;&#x5929;&#x7965;&#x3001;&#x79CB;&#x747E;&#x3001;&#x6797;&#x662D;&#xFF1F;&#x9119;&#x4EBA;&#x4EE5;&#x4E3A;&#xFF0C;&#x4E0E;&#x8C2D;&#x55E3;&#x540C;&#x6700;&#x76F8;&#x4F3C;&#x7684;&#x662F;&#x660E;&#x671D;&#x65B9;&#x5B5D;&#x5B7A;&#x3002;&#x4E3A;&#x5927;&#x4E49;&#x820D;&#x5C0F;&#x6211;&#xFF0C;&#x4ED6;&#x4EEC;&#x7528;&#x9C9C;&#x8840;&#x4E66;&#x5199;&#x4E86;&#x5386;&#x53F2;&#x6700;&#x5D07;&#x9AD8;&#x7684;&#x4EBA;&#x683C;&#xFF0C;&#x77E5;&#x884C;&#x5408;&#x4E00;&#xFF0C;&#x8A00;&#x800C;&#x6709;&#x4FE1;&#xFF0C;&#x77E5;&#x96BE;&#x800C;&#x8FDB;&#xFF0C;&#x4E0D;&#x754F;&#x727A;&#x7272;&#x3002;&#x60DF;&#x4E00;&#x7684;&#x533A;&#x522B;&#x662F;&#xFF0C;&#x660E;&#x671D;&#x5904;&#x4E8E;&#x4E0A;&#x5347;&#x671F;&#xFF0C;&#x6E05;&#x671D;&#x5904;&#x4E8E;&#x5782;&#x6B7B;&#x671F;&#xFF1B;&#x4E00;&#x4E2A;&#x6B7B;&#x4E8E;&#x85E9;&#x738B;&#x53DB;&#x4E71;&#xFF0C;&#x4E00;&#x4E2A;&#x6B7B;&#x4E8E;&#x5BAB;&#x5EF7;&#x653F;&#x53D8;&#x3002;<br>&#xFEFF;<br>&#x6D2A;&#x6B66;&#x4E09;&#x5341;&#x4E00;&#x5E74;&#xFF08;1398&#x5E74;&#xFF09;&#xFF0C;&#x592A;&#x7956;&#x9A7E;&#x5D29;&#xFF0C;&#x7687;&#x592A;&#x5B59;&#xFF08;&#x60E0;&#x5E1D;&#xFF09;&#x6731;&#x5141;&#x7086;&#x7EE7;&#x4F4D;&#xFF0C;&#x9075;&#x592A;&#x7956;&#x9057;&#x8BAD;&#x65B9;&#x5B5D;&#x5B7A;&#x88AB;&#x53EC;&#x5165;&#x5BAB;&#x5148;&#x540E;&#x4EFB;&#x4F8D;&#x8BFB;&#x7FF0;&#x6797;&#x548C;&#x7FF0;&#x6797;&#x5B66;&#x58EB;&#xFF08;&#x7687;&#x5E1D;&#x8001;&#x5E08;&#x548C;&#x5FC3;&#x8179;&#x667A;&#x56CA;&#xFF09;&#x3002;&#x6731;&#x5141;&#x7086;&#x5BF9;&#x65B9;&#x5B5D;&#x5B7A;&#x6709;&#x77E5;&#x9047;&#x4E4B;&#x6069;&#xFF0C;&#x65B9;&#x5B5D;&#x5B7A;&#x5FC3;&#x5B58;&#x611F;&#x6FC0;&#xFF0C;&#x51B3;&#x5FC3;&#x7AED;&#x5C3D;&#x5168;&#x529B;&#x8F85;&#x4F50;&#x60E0;&#x5E1D;&#x6CBB;&#x7406;&#x5929;&#x4E0B;&#x3002;&#x4E3A;&#x5DE9;&#x56FA;&#x4E2D;&#x592E;&#x96C6;&#x6743;&#xFF0C;&#x4E00;&#x573A;&#x524A;&#x5F31;&#x5404;&#x5730;&#x85E9;&#x738B;&#x7684;&#x884C;&#x52A8;&#x5F00;&#x59CB;&#x4E86;&#xFF0C;&#x9A7B;&#x5B88;&#x5317;&#x5E73;&#x7684;&#x71D5;&#x738B;&#x6731;&#x68E3;&#x4EE5;&#x201C;&#x6E05;&#x541B;&#x4FA7;&#x201D;&#x4E3A;&#x540D;&#x8D77;&#x5175;&#x53DB;&#x4E71;&#x3002;&#x5EFA;&#x6587;&#x56DB;&#x5E74;&#xFF08;1402&#x5E74;&#xFF09;&#xFF0C;&#x60E0;&#x5E1D;&#x519B;&#x961F;&#x6218;&#x8D25;&#xFF0C;&#x4EAC;&#x5E08;&#x5371;&#x5728;&#x65E6;&#x5915;&#x3002;&#x65B9;&#x5B5D;&#x5B7A;&#x529B;&#x8BF7;&#x575A;&#x5B88;&#x5357;&#x4EAC;&#x5E94;&#x5929;&#x5E9C;&#xFF0C;&#x4EE5;&#x5F85;&#x63F4;&#x519B;&#x3002;&#x4E0D;&#x4E45;&#x674E;&#x666F;&#x9686;&#x5F00;&#x91D1;&#x5DDD;&#x95E8;&#x8BA9;&#x71D5;&#x519B;&#x5165;&#x57CE;&#xFF0C;&#x6218;&#x4E71;&#x4E2D;&#x60E0;&#x5E1D;&#x5728;&#x5BAB;&#x4E2D;&#x81EA;&#x711A;&#x800C;&#x6B7B;&#x3002;&#x71D5;&#x738B;&#x8FDB;&#x4EAC;&#x540E;&#x6587;&#x6B66;&#x767E;&#x5B98;&#x89C1;&#x98CE;&#x4F7F;&#x8235;&#xFF0C;&#x7EB7;&#x7EB7;&#x6295;&#x964D;&#xFF0C;&#x65B9;&#x5B5D;&#x5B7A;&#x62D2;&#x4E0D;&#x6295;&#x964D;&#xFF0C;&#x88AB;&#x6355;&#x5165;&#x72F1;&#x3002;&#xFEFF;</p>
<p>&#x65B9;&#x5B5D;&#x5B7A;&#x4E3A;&#x5929;&#x4E0B;&#x7B2C;&#x4E00;&#x5927;&#x5112;&#xFF0C;&#x6731;&#x68E3;&#x4E3A;&#x6536;&#x4E70;&#x4EBA;&#x5FC3;&#x591A;&#x6B21;&#x6D3E;&#x4EBA;&#x5230;&#x72F1;&#x4E2D;&#x529D;&#x964D;&#xFF0C;&#x5E0C;&#x671B;&#x7531;&#x4ED6;&#x64B0;&#x5199;&#x65B0;&#x7687;&#x5373;&#x4F4D;&#x7684;&#x8BCF;&#x4E66;&#xFF0C;&#x65B9;&#x5B5D;&#x5B7A;&#x575A;&#x51B3;&#x4E0D;&#x4ECE;&#x3002;&#x6731;&#x68E3;&#x8BF4;&#xFF1A;&#x4F60;&#x4E0D;&#x6015;&#x706D;&#x4E5D;&#x65CF;&#x5417;&#xFF1F;&#x65B9;&#x5B5D;&#x5B7A;&#x7B54;&#xFF1A;&#x201C;&#x4FBF;&#x5341;&#x65CF;&#x5948;&#x6211;&#x4F55;&#xFF1F;&#x201D;&#x3002;&#x6731;&#x68E3;&#x607C;&#x7F9E;&#x6210;&#x6012;&#xFF0C;&#x8170;&#x65A9;&#x65B9;&#x5B5D;&#x5B7A;&#xFF0C;&#x5176;&#x59BB;&#x5B50;&#x548C;&#x4E24;&#x4E2A;&#x513F;&#x5B50;&#x4E0A;&#x540A;&#x81EA;&#x6740;&#xFF0C;&#x4E24;&#x4E2A;&#x5973;&#x513F;&#x6295;&#x79E6;&#x6DEE;&#x6CB3;&#x800C;&#x6B7B;&#x3002;&#x4E5D;&#x65CF;&#x88AB;&#x706D;&#xFF0C;&#x5916;&#x52A0;&#x4E00;&#x65CF;&#x201C;&#x5F1F;&#x5B50;&#x201D;&#x5171;&#x5341;&#x65CF;800&#x591A;&#x4EBA;&#x88AB;&#x5C60;&#x6740;&#x3002;&#x6731;&#x68E3;&#xFF08;&#x660E;&#x6210;&#x7956;&#xFF09;&#x53DB;&#x4E71;&#x3001;&#x5F11;&#x541B;&#x7BE1;&#x4F4D;&#xFF0C;&#x662F;&#x4E0D;&#x6298;&#x4E0D;&#x6263;&#x7684;&#x4E71;&#x81E3;&#x8D3C;&#x5B50;&#xFF01;&#x4EE4;&#x4EBA;&#x627C;&#x8155;&#x7684;&#x662F;&#xFF0C;&#x5386;&#x53F2;&#x662F;&#x5F3A;&#x8005;&#x7684;&#x4F20;&#x8BB0;&#xFF0C;&#x80DC;&#x738B;&#x8D25;&#x5BC7;&#xFF0C;&#x6CA1;&#x6709;&#x6B63;&#x4E49;&#x53EF;&#x8A00;&#x3002;&#xFEFF;</p>
<p>&#x65B9;&#x5B5D;&#x5B7A;&#x6B7B;&#x540E;463&#x5E74;&#x8C2D;&#x55E3;&#x540C;&#x8BDE;&#x751F;&#xFF08;1865&#x5E74;3&#x6708;10&#x65E5;&#xFF09;&#xFF0C;&#x8C2D;&#x541B;&#x5F77;&#x4F5B;&#x65B9;&#x5B5D;&#x5B7A;&#x7684;&#x8F6C;&#x4E16;&#xFF0C;&#x8DE8;&#x8D8A;&#x65F6;&#x7A7A;&#x518D;&#x73B0;&#x4EBA;&#x95F4;&#xFF0C;&#x62EF;&#x6551;&#x9ECE;&#x6C11;&#x4E8E;&#x6C34;&#x706B;&#xFF0C;&#x529B;&#x633D;&#x72C2;&#x6F9C;&#x4E8E;&#x672B;&#x4E16;&#x3002;&#xFEFF;</p>
<p>&#x8C2D;&#x55E3;&#x540C;&#x751F;&#x4E8E;&#x540D;&#x95E8;&#x671B;&#x65CF;&#xFF0C;&#x7236;&#x4EB2;&#x4E3A;&#x6E56;&#x5317;&#x5DE1;&#x629A;&#x8C2D;&#x7EE7;&#x6D35;&#x3002;&#x81EA;&#x5E7C;&#x62DC;&#x540D;&#x5E08;&#x5B66;&#x7ECF;&#x5178;&#xFF0C;&#x4E0E;&#x4E49;&#x4FA0;&#x201C;&#x5927;&#x5200;&#x738B;&#x4E94;&#x201D;&#x7ED3;&#x4E0B;&#x751F;&#x6B7B;&#x4E4B;&#x4EA4;&#x3002;&#x9752;&#x5E74;&#x65F6;&#x6E38;&#x5386;&#x534A;&#x4E2A;&#x4E2D;&#x56FD;&#xFF0C;&#x89C2;&#x5BDF;&#x98CE;&#x571F;&#x3001;&#x7ED3;&#x4EA4;&#x540D;&#x58EB;&#x3002;1895&#x5E74;&#x300A;&#x9A6C;&#x5173;&#x6761;&#x7EA6;&#x300B;&#x7B7E;&#x8BA2;&#x540E;&#xFF0C;&#x547C;&#x5401;&#x53D8;&#x6CD5;&#xFF0C;&#x5F00;&#x529E;&#x5B66;&#x5802;&#x3002;1896&#x5E74;2&#x6708;&#x5165;&#x4EAC;&#xFF0C;&#x7ED3;&#x4EA4;&#x6881;&#x542F;&#x8D85;&#x7B49;&#x4EBA;&#xFF0C;&#x540E;&#x5C0A;&#x7236;&#x547D;&#x4EFB;&#x804C;&#x5357;&#x4EAC;&#x4E3A;&#x6C5F;&#x82CF;&#x5019;&#x8865;&#x77E5;&#x5E9C;&#x3002;1897&#x5E74;&#x5B8C;&#x6210;&#x8457;&#x4F5C;&#x300A;&#x4EC1;&#x5B66;&#x300B;&#x3002;1988&#x5E74;3&#x6708;&#x521B;&#x5EFA;&#x5357;&#x5B66;&#x4F1A;&#x3001;&#x4E3B;&#x529E;&#x300A;&#x6E58;&#x62A5;&#x300B;&#xFF0C;&#x540C;&#x5E74;9&#x6708;5&#x65E5;&#x7ECF;&#x7FF0;&#x6797;&#x9662;&#x4F8D;&#x8BFB;&#x5B66;&#x58EB;&#x5F90;&#x81F4;&#x9756;&#x63A8;&#x8350;&#xFF0C;&#x88AB;&#x5F81;&#x5165;&#x4EAC;&#x4EFB;&#x56DB;&#x54C1;&#x519B;&#x673A;&#x7AE0;&#x4EAC;&#x3002;9&#x6708;18&#x65E5;&#x4E3A;&#x8425;&#x6551;&#x5149;&#x7EEA;&#x5E1D;&#x8C2D;&#x55E3;&#x540C;&#x4E8E;&#x6CD5;&#x534E;&#x5BFA;&#x4E89;&#x53D6;&#x76F4;&#x96B6;&#x6309;&#x5BDF;&#x4F7F;&#x8881;&#x4E16;&#x51EF;&#x652F;&#x63F4;&#xFF0C;&#x5BC6;&#x8C0B;&#x6740;&#x8363;&#x7984;&#x3001;&#x56DA;&#x6148;&#x79A7;&#x3002;&#x56E0;&#x7EF4;&#x65B0;&#x6D3E;&#x4E0E;&#x987D;&#x56FA;&#x6D3E;&#x65E9;&#x5DF2;&#x5251;&#x62D4;&#x5F29;&#x5F20;&#xFF0C;&#x6C34;&#x706B;&#x4E0D;&#x5BB9;&#xFF0C;&#x8C2D;&#x55E3;&#x540C;&#x7B49;&#x7EF4;&#x65B0;&#x4E3B;&#x5C06;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x5B9E;&#x73B0;&#x65B0;&#x653F;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x5728;&#x5E1D;&#x515A;&#x4E0E;&#x540E;&#x515A;&#x7684;&#x5BAB;&#x5EF7;&#x653F;&#x53D8;&#x4E2D;&#xFF0C;&#x56E0;&#x8881;&#x4E16;&#x51EF;&#x544A;&#x5BC6;&#xFF0C;&#x5149;&#x7EEA;&#x5E1D;&#x88AB;&#x8F6F;&#x7981;&#xFF0C;&#x7EF4;&#x65B0;&#x6D3E;&#x4E3B;&#x5C06;6&#x4EBA;&#x88AB;&#x6355;&#x3002;9&#x6708;28&#x65E5;&#x8C2D;&#x55E3;&#x540C;&#x3001;&#x5EB7;&#x5E7F;&#x4EC1;&#x3001;&#x6797;&#x65ED;&#x3001;&#x6768;&#x6DF1;&#x79C0;&#x3001;&#x6768;&#x9510;&#x3001;&#x5218;&#x5149;&#x7B2C;&#x82F1;&#x52C7;&#x5C31;&#x4E49;&#x3002;&#xFEFF;</p>
<p>&#x5728;&#x751F;&#x6B7B;&#x9762;&#x524D;&#x8C2D;&#x55E3;&#x540C;&#x672C;&#x6709;&#x5F88;&#x591A;&#x751F;&#x5B58;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x65E5;&#x672C;&#x4F7F;&#x9986;&#x66FE;&#x6D3E;&#x4EBA;&#x8054;&#x7CFB;&#x4ED6;&#x627F;&#x8BFA;&#x201C;&#x63D0;&#x4F9B;&#x4FDD;&#x62A4;&#x201D;&#xFF0C;&#x8C2D;&#x541B;&#x65AD;&#x7136;&#x62D2;&#x7EDD;&#xFF0C;&#x4ED6;&#x8BF4;&#xFF1A;&#x201C;&#x4E0D;&#x6709;&#x884C;&#x8005;&#xFF0C;&#x65E0;&#x4EE5;&#x56FE;&#x5C06;&#x6765;&#xFF0C;&#x4E0D;&#x6709;&#x6B7B;&#x8005;&#xFF0C;&#x65E0;&#x4EE5;&#x53EC;&#x540E;&#x8D77;&#x3002;&#x201D;&#x8C2D;&#x55E3;&#x540C;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x4E66;&#x4FE1;&#x3001;&#x6587;&#x7A3F;&#x6258;&#x4ED8;&#x6881;&#x542F;&#x8D85;&#xFF0C;&#x529D;&#x6170;&#x5E76;&#x62A4;&#x9001;&#x6881;&#x9003;&#x4EA1;&#x65E5;&#x672C;&#x4F7F;&#x9986;&#xFF0C;&#x7EE7;&#x800C;&#x4E1C;&#x6E21;&#x65E5;&#x672C;&#x907F;&#x96BE;&#x3002;&#x5341;&#x4E07;&#x706B;&#x6025;&#x4E2D;&#xFF0C;&#x4E3A;&#x4E86;&#x51CF;&#x5C11;&#x65E0;&#x8C13;&#x7684;&#x727A;&#x7272;&#xFF0C;&#x4ED6;&#x9063;&#x6563;&#x4E86;&#x8EAB;&#x8FB9;&#x7684;&#x4EBA;&#xFF0C;&#x751A;&#x81F3;&#x201C;&#x66FF;&#x201D;&#x7236;&#x4EB2;&#x4E0A;&#x4E86;&#x4E00;&#x9053;&#x594F;&#x6298;&#x300A;&#x9EDC;&#x9769;&#x5FE4;&#x9006;&#x5B50;&#x55E3;&#x540C;&#x300B;&#xFF0C;&#x4EE5;&#x4FDD;&#x5168;&#x5BB6;&#x7236;&#x7684;&#x6027;&#x547D;&#x3002;24&#x65E5;&#xFF0C;&#x4E00;&#x5207;&#x5B89;&#x6392;&#x59A5;&#x5F53;&#x540E;&#xFF0C;&#x8C2D;&#x55E3;&#x540C;&#x50CF;&#x6700;&#x540E;&#x575A;&#x5B88;&#x9635;&#x5730;&#x7684;&#x5927;&#x5C06;&#xFF0C;&#x5728;&#x6D4F;&#x9633;&#x4F1A;&#x9986;&#x7B49;&#x5F85;&#x88AB;&#x6355;&#x3002;&#x72F1;&#x4E2D;&#xFF0C;&#x5199;&#x4E0B;&#x4E00;&#x9996;&#x8BD7;&#xFF1A;&#x201C;<em>&#x671B;&#x95E8;&#x6295;&#x6B62;&#x601D;&#x5F20;&#x4FED;&#xFF0C;&#x5FCD;&#x6B7B;&#x987B;&#x81FE;&#x5F85;&#x675C;&#x6839;&#x3002;&#x6211;&#x81EA;&#x6A2A;&#x5200;&#x5411;&#x5929;&#x7B11;&#xFF0C;&#x53BB;&#x7559;&#x809D;&#x80C6;&#x4E24;&#x6606;&#x4ED1;</em>&#x201D;&#x3002;&#x7528;&#x4E00;&#x5DF1;&#x4E4B;&#x6B7B;&#x4FDD;&#x5168;&#x4E86;&#x53D8;&#x6CD5;&#x7684;&#x706B;&#x79CD;&#xFF0C;&#x4EE5;&#x5F85;&#x6362;&#x6765;&#x4EBF;&#x4E07;&#x767E;&#x59D3;&#x7684;&#x65B0;&#x751F;&#x3002;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x5934;&#x9885;&#x8DF5;&#x884C;&#x201C;&#x6740;&#x8EAB;&#x6210;&#x4EC1;&#x201D;&#x7684;&#x300A;&#x4EC1;&#x5B66;&#x300B;&#x3002;&#x60CA;&#x5929;&#x5730;&#x3001;&#x6CE3;&#x9B3C;&#x795E;&#xFF01;&#xFEFF;</p>
<p>&#x5148;&#x70C8;&#x4EEC;&#x7684;&#x9C9C;&#x8840;&#x4E0D;&#x4F1A;&#x767D;&#x6D41;&#xFF0C;&#x5728;&#x8C2D;&#x55E3;&#x540C;&#x5012;&#x4E0B;&#x7684;&#x571F;&#x5730;&#x4E0A;&#xFF0C;&#x7AD9;&#x7ACB;&#x8D77;&#x6797;&#x89C9;&#x6C11;&#x3001;&#x79CB;&#x747E;&#x3001;&#x5B8B;&#x6559;&#x4EC1;&#x7B49;&#x65E0;&#x6570;&#x4E2A;&#x5FD7;&#x58EB;&#x4EC1;&#x4EBA;&#x3002;1911&#x5E74;10&#x6708;10&#x65E5;&#xFF0C;&#x6B66;&#x660C;&#x4E00;&#x58F0;&#x67AA;&#x54CD;&#x5212;&#x7834;&#x6F2B;&#x6F2B;&#x6697;&#x591C;&#xFF0C;&#x4E24;&#x5343;&#x591A;&#x5E74;&#x7684;&#x5E1D;&#x5236;&#x8F70;&#x7136;&#x5012;&#x584C;&#xFF01;&#x4EE4;&#x4EBA;&#x9057;&#x61BE;&#x7684;&#x7684;&#x662F;&#xFF0C;&#x7687;&#x5E1D;&#x6CA1;&#x4E86;&#x4E13;&#x5236;&#x8FD8;&#x5728;&#x3002;&#x5BAA;&#x653F;&#x4E4B;&#x8DEF;&#x4F9D;&#x7136;&#x6F2B;&#x957F;&#xFF0C;&#x7EF4;&#x6743;&#x4E4B;&#x8DEF;&#x6B65;&#x5C65;&#x7EF4;&#x8270;&#xFF0C;&#x6CD5;&#x6CBB;&#x4E4B;&#x8DEF;&#x8346;&#x68D8;&#x5BC6;&#x5E03;&#x2026;&#x2026;&#x63A8;&#x52A8;&#x793E;&#x4F1A;&#x8D70;&#x5411;&#x81EA;&#x7531;&#x6C11;&#x4E3B;&#x7684;&#x5EB7;&#x5E84;&#x5927;&#x9053;&#xFF0C;&#x60DF;&#x6709;&#x7EE7;&#x7EED;&#x542F;&#x8499;&#x3001;&#x60DF;&#x6709;&#x5168;&#x6C11;&#x7684;&#x89C9;&#x9192;&#x3001;&#x60DF;&#x6709;&#x4EBA;&#x4EBA;&#x8D77;&#x6765;&#x6297;&#x4E89;&#xFF01;&#xFEFF;</p>
<p>&#x5018;&#x82E5;&#x5386;&#x53F2;&#x53EF;&#x4EE5;&#x7C7B;&#x6BD4;&#xFF0C;&#x4E8C;&#x5341;&#x4E00;&#x4E16;&#x7EAA;&#x7684;&#x6211;&#x4EEC;&#x6B63;&#x5904;&#x4E8E;&#x6E05;&#x671D;&#x7EF4;&#x65B0;&#x4E4B;&#x540E;&#x7684;&#x5F98;&#x5F8A;&#x671F;&#x2026;&#x2026;&#x8FF7;&#x832B;&#x3001;&#x6323;&#x624E;&#x3001;&#x9635;&#x75DB;&#xFF0C;&#x53D8;&#x6CD5;&#x6539;&#x9769;&#x5C06;&#x4F1A;&#x5206;&#x5A29;&#x600E;&#x6837;&#x7684;&#x65B0;&#x751F;&#x513F;&#xFF1F;&#x6CA1;&#x6709;&#x6CD5;&#x6CBB;&#x548C;&#x6C11;&#x4E3B;&#x7684;&#x4FDD;&#x969C;&#xFF0C;&#x8C01;&#x4E5F;&#x4E0D;&#x80FD;&#x7F6E;&#x8EAB;&#x4E8B;&#x5916;&#x83B7;&#x5F97;&#x8C41;&#x514D;&#x6743;&#x3002;&#x8C2D;&#x55E3;&#x540C;&#x6B7B;&#x4E86;&#xFF0C;&#x4ED6;&#x4F9D;&#x7136;&#x6D3B;&#x7740;&#xFF0C;&#x4ED6;&#x6D3B;&#x5728;&#x6C11;&#x4F17;&#x751F;&#x751F;&#x4E0D;&#x606F;&#x7684;&#x81EA;&#x7531;&#x8840;&#x8109;&#x91CC;&#x3002;&#x8C2D;&#x55E3;&#x540C;&#x662F;&#x4E2D;&#x534E;&#x6C11;&#x65CF;&#x8FC7;&#x53BB;&#x3001;&#x73B0;&#x5728;&#x548C;&#x5C06;&#x6765;&#x7684;&#x4E00;&#x9762;&#x65D7;&#x5E1C;&#xFF0C;&#x4E00;&#x76CF;&#x4E0D;&#x706D;&#x7684;&#x7CBE;&#x795E;&#x706B;&#x70AC;&#xFF0C;&#x4E00;&#x5EA7;&#x4E0D;&#x673D;&#x7684;&#x6C11;&#x6743;&#x4E30;&#x7891;&#xFF01;&#xFEFF;</p>
<p>&#x53EA;&#x8981;&#x66B4;&#x529B;&#x4E0E;&#x8C0E;&#x8A00;&#x7EE7;&#x7EED;&#x6A2A;&#x884C;&#xFF0C;&#x6C11;&#x4F17;&#x5C31;&#x4E0D;&#x4F1A;&#x83B7;&#x5F97;&#x81EA;&#x7531;&#x3002;&#x9EBB;&#x9189;&#x836F;&#x548C;&#x5174;&#x594B;&#x5242;&#x4E0D;&#x80FD;&#x50AC;&#x5316;&#x51FA;&#x4E00;&#x4E2A;&#x4F1F;&#x5927;&#x7684;&#x6C11;&#x65CF;&#xFF0C;&#x8BF8;&#x541B;&#xFF0C;&#x9192;&#x9192;&#x5427;&#x3002;</p>
<p>&#x6211;&#x7684;&#x6F14;&#x8BB2;&#x5230;&#x6B64;&#x7ED3;&#x675F;&#xFF0C;&#x8C22;&#x8C22;&#x5927;&#x5BB6;&#x3002;</p>

      
    </div><!-- .entry-content -->

    <footer class="entry-meta">
    <a href="/2016/10/17/近代史演讲稿/">
    <time datetime="2016-10-17T13:11:00.000Z" class="entry-date">
        2016-10-17
    </time>
</a>
    
  <span class="article-delim">&#8226;</span>
  <div class="article-category">
  <a class="article-category-link" href="/categories/LIFE/">LIFE</a>
  </div>

    
    </footer>
</article>


    
<nav class="nav-single">
    <h3 class="assistive-text">文章导航</h3>
    
        <span class="nav-previous"><a href="/2016/10/19/结构体引用符的区别/" rel="prev"><span class="meta-nav">←</span> C结构体引用符&quot;.&quot;与&quot;-&gt;&quot;</a></span>
    
    
        <span class="nav-next"><a href="/2016/10/17/树与二叉树（六）/" rel="next">树与二叉树（六） <span class="meta-nav">→</span></a></span>
    
</nav><!-- .nav-single -->







</div></div>
        <div id="secondary" class="widget-area" role="complementary">
  
    <aside id="search" class="widget widget_search"><form role="search" method="get" accept-charset="utf-8" id="searchform" class="searchform" action="//google.com/search">
    <div>
        <input type="text" value="" name="s" id="s" />
        <input type="submit" id="searchsubmit" value="搜索" />
    </div>
</form></aside>
  
    
  
    
  <aside class="widget">
    <h3 class="widget-title">Categories</h3>
    <div class="widget-content">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/LIFE/">LIFE</a><span class="category-list-count">3</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/MAC/">MAC</a><span class="category-list-count">2</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/iOS/">iOS</a><span class="category-list-count">20</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/御宅文化/">御宅文化</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/编程/">编程</a><span class="category-list-count">48</span></li></ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Recents</h3>
    <div class="widget-content">
      <ul>
        
          <li>
            <a href="/2016/11/17/串的模式匹配问题/">串的模式匹配问题</a>
          </li>
        
          <li>
            <a href="/2016/11/17/散列表/">散列表</a>
          </li>
        
          <li>
            <a href="/2016/11/16/从零开始学习Linux-10/">从零开始学习Linux-10(正则表达式)</a>
          </li>
        
          <li>
            <a href="/2016/11/16/红黑树C实现/">红黑树C实现</a>
          </li>
        
          <li>
            <a href="/2016/11/15/从零开始学习Linux-9/">从零开始学习Linux-9</a>
          </li>
        
      </ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Tags</h3>
    <div class="widget-content">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/Cocoapods/">Cocoapods</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/HTML/">HTML</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Linux/">Linux</a><span class="tag-list-count">11</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Matlab/">Matlab</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIColor/">UIColor</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView/">UIView</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView-圆角/">UIView-圆角</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/bug/">bug</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/hexo/">hexo</a><span class="tag-list-count">4</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/指针/">指针</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/数据结构/">数据结构</a><span class="tag-list-count">20</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/算法/">算法</a><span class="tag-list-count">8</span></li></ul>
    </div>
  </aside>

  
    
<div class="widget tag">
<h3 class="title">blogroll</h3>
<ul class="entry">


<li><a href="https://github.com/" target="_blank">github</a></li>


<li><a href="http://www.jianshu.com/users/41cd7711ed44/latest_articles" target="_blank">我的简书主页</a></li>

</ul>
</div>

  
</div>
      </div>
      <footer id="colophon" role="contentinfo">
    <p>&copy; 2016 SaberDa
    All rights reserved.</p>
    <p>Powered by <a href="http://hexo.io/" target="_blank">Hexo</a></p>
</footer>
    <script>window._bd_share_config={"common":{"bdSnsKey":{},"bdText":"","bdMini":"1","bdMiniList":false,"bdPic":"","bdStyle":"2","bdSize":"16"},"share":{}};with(document)0[(getElementsByTagName('head')[0]||body).appendChild(createElement('script')).src='http://bdimg.share.baidu.com/static/api/js/share.js?v=89860593.js?cdnversion='+~(-new Date()/36e5)];</script>

<script src="/js/jquery-2.0.3.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

<script src="/js/navigation.js"></script>

<div id="bg"></div>

  </div>
</body>
</html>