<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  
  <meta name="description" content="阿尔托利亚是我老婆~" />
  

  
  
  
  
  
  
  <title>当进程变为线程 | SaberDa的幻想乡</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x5931;&amp;#x671B;&amp;#x662F;&amp;#x4E00;&amp;#x5929;&amp;#x5929;&amp;#x79EF;&amp;#x7D2F;&amp;#x7684;&amp;#xFF0C;&amp;#x79BB;&amp;#x5F00;&amp;#x662F;&amp;#x5F88;&amp;#x957F;&amp;#x7684;&amp;#x51B3;&amp;#x5B9A;&amp;#x3002;
&amp;#x8FD9;&amp;#x662F;&amp;#x4E00;&amp;#x7BC7;&amp;#x81EA;&amp;#x6211">
<meta property="og:type" content="article">
<meta property="og:title" content="当进程变为线程">
<meta property="og:url" content="https://saberda.github.io/2016/11/15/当进程变为线程/index.html">
<meta property="og:site_name" content="SaberDa的幻想乡">
<meta property="og:description" content="&amp;#x5931;&amp;#x671B;&amp;#x662F;&amp;#x4E00;&amp;#x5929;&amp;#x5929;&amp;#x79EF;&amp;#x7D2F;&amp;#x7684;&amp;#xFF0C;&amp;#x79BB;&amp;#x5F00;&amp;#x662F;&amp;#x5F88;&amp;#x957F;&amp;#x7684;&amp;#x51B3;&amp;#x5B9A;&amp;#x3002;
&amp;#x8FD9;&amp;#x662F;&amp;#x4E00;&amp;#x7BC7;&amp;#x81EA;&amp;#x6211">
<meta property="og:updated_time" content="2016-11-14T18:06:00.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="当进程变为线程">
<meta name="twitter:description" content="&amp;#x5931;&amp;#x671B;&amp;#x662F;&amp;#x4E00;&amp;#x5929;&amp;#x5929;&amp;#x79EF;&amp;#x7D2F;&amp;#x7684;&amp;#xFF0C;&amp;#x79BB;&amp;#x5F00;&amp;#x662F;&amp;#x5F88;&amp;#x957F;&amp;#x7684;&amp;#x51B3;&amp;#x5B9A;&amp;#x3002;
&amp;#x8FD9;&amp;#x662F;&amp;#x4E00;&amp;#x7BC7;&amp;#x81EA;&amp;#x6211">
  
  
    <link rel="icon" href="/css/images/favicon.ico">
  
  <link rel="stylesheet" href="/css/style.css">
  

  
  <!-- baidu webmaster push -->
  <script src='//push.zhanzhang.baidu.com/push.js'></script>
</head>
<body class="home blog custom-background custom-font-enabled single-author">
  <div id="page" class="hfeed site">
      <header id="masthead" class="site-header" role="banner">
    <hgroup>
      <h1 class="site-title">
        <a href="/" title="SaberDa的幻想乡" rel="home">SaberDa的幻想乡</a>
      </h1>
      
        <h2 class="site-description">
          <a href="/" id="subtitle">　　iOS/ ML　　|　　二次元　　|　　saberda@qq.com　　|　　从花时间省钱到花钱省时间</a>
        </h2>
      
    </hgroup>

    <nav id="site-navigation" class="main-navigation" role="navigation">
            <button class="menu-toggle">菜单</button>
            <a class="assistive-text" href="/#content" title="跳至内容">跳至内容</a><!--TODO-->
            <div class="menu-main-container">
                <ul id="menu-main" class="nav-menu">
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/archives">所有文章</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/">主页</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/编程/">编程</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/iOS/">iOS</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/ML/">ML</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/PGM/">PGM</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/MAC/">MAC</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/御宅文化/">御宅文化</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/LIFE/">LIFE</a></li>
                
                </ul>
            </div>
    </nav>
</header>
      <div id="main" class="wrapper">
        <div id="primary" class="site-content"><div id="content" role="main"><article id="post-当进程变为线程" class="post-当进程变为线程 post type-post status-publish format-standard hentry">
    <!---->

      <header class="entry-header">
        
        
  
    <h1 class="entry-title article-title">
      当进程变为线程
    </h1>
  

        
        <div class="comments-link">
            
            <a href="javascript:void(0);" data-url="https://saberda.github.io/2016/11/15/当进程变为线程/" data-id="cjbai219u007nq4b3jerm4y1q" class="leave-reply bdsharebuttonbox" data-cmd="more">Share</a>
        </div><!-- .comments-link -->
      </header><!-- .entry-header -->

    <div class="entry-content">
      
        <pre><code>&#x5931;&#x671B;&#x662F;&#x4E00;&#x5929;&#x5929;&#x79EF;&#x7D2F;&#x7684;&#xFF0C;&#x79BB;&#x5F00;&#x662F;&#x5F88;&#x957F;&#x7684;&#x51B3;&#x5B9A;&#x3002;
</code></pre><p>&#x8FD9;&#x662F;&#x4E00;&#x7BC7;&#x81EA;&#x6211;&#x611F;&#x89C9;&#x5145;&#x6EE1;&#x8D1F;&#x80FD;&#x91CF;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x614E;&#x8BFB;&#x3002;&#x800C;&#x4E14;&#x73B0;&#x5728;&#x5FC3;&#x60C5;&#x76F8;&#x5F53;&#x4F4E;&#x843D;&#xFF0C;&#x6587;&#x7AE0;&#x7684;&#x7ED3;&#x6784;&#x4E5F;&#x5E94;&#x8BE5;&#x4F1A;&#x5F88;&#x4E71;&#x5427;&#xFF0C;&#x5475;&#x5475;</p>
<p>&#x6700;&#x8FD1;&#x611F;&#x89C9;&#x662F;&#x6211;&#x8FD9;&#x201C;&#x6F2B;&#x957F;&#x201D;&#x7684;19&#x5E74;&#x7684;&#x4EBA;&#x751F;&#x4E2D;&#x9047;&#x5230;&#x7684;&#x6700;&#x4E3A;&#x4F4E;&#x843D;&#x7684;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6BB5;&#x5427;&#xFF0C;&#x9AD8;&#x8003;&#x6210;&#x7EE9;&#x51FA;&#x6765;&#x65F6;&#x611F;&#x89C9;&#x90FD;&#x4E0D;&#x5982;&#x73B0;&#x5728;&#x8FD9;&#x4E48;&#x96BE;&#x8FC7;&#x3002;&#x4E5F;&#x8BB8;&#x662F;&#x8BFB;&#x7684;&#x4E66;&#x6BD4;&#x8F83;&#x591A;&#x5427;&#xFF0C;&#x4EBA;&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x77EB;&#x60C5;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x4E9B;&#x8BDD;&#x5835;&#x5728;&#x5FC3;&#x91CC;&#x786E;&#x5B9E;&#x4E0D;&#x8212;&#x670D;&#xFF0C;&#x8FD8;&#x4E0D;&#x5982;&#x5199;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x53CD;&#x6B63;&#x4E5F;&#x6CA1;&#x4EBA;&#x4F1A;&#x770B;&#x3002;</p>
<a id="more"></a>
<p>&#x5728;&#x5199;&#x4E4B;&#x524D;&#x5148;&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x7684;&#x80CC;&#x666F;&#x5427;&#xFF0C;&#x4E5F;&#x80FD;&#x8BA9;&#x4F60;&#x4EEC;&#xFF08;&#x51E0;&#x4E2A;&#x4EBA;&#x80FD;&#x770B;&#x5230;&#x5C31;&#x611F;&#x89C9;&#x4E0D;&#x9519;&#x4E86;&#xFF09;&#x65B9;&#x4FBF;&#x7406;&#x89E3;&#x3002;&#x672C;&#x4EBA;&#x73B0;&#x5927;&#x4E8C;&#xFF0C;&#x5C31;&#x8BFB;&#x4E8E;&#x897F;&#x5B89;&#x67D0;211&#x5DE5;&#x79D1;&#x5927;&#x5B66;&#xFF0C;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x7CFB;&#xFF0C;&#x4EBA;&#x4E0D;&#x80FD;&#x8BF4;&#x592A;&#x5E05;&#x4E5F;&#x4E0D;&#x662F;&#x8FC7;&#x4E8E;&#x4E11;&#x964B;(&#x81EA;&#x604B;&#x8138;&#xFF0C;&#x563F;)&#x3002;&#x81EA;&#x8BA4;&#x4E3A;&#x8FD8;&#x662F;&#x6709;&#x4E00;&#x70B9;&#x6280;&#x672F;&#x7684;&#xFF0C;&#x6BD5;&#x7ADF;&#x5728;&#x5927;&#x4E00;&#x65F6;&#x5C1D;&#x8BD5;&#x8FC7;&#x81EA;&#x5DF1;&#x5199;iOS&#x7684;app&#x5E76;&#x4E14;&#x6210;&#x529F;&#x4E86;&#xFF0C;&#x5176;&#x4F59;&#x7684;&#x5BF9;&#x5404;&#x65B9;&#x9762;&#x90FD;&#x6709;&#x6D89;&#x730E;&#xFF0C;&#x5E73;&#x65F6;&#x8BFB;&#x7684;&#x4E66;&#x4E5F;&#x7B97;&#x662F;&#x6BD4;&#x8F83;&#x591A;&#x7684;&#x5427;&#xFF0C;&#x9664;&#x4E86;&#x4E0D;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x4E0E;&#x559C;&#x6B22;&#x7684;&#x5973;&#x751F;&#x8BF4;&#x8BDD;&#x5916;&#x4E00;&#x822C;&#x4EBA;&#x8BE5;&#x70B9;&#x7684;&#x6280;&#x80FD;&#x70B9;&#x4E5F;&#x90FD;&#x70B9;&#x4E86;&#x3002;</p>
<p>&#x4E8B;&#x60C5;&#x7684;&#x8D77;&#x56E0;&#x5728;&#x4E24;&#x4E2A;&#x6708;&#x524D;&#x5427;&#xFF0C;&#x90A3;&#x65F6;&#x4E0D;&#x77E5;&#x600E;&#x4E48;&#x7684;&#xFF0C;&#x56DE;&#x5934;&#x65F6;&#x4E0D;&#x7ECF;&#x610F;&#x770B;&#x5230;&#x4E86;&#x67D0;&#x4E2A;&#x4EBA;&#x7684;&#x4FA7;&#x8138;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x611F;&#x89C9;&#xFF0C;&#x559C;&#x6B22;&#x4E0A;&#x5979;&#x4E86;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x53EF;&#x4E0D;&#x662F;&#x5F88;&#x968F;&#x610F;&#x4F1A;&#x559C;&#x6B22;&#x4E0A;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x5BB6;&#x4F19;&#xFF0C;&#x5E73;&#x5E38;&#x53EF;&#x662F;&#x7981;&#x6B32;&#x7CFB;&#x7684;&#x3002;&#x5F53;&#x65F6;&#x611F;&#x89C9;&#x65F6;&#x95F4;&#x90FD;&#x6162;&#x4E86;&#x4E0B;&#x6765;&#xFF0C;&#x773C;&#x524D;&#x80FD;&#x770B;&#x5230;&#x7684;&#x5C31;&#x662F;&#x5979;&#x7684;&#x773C;&#x775B;&#x4E00;&#x7728;&#x4E00;&#x7728;&#x7684;&#x770B;&#x7740;&#x8BFE;&#x672C;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x83AB;&#x540D;&#x5176;&#x5999;&#x7684;&#x5FC3;&#x52A8;&#x4E86;&#xFF0C;&#x6240;&#x8C13;&#x662F;&#x60C5;&#x4E0D;&#x77E5;&#x6240;&#x8D77;&#xFF0C;&#x4E00;&#x5F80;&#x800C;&#x60C5;&#x6DF1;&#x5427;&#x3002;</p>
<p>&#x7136;&#x540E;&#x5C31;&#x5F00;&#x59CB;&#x75AF;&#x72C2;&#x7684;&#x5B66;&#x4E60;&#x6280;&#x80FD;&#xFF08;&#x4EE5;&#x524D;&#x6211;&#x662F;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x64A9;&#x59B9;&#x6280;&#x80FD;&#x7684;&#xFF0C;&#x9AD8;&#x4E2D;&#x5C31;&#x662F;&#x91CD;&#x70B9;&#x7406;&#x79D1;&#x73ED;&#xFF0C;&#x7537;&#x5973;&#x6BD4;&#x4F8B;&#x8FD8;&#x4E0D;&#x5982;&#x73B0;&#x5728;&#x5C31;&#x8BFB;&#x7684;&#x5DE5;&#x79D1;&#x5927;&#x5B66;&#xFF0C;&#x6240;&#x4EE5;&#x5927;&#x5BB6;&#x61C2;&#x5F97;&#xFF09;&#xFF0C;&#x4E0A;&#x77E5;&#x4E4E;&#x4E0A;&#x8D34;&#x5427;&#x901B;&#x5404;&#x79CD;&#x8BBA;&#x575B;&#xFF0C;&#x5B66;&#x4E60;&#x600E;&#x4E48;&#x548C;&#x5973;&#x751F;&#x8BF4;&#x8BDD;&#xFF0C;&#x5B66;&#x4E60;&#x600E;&#x4E48;&#x63D0;&#x9AD8;&#x81EA;&#x5DF1;&#x7684;&#x8863;&#x7740;&#x6253;&#x626E;&#xFF0C;&#x5B66;&#x4E60;&#x5404;&#x79CD;&#x611F;&#x89C9;&#x80FD;&#x8BA9;&#x5979;&#x6CE8;&#x610F;&#x5230;&#x6211;&#x7684;&#x4EFB;&#x4F55;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x4E4B;&#x540E;&#x5C31;&#x5F00;&#x59CB;&#x51C6;&#x5907;&#x53BB;&#x63A5;&#x89E6;&#x5979;&#x3002;&#x6B63;&#x597D;&#x8D76;&#x4E0A;&#x5B66;&#x6821;&#x7684;&#x4E00;&#x4E2A;&#x5F3A;&#x5236;&#x53C2;&#x52A0;&#x7684;&#x5783;&#x573E;&#x6BD4;&#x8D5B;&#xFF0C;&#x5C31;&#x95EE;&#x5979;&#x201C;&#x4E00;&#x8D77;&#x7EC4;&#x961F;&#x554A;&#xFF0C;&#x6211;&#x5199;app&#xFF0C;&#x4F60;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x7528;&#x5E72;&#x201D;&#xFF0C;&#x5979;&#x5F88;&#x5FEB;&#x5C31;&#x540C;&#x610F;&#x4E86;&#x3002;&#x8FD9;&#x7B97;&#x662F;&#x4E00;&#x5207;&#x7684;&#x5F00;&#x59CB;&#x5427;&#x3002;&#x4E3B;&#x8981;&#x662F;&#x5F53;&#x65F6;&#x5728;&#x77E5;&#x4E4E;&#x4E0A;&#x770B;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x6761;&#x95EE;&#x7B54;&#xFF0C;&#x95EE;&#x9898;&#x662F;&#x201C;&#x7A0B;&#x5E8F;&#x5458;&#x600E;&#x4E48;&#x64A9;&#x59B9;&#x201D;&#xFF0C;&#x6211;&#x8BB0;&#x5F97;&#x6709;&#x4E2A;&#x56DE;&#x7B54;&#x662F;&#x201C;&#x5199;&#x4E00;&#x4E2A;&#x4EE5;&#x59D1;&#x5A18;&#x547D;&#x540D;&#x7684;APP&#x9001;&#x7ED9;&#x5979;&#x5427;&#x201D;&#x3002;&#x6211;&#x5C31;&#x50BB;&#x4E4E;&#x4E4E;&#x7684;&#x53BB;&#x5C1D;&#x8BD5;&#x4E86;&#xFF0C;&#x82B1;&#x4E86;&#x5C06;&#x8FD1;1.5&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5199;&#x51FA;&#x4E86;&#x4E00;&#x6B3E;&#x53EF;&#x4EE5;&#x653E;&#x5728;&#x53F0;&#x9762;&#x7684;iOS&#x76F4;&#x64AD;APP&#xFF0C;&#x7136;&#x540E;&#x5174;&#x9AD8;&#x91C7;&#x70C8;&#x7684;&#x5C06;&#x5E94;&#x7528;&#x8FD0;&#x884C;&#x622A;&#x56FE;&#x53D1;&#x5230;&#x7A7A;&#x95F4;&#x53BB;&#x4E86;&#xFF0C;&#x5E0C;&#x671B;&#x5979;&#x80FD;&#x770B;&#x89C1;&#x5E76;&#x4E14;&#x56E0;&#x6B64;&#x9AD8;&#x5174;&#xFF0C;&#x7136;&#x800C;&#x8FDE;&#x8D5E;&#x90FD;&#x6CA1;&#x6709;&#x8D5E;&#x4E00;&#x4E0B;&#xFF0C;&#x5E94;&#x8BE5;&#x662F;&#x6211;&#x592A;&#x81EA;&#x4F5C;&#x591A;&#x60C5;&#x4E86;&#xFF0C;&#x5F53;&#x5929;&#x4E0B;&#x5348;&#x5C31;&#x5FC3;&#x7070;&#x610F;&#x51B7;&#x7684;&#x628A;&#x8FD9;&#x6761;&#x8BF4;&#x8BF4;&#x5220;&#x4E86;&#x3002;</p>
<p>&#x5728;&#x5341;&#x4E00;&#x4E4B;&#x540E;&#x6CA1;&#x51E0;&#x5929;&#xFF0C;&#x7EA6;&#x5979;&#x53C2;&#x52A0;GDG&#xFF0C;&#x51FA;&#x4EBA;&#x610F;&#x6599;&#x7684;&#x662F;&#x5979;&#x7ADF;&#x7136;&#x7B54;&#x5E94;&#x4E86;&#xFF0C;&#x6211;&#x5F53;&#x65F6;&#x771F;&#x7684;&#x5F88;&#x6FC0;&#x52A8;&#x5F88;&#x6FC0;&#x52A8;&#xFF0C;&#x7136;&#x540E;&#x65E9;&#x65E9;&#x7684;&#x5B89;&#x6392;&#x90A3;&#x5929;&#x7684;&#x884C;&#x7A0B;&#xFF0C;&#x4ECE;&#x51FA;&#x53D1;&#x7684;&#x8F66;&#x8F86;&#xFF0C;&#x5230;&#x7528;&#x9910;&#x5730;&#x70B9;&#xFF0C;&#x90FD;&#x5B89;&#x6392;&#x597D;&#x4E86;&#x3002;&#x786E;&#x5B9E;&#xFF0C;&#x90A3;&#x5929;&#x611F;&#x89C9;&#x662F;&#x6211;&#x6700;&#x5E78;&#x798F;&#x7684;&#x4E00;&#x5929;&#xFF0C;&#x7528;&#x4E00;&#x79CD;&#x5C4C;&#x4E1D;&#x5FC3;&#x6001;&#x6765;&#x8BB2;&#xFF0C;&#x79BB;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x7684;&#x4EBA;&#x90A3;&#x4E48;&#x8FD1;&#x771F;&#x7684;&#x5F88;&#x5E78;&#x798F;&#x3002;&#x5F53;&#x65F6;&#x7B97;&#x662F;&#x8001;&#x5929;&#x5E2E;&#x6211;&#x5427;&#xFF0C;&#x56DE;&#x5B66;&#x6821;&#x65F6;&#x5979;&#x53BB;&#x53D6;&#x5979;&#x5988;&#x5988;&#x90AE;&#x8FC7;&#x6765;&#x7684;&#x51AC;&#x5B63;&#x7684;&#x8863;&#x670D;&#xFF0C;&#x5F88;&#x5927;&#x7684;&#x4E00;&#x7BB1;&#x8863;&#x670D;&#xFF0C;&#x6211;&#x81EA;&#x7136;&#x800C;&#x7136;&#x7684;&#x63A5;&#x4E86;&#x8FC7;&#x6765;&#x5E2E;&#x62AC;&#x5230;&#x5BBF;&#x820D;&#x3002;&#x6B63;&#x597D;&#x5929;&#x8FD8;&#x5728;&#x4E0B;&#x96E8;&#xFF0C;&#x5979;&#x5C31;&#x5E2E;&#x6211;&#x6253;&#x4F1E;&#xFF0C;&#x4EE5;&#x524D;&#x6211;&#x4E00;&#x76F4;&#x62B1;&#x6028;&#x5927;&#x95E8;&#x5230;&#x5BBF;&#x820D;&#x7684;&#x8DDD;&#x79BB;&#x600E;&#x4E48;&#x8FD9;&#x4E48;&#x8FDC;&#xFF0C;&#x90A3;&#x65F6;&#x6211;&#x5E0C;&#x671B;&#x8FD9;&#x6761;&#x8DEF;&#x6C38;&#x8FDC;&#x90FD;&#x8D70;&#x4E0D;&#x5B8C;&#x3002;&#x771F;&#x7684;&#xFF0C;&#x8DEF;&#x4E0A;&#x6211;&#x60F3;&#x7740;&#x60F3;&#x7740;&#x5C31;&#x60C5;&#x4E0D;&#x81EA;&#x7981;&#x7684;&#x50BB;&#x7B11;&#x51FA;&#x6765;&#xFF0C;&#x95FB;&#x7740;&#x559C;&#x6B22;&#x7684;&#x4EBA;&#x8EAB;&#x4E0A;&#x7684;&#x6DE1;&#x6DE1;&#x7684;&#x6E05;&#x9999;&#xFF0C;&#x559C;&#x6B22;&#x7684;&#x4EBA;&#x5E2E;&#x4F60;&#x6491;&#x4F1E;&#xFF0C;&#x662F;&#x4EBA;&#x90FD;&#x4F1A;&#x50BB;&#x7B11;&#x7684;&#x5427;&#x3002;&#x90A3;&#x4E2A;&#x4E0B;&#x5348;&#xFF0C;&#x4E5F;&#x8BB8;&#x662F;&#x6211;19&#x5E74;&#x6765;&#x6700;&#x5F00;&#x5FC3;&#x7684;&#x4E00;&#x4E2A;&#x4E0B;&#x5348;&#xFF0C;&#x80AF;&#x5B9A;&#x662F;&#x6700;&#x5F00;&#x5FC3;&#x7684;&#x4E00;&#x4E2A;&#x4E0B;&#x5348;&#x3002;</p>
<p>&#x4E4B;&#x540E;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#x5C31;&#x6CA1;&#x7528;&#x8FD9;&#x4E48;&#x597D;&#x4E86;&#xFF0C;&#x5F53;&#x7136;&#x4E3B;&#x8981;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x4E4B;&#x540E;&#x7684;&#x4E8B;&#x60C5;&#x90FD;&#x662F;&#x6211;&#x7684;&#x8FC7;&#x9519;&#x3002;</p>
<p>&#x90A3;&#x65F6;&#x671F;&#x4E2D;&#x8003;&#x8BD5;&#x524D;&#x4E00;&#x5468;&#x5427;&#xFF0C;&#x6211;&#x95EE;&#x5979;&#xFF0C;&#x8003;&#x8BD5;&#x540E;&#x4E00;&#x8D77;&#x53BB;&#x770B;&#x300A;&#x5947;&#x5F02;&#x535A;&#x58EB;&#x300B;&#x554A;&#x3002;&#x5979;&#x8BF4;&#xFF0C;&#x5979;&#x7236;&#x6BCD;&#x6765;&#x3002;&#x8FD9;&#x662F;&#x6211;&#x60F3;&#x8D77;&#x6765;&#xFF0C;&#x5F53;&#x65F6;&#x5979;&#x786E;&#x5B9E;&#x8BF4;&#x8FC7;&#x5979;&#x7236;&#x6BCD;&#x6765;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x81EA;&#x5DF1;&#x8BA2;&#x7684;&#x4E00;&#x5F20;&#x4E07;&#x8FBE;&#x7684;&#x7535;&#x5F71;&#x7968;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5728;&#x8003;&#x8BD5;&#x540E;&#x7684;&#x90A3;&#x4E2A;&#x5468;&#x672B;&#xFF0C;&#x5979;&#x548C;&#x5979;&#x95FA;&#x871C;&#x5728;&#x73ED;&#x7EA7;&#x7684;&#x5FAE;&#x4FE1;&#x7FA4;&#x91CC;&#x95EE;&#x8C01;&#x53BB;&#x770B;&#x300A;&#x5947;&#x5F02;&#x535A;&#x58EB;&#x300B;&#x3002;&#x6211;&#x5F53;&#x65F6;&#x770B;&#x5230;&#x8FD9;&#x6761;&#x4FE1;&#x606F;&#x65F6;&#x5DF2;&#x7ECF;&#x8FC7;&#x53BB;&#x633A;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x4E86;&#xFF0C;&#x4F46;&#x8FD8;&#x662F;&#x95EE;&#x4E86;&#x4E00;&#x53E5;&#xFF0C;&#x8FD8;&#x7F3A;&#x4EBA;&#x5417;&#xFF1F;&#x5F53;&#x7136;&#x88AB;&#x5A49;&#x62D2;&#x4E86;&#x3002;&#x5F53;&#x65F6;&#x771F;&#x7684;&#x5F88;&#x751F;&#x6C14;&#xFF0C;&#x4E0D;&#x662F;&#x8BF4;&#x7236;&#x6BCD;&#x6765;&#x5417;&#xFF0C;&#x600E;&#x4E48;&#x53C8;&#x53BB;&#x770B;&#x7535;&#x5F71;&#x4E86;&#xFF0C;&#x788D;&#x4E8E;&#x9762;&#x5B50;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x53BB;&#x95EE;&#x5979;&#x3002;&#x6211;&#x5FD8;&#x4E86;&#x6211;&#x5F53;&#x65F6;&#x662F;&#x4EE5;&#x4EC0;&#x4E48;&#x5FC3;&#x60C5;&#x81EA;&#x5DF1;&#x53BB;&#x770B;&#x7684;&#x7535;&#x5F71;&#xFF0C;&#x603B;&#x4E4B;&#x5F53;&#x65F6;&#x5F88;&#x5931;&#x671B;&#x5F88;&#x5931;&#x671B;&#x3002;</p>
<p>&#x4E4B;&#x524D;&#x4E5F;&#x9080;&#x8BF7;&#x8FC7;&#x4E00;&#x8D77;&#x53BB;&#x56FE;&#x4E66;&#x9986;&#xFF0C;&#x5979;&#x786E;&#x5B9E;&#x559C;&#x6B22;&#x5728;&#x5BDD;&#x5BA4;&#x5B66;&#x4E60;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x6CA1;&#x6709;&#x6210;&#x529F;&#x3002;&#x8FD9;&#x51E0;&#x6B21;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x5C31;&#x4E0D;&#x6562;&#x518D;&#x53BB;&#x9080;&#x8BF7;&#x4ED6;&#x53C2;&#x52A0;&#x4EC0;&#x4E48;&#x6D3B;&#x52A8;&#x4E86;&#xFF0C;&#x5BB3;&#x6015;&#x5979;&#x5C06;&#x62D2;&#x7EDD;&#x6211;&#x517B;&#x6210;&#x4E00;&#x4E2A;&#x4E60;&#x60EF;&#x3002;&#x8FD9;&#x4E2A;&#x671F;&#x95F4;&#x6211;&#x8FC7;&#x7684;&#x771F;&#x7684;&#x5F88;&#x714E;&#x71AC;&#xFF0C;&#x66FE;&#x8BD5;&#x56FE;&#x901A;&#x8FC7;&#x4E0D;&#x65AD;&#x7684;&#x53BB;&#x8BFB;&#x4E66;&#x662F;&#x6211;&#x6682;&#x65F6;&#x5FD8;&#x6389;&#x8FD9;&#x4E9B;&#x70E6;&#x5FC3;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x671F;&#x95F4;&#x4E5F;&#x4E0D;&#x65AD;&#x7684;&#x548C;&#x5BA4;&#x53CB;&#x54A8;&#x8BE2;&#xFF0C;&#x4ED6;&#x4EEC;&#x8BF4;&#x6B63;&#x5E38;&#xFF0C;&#x603B;&#x4E4B;&#x662F;&#x8BA9;&#x6211;&#x7EE7;&#x7EED;&#x52AA;&#x529B;&#x7684;&#x610F;&#x601D;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x4E5F;&#x4E0D;&#x53EF;&#x80FD;&#x56E0;&#x4E3A;&#x8FD9;&#x51E0;&#x6B21;&#x800C;&#x653E;&#x5F03;&#x3002;</p>
<p>&#x5F53;&#x65F6;&#x7684;&#x6211;&#x771F;&#x7684;&#x5F88;&#x60F3;&#x4E86;&#x89E3;&#x5979;&#x7684;&#x559C;&#x597D;&#xFF0C;&#x6BD4;&#x8F83;&#x7A81;&#x7136;&#x7684;&#x95EE;&#x4E86;&#x5979;&#x7684;&#x95FA;&#x871C;&#xFF0C;&#x5979;&#x90FD;&#x559C;&#x6B22;&#x4EC0;&#x4E48;&#x3002;&#x5979;&#x95FA;&#x871C;&#x7ED9;&#x6211;&#x53D1;&#x4E86;&#x4E00;&#x4E2A;&#x7B11;&#x8138;&#x540E;&#x5C31;&#x4E0D;&#x56DE;&#x8BDD;&#x4E86;&#x3002;&#x6211;&#x5FC3;&#x60F3;&#xFF0C;&#x80AF;&#x5B9A;&#x662F;&#x5C06;&#x8FD9;&#x4E2A;&#x4E8B;&#x544A;&#x8BC9;&#x5979;&#x4E86;&#x554A;&#xFF0C;&#x5979;&#x77E5;&#x9053;&#x540E;&#x751F;&#x6C14;&#x4E86;&#x3002;&#x603B;&#x4E4B;&#x8FC7;&#x4E86;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x5979;&#x95FA;&#x871C;&#x624D;&#x56DE;&#x8BDD;&#xFF0C;&#x5C31;&#x662F;&#x5973;&#x751F;&#x559C;&#x6B22;&#x7684;&#x4E1C;&#x897F;&#x554A;&#x3002;&#x6211;&#x5F53;&#x65F6;&#x771F;&#x7684;&#x5F88;&#x60F3;&#x9A82;&#x5A18;&#xFF0C;&#x6211;&#x8981;&#x662F;&#x77E5;&#x9053;&#x6211;&#x8FD8;&#x95EE;&#x4F60;&#x5417;&#x3002;&#x3002;&#x3002;&#x540C;&#x65F6;&#x6211;&#x4E5F;&#x5927;&#x6982;&#x731C;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x5979;&#x5BF9;&#x6211;&#x5E94;&#x8BE5;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF0C;&#x5426;&#x5219;&#x5979;&#x95FA;&#x871C;&#x4E5F;&#x4E0D;&#x80FD;&#x6577;&#x884D;&#x6211;&#x3002;&#x5F53;&#x7136;&#x6577;&#x884D;&#x7684;&#x4E0D;&#x53EA;&#x662F;&#x8FD9;&#x4E00;&#x53E5;&#x3002;&#x5F53;&#x65F6;&#x4E5F;&#x662F;&#x5FEB;11&#x70B9;&#x4E86;&#x5427;&#xFF0C;&#x6211;&#x5728;&#x5E8A;&#x4E0A;&#x770B;&#x5230;&#x8FD9;&#x6761;&#x6D88;&#x606F;&#x65F6;&#x76F4;&#x63A5;&#x5C31;&#x54ED;&#x4E86;&#x51FA;&#x6765;&#xFF0C;&#x5F88;&#x61E6;&#x5F31;&#x662F;&#x5427;&#xFF0C;&#x5F53;&#x65F6;&#x771F;&#x7684;&#x5F88;&#x4F24;&#x5FC3;&#x5F88;&#x4F24;&#x5FC3;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5F53;&#x65F6;&#x8FD8;&#x6CA1;&#x6709;&#x6253;&#x7B97;&#x653E;&#x5F03;&#xFF0C;&#x6240;&#x4EE5;&#x51B3;&#x5B9A;&#x5C1D;&#x8BD5;&#x878D;&#x5165;&#x5979;&#x751F;&#x6D3B;&#x7684;&#x5708;&#x5B50;&#x3002;&#x6211;&#x77E5;&#x9053;&#x5979;&#x559C;&#x6B22;&#x770B;&#x7EFC;&#x827A;&#x300A;&#x6211;&#x662F;&#x7537;&#x5B50;&#x6C49;&#x300B;&#xFF0C;&#x5C31;&#x53BB;&#x767E;&#x5EA6;&#x4E0A;&#x770B;&#xFF0C;&#x4F46;&#x662F;&#x771F;&#x7684;&#x5BF9;&#x8FD9;&#x4E2A;&#x6CA1;&#x6709;&#x5174;&#x8DA3;&#xFF0C;&#x770B;&#x770B;&#x603B;&#x662F;&#x7761;&#x7740;&#xFF0C;&#x5C31;&#x653E;&#x5F03;&#x4E86;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x3002;&#x7136;&#x540E;&#x5F00;&#x59CB;&#x51C6;&#x5907;&#x73A9;&#x5979;&#x559C;&#x6B22;&#x7684;&#x684C;&#x6E38;&#x72FC;&#x4EBA;&#x6740;&#xFF0C;&#x8FD9;&#x4E2A;&#x684C;&#x6E38;&#x6211;&#x6700;&#x540E;&#x4E00;&#x6B21;&#x63A5;&#x89E6;&#x662F;&#x5728;&#x9AD8;&#x4E8C;&#xFF0C;&#x800C;&#x4E14;&#x89C4;&#x5219;&#x8FDC;&#x6CA1;&#x6709;&#x5979;&#x4EEC;&#x73A9;&#x7684;&#x590D;&#x6742;&#xFF0C;&#x6211;&#x53EA;&#x597D;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#xFF0C;&#x4E0A;&#x7F51;&#x627E;&#x7ECF;&#x5178;&#x6559;&#x7A0B;&#x3002;&#x6211;&#x5F53;&#x65F6;&#x751A;&#x81F3;&#x628A;&#x5B66;&#x4E60;&#x72FC;&#x4EBA;&#x6740;&#x5F53;&#x6210;&#x4E86;&#x8FD9;&#x51E0;&#x5929;&#x7684;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x51C6;&#x5907;&#x51FA;&#x56FD;&#x7684;&#x5355;&#x8BCD;&#x4E0D;&#x80CC;&#x4E86;&#xFF0C;&#x4EE3;&#x7801;&#x4E0D;&#x6572;&#x4E86;&#xFF0C;&#x4E66;&#x4E0D;&#x770B;&#x4E86;&#xFF0C;&#x751A;&#x81F3;&#x66FE;&#x901A;&#x5BB5;&#x770B;lying man&#xFF0C;&#x5C31;&#x4E3A;&#x4E86;&#x5B66;&#x4E60;&#x53D1;&#x8A00;&#x7684;&#x903B;&#x8F91;&#x4EE5;&#x53CA;&#x5224;&#x65AD;&#x522B;&#x4EBA;&#x7684;&#x903B;&#x8F91;&#xFF0C;&#x4E0D;&#x65AD;&#x7684;&#x53BB;&#x641C;&#x7D22;&#x53BB;&#x5B66;&#x4E60;&#x3002;&#x7136;&#x800C;&#x81EA;&#x4ECE;&#x6211;&#x52A0;&#x5165;&#x4E86;&#x90A3;&#x4E2A;&#x72FC;&#x4EBA;&#x6740;&#x7FA4;&#x540E;&#xFF0C;&#x4ED6;&#x4EEC;&#x8C8C;&#x4F3C;&#x5C31;&#x7279;&#x610F;&#x5730;&#x627E;&#x5404;&#x79CD;&#x539F;&#x56E0;&#x4E0D;&#x53BB;&#x73A9;&#x4E86;&#xFF0C;&#x4E5F;&#x8BB8;&#x4ED6;&#x4EEC;&#x65B0;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x8BA8;&#x8BBA;&#x7EC4;&#x5427;&#x3002;</p>
<p>&#x4ECE;&#x90A3;&#x65F6;&#x8D77;&#xFF0C;&#x6211;&#x5C31;&#x5F00;&#x59CB;&#x8D28;&#x7591;&#x81EA;&#x5DF1;&#xFF0C;&#x6211;&#x771F;&#x7684;&#x90A3;&#x4E48;&#x4EE4;&#x4EBA;&#x8BA8;&#x538C;&#x5417;&#xFF1F;&#x6211;&#x79C1;&#x5E95;&#x4E0B;&#x53BB;&#x95EE;&#x6211;&#x5BA4;&#x53CB;&#xFF0C;&#x95EE;&#x6211;&#x7684;&#x670B;&#x53CB;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x5F97;&#x51FA;&#x6211;&#x5F88;&#x4EE4;&#x4EBA;&#x8BA8;&#x538C;&#xFF0C;&#x6211;&#x5F00;&#x59CB;&#x8D28;&#x7591;&#x81EA;&#x5DF1;&#x5B58;&#x5728;&#x7684;&#x610F;&#x4E49;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x8FD9;&#x6837;&#x3002;</p>
<p>&#x76F4;&#x5230;&#x524D;&#x665A;&#xFF0C;&#x5979;&#x5728;&#x73ED;&#x7EA7;&#x7684;&#x5FAE;&#x4FE1;&#x7FA4;&#x91CC;&#x95EE;&#x6821;&#x533B;&#x9662;&#x51E0;&#x70B9;&#x5F00;&#x95E8;&#x3002;&#x6211;&#x5C31;&#x79C1;&#x4FE1;&#x95EE;&#x5979;&#xFF0C;&#x751F;&#x75C5;&#x4E86;&#xFF1F;&#x56DE;&#xFF0C;&#x6709;&#x4E9B;&#x5C0F;&#x611F;&#x5192;&#x3002;&#x7136;&#x540E;&#x6211;&#x7ACB;&#x9A6C;&#x62AB;&#x4E0A;&#x5916;&#x5957;&#x5957;&#x4E86;&#x6761;&#x88E4;&#x5B50;&#x62FF;&#x8D77;&#x6211;&#x5988;&#x4ECE;&#x65E5;&#x672C;&#x5E26;&#x56DE;&#x6765;&#x7684;&#x611F;&#x5192;&#x836F;&#x76F4;&#x63A5;&#x8DD1;&#x5230;&#x4E86;&#x5979;&#x5BBF;&#x820D;&#x697C;&#x4E0B;&#xFF0C;&#x544A;&#x8BC9;&#x5979;&#x4E0B;&#x697C;&#x53D6;&#x836F;&#xFF0C;&#x5979;&#x8BF4;&#x5979;&#x90FD;&#x8EBA;&#x5728;&#x5E8A;&#x4E0A;&#x4E86;&#x4E0D;&#x60F3;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x7ACB;&#x5373;&#x95EE;&#x5BA4;&#x53CB;&#x5462;&#xFF1F;&#x5979;&#x8BF4;&#x90FD;&#x6362;&#x4E0A;&#x7761;&#x8863;&#x4E86;&#xFF0C;&#x4E5F;&#x4E0D;&#x65B9;&#x4FBF;&#x51FA;&#x53BB;&#xFF0C;&#x6211;&#x53EA;&#x597D;&#x628A;&#x836F;&#x653E;&#x5230;&#x4E86;&#x5979;&#x4EEC;&#x7684;&#x5BBF;&#x820D;&#x697C;&#x697C;&#x7BA1;&#x90A3;&#x91CC;&#x5E76;&#x544A;&#x8BC9;&#x5979;&#x836F;&#x653E;&#x5230;&#x697C;&#x7BA1;&#x90A3;&#x91CC;&#x4E86;&#xFF0C;&#x5979;&#x56DE;&#x4E86;&#x53E5;&#x8C22;&#x8C22;&#x5C31;&#x6CA1;&#x6709;&#x7136;&#x540E;&#x4E86;&#x3002;&#x4E4B;&#x540E;&#x6211;&#x8DD1;&#x5230;&#x64CD;&#x573A;&#x4E0A;&#xFF0C;&#x8FB9;&#x8DD1;&#x8FB9;&#x54ED;&#xFF0C;&#x5F53;&#x65F6;&#x4E5F;&#x5C06;&#x8FD1;&#x5341;&#x70B9;&#x4E86;&#xFF0C;&#x64CD;&#x573A;&#x4E0A;&#x4E5F;&#x6CA1;&#x6709;&#x4EBA;&#xFF0C;&#x4E5F;&#x6CA1;&#x4EBA;&#x770B;&#x5230;&#x6211;&#x7684;&#x7A98;&#x8FEB;&#x6A21;&#x6837;&#xFF0C;&#x8DD1;&#x4E86;&#x597D;&#x4E45;&#x6574;&#x7406;&#x4E86;&#x4E0B;&#x5FC3;&#x60C5;&#x624D;&#x56DE;&#x5230;&#x5BDD;&#x5BA4;&#x3002;</p>
<p>&#x5F53;&#x665A;&#x6211;&#x771F;&#x7684;&#x8D28;&#x7591;&#xFF0C;&#x6211;&#x771F;&#x7684;&#x8FD9;&#x4E48;&#x4EE4;&#x4EBA;&#x70E6;&#x5417;&#xFF1F;&#x665A;&#x4E0A;&#x8EBA;&#x5012;&#x5E8A;&#x4E0A;&#xFF0C;&#x5F00;&#x59CB;&#x53CD;&#x590D;&#x601D;&#x8003;&#x3002;&#x6628;&#x5929;&#x751A;&#x81F3;&#x601D;&#x8003;&#x4E86;&#x4E00;&#x5929;&#x3002;</p>
<p>&#x6700;&#x540E;&#x5F97;&#x51FA;&#x4E86;&#x8FD9;&#x6837;&#x7684;&#x7ED3;&#x8BBA;&#xFF1A;&#x4F60;&#x503C;&#x5F97;&#x8FD9;&#x6837;&#x5417;&#xFF1F;</p>
<p>&#x90A3;&#x4E2A;&#x5B66;&#x957F;&#x4ED6;&#x8BF4;&#x7684;&#x5F88;&#x5BF9;</p>
<p>&#x201C;&#x6211;&#x5E76;&#x4E0D;&#x662F;&#x771F;&#x7684;&#x9965;&#x6E34;&#x96BE;&#x8010;&#x6025;&#x4E8E;&#x4F53;&#x9A8C;&#x8131;&#x5355;&#x4E4B;&#x4E50;&#x7684;&#x9700;&#x6C42;&#x800C;&#x4E14;&#x4F60;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x8010;&#x5FC3;&#xFF0C;&#x4EE5;&#x53CA;&#x56FA;&#x6709;&#x7684;&#x50B2;&#x5A07;&#xFF0C;&#x4E0D;&#x5141;&#x8BB8;&#x81EA;&#x5DF1;&#x6D6A;&#x8D39;&#x7CBE;&#x529B;&#x3002;</p>
<p>&#x5927;&#x5B66;&#x7684;&#x51E0;&#x5E74;&#x65F6;&#x5149;&#x53EF;&#x80FD;&#x662F;&#x4F60;&#x4EBA;&#x751F;&#x4E2D;&#x53D8;&#x5316;&#x4E0E;&#x6210;&#x957F;&#x6700;&#x5927;&#x7684;&#x65F6;&#x95F4;&#x4E4B;&#x4E00;&#x3002;&#x5982;&#x679C;&#x5B9E;&#x5728;&#x65E0;&#x6CD5;&#x627E;&#x5230;&#x5408;&#x9002;&#x7684;&#x4EBA;&#xFF0C;&#x5C31;&#x5E94;&#x8BE5;&#x6536;&#x6536;&#x5FC3;&#x4E13;&#x6CE8;&#x4E8E;&#x63D0;&#x9AD8;&#x81EA;&#x5DF1;&#x3002;&#x5F53;&#x4F60;&#x7684;&#x5B9E;&#x529B;&#x4E0E;&#x773C;&#x754C;&#x8FBE;&#x5230;&#x4E00;&#x5B9A;&#x6C34;&#x51C6;&#x65F6;&#xFF0C;&#x4F60;&#x5C31;&#x62E5;&#x6709;&#x4E86;&#x6539;&#x53D8;&#x81EA;&#x5DF1;&#x73AF;&#x5883;&#xFF0C;&#x81F3;&#x5C11;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x9009;&#x62E9;&#x6240;&#x5904;&#x73AF;&#x5883;&#x7684;&#x80FD;&#x529B;&#x548C;&#x8D44;&#x672C;&#x3002;</p>
<p>&#x5927;&#x5B66;&#x7684;&#x604B;&#x7231;&#x548C;&#x6B65;&#x5165;&#x793E;&#x4F1A;&#x4EE5;&#x540E;&#x7684;&#x7231;&#x60C5;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x3002;</p>
<p>&#x5728;&#x5927;&#x5B66;&#x91CC;&#xFF0C;&#x8FD8;&#x4F1A;&#x6709;&#x6781;&#x5C11;&#x6570;&#x4EBA;&#x65E0;&#x89C6;&#x53CC;&#x65B9;&#x7684;&#x5BB6;&#x5883;&#xFF0C;&#x5FD8;&#x8BB0;&#x53CC;&#x65B9;&#x672A;&#x6765;&#x7684;&#x53D1;&#x5C55;&#x6709;&#x65E0;&#x4EA4;&#x96C6;&#xFF0C;&#x5355;&#x7EAF;&#x5730;&#x4EE5;&#x4E3A;&#x9760;&#x7740;&#x4E24;&#x9897;&#x5FC3;&#x5C31;&#x53EF;&#x4EE5;&#x5929;&#x957F;&#x5730;&#x4E45;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x8FD9;&#x7B80;&#x76F4;&#x662F;&#x4E2D;&#x5B66;&#x751F;&#x4E00;&#x6837;&#x7684;&#x5E7C;&#x7A1A;&#x3002;&#x771F;&#x6B63;&#x6709;&#x7ADE;&#x4E89;&#x529B;&#x7684;&#x7537;&#x751F;&#xFF0C;&#x4E0D;&#x662F;&#x9760;&#x7740;&#x6781;&#x81F4;&#x7684;&#x8010;&#x5FC3;&#x54C4;&#x59B9;&#x7EB8;&#xFF0C;&#x8D39;&#x5C3D;&#x5FC3;&#x673A;&#x53BB;&#x8BA8;&#x597D;&#x5973;&#x795E;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#x5341;&#x6709;&#x516B;&#x4E5D;&#x90FD;&#x662F;&#x597D;&#x4EBA;&#x5361;&#x6536;&#x96C6;&#x8005;&#x3002;</p>
<p>&#x4F18;&#x79C0;&#x7684;&#x7537;&#x751F;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x8981;&#x6709;&#x4E0A;&#x8FDB;&#x5FC3;&#x3001;&#x6709;&#x6027;&#x683C;&#x3001;&#x6709;&#x80FD;&#x529B;&#x7684;&#x4EBA;&#x3002;&#x4F60;&#x8981;&#x6709;&#x80FD;&#x529B;&#x4E3A;&#x4F60;&#x5FC3;&#x7231;&#x7684;&#x5973;&#x751F;&#x521B;&#x9020;&#x5979;&#x60F3;&#x8981;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x4F60;&#x8981;&#x80FD;&#x7ED9;&#x5979;&#x63D0;&#x4F9B;&#x5B89;&#x5168;&#x611F;&#xFF0C;&#x8BA9;&#x5979;&#x4E0D;&#x9700;&#x8981;&#x4E3A;&#x623F;&#x4E3A;&#x5DE5;&#x4F5C;&#x4E3A;&#x751F;&#x6D3B;&#x7684;&#x79CD;&#x79CD;&#x7410;&#x4E8B;&#x7126;&#x8651;&#x3002;&#x4F60;&#x8981;&#x8BA9;&#x5979;&#x5BF9;&#x672A;&#x6765;&#x5145;&#x6EE1;&#x5E0C;&#x671B;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x627F;&#x8BFA;&#xFF0C;&#x6BD4;&#x8D77;&#x82CD;&#x767D;&#x7684;&#x90A3;&#x79CD;&#x5929;&#x8352;&#x5730;&#x8001;&#xFF0C;&#x8981;&#x6709;&#x529B;&#x7684;&#x591A;&#x3002;</p>
<p>&#x5E74;&#x8F7B;&#x65F6;&#x4E0D;&#x8981;&#x592A;&#x77ED;&#x89C6;&#xFF0C;&#x73B0;&#x5728;&#x7684;&#x65F6;&#x95F4;&#x6EE1;&#x6EE1;&#x7684;&#x90FD;&#x662F;&#x9EC4;&#x91D1;&#x3002;&#x628A;&#x7CBE;&#x529B;&#x653E;&#x5728;&#x4F60;&#x5341;&#x5E74;&#x540E;&#x4E5F;&#x4E0D;&#x4F1A;&#x540E;&#x6094;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x4E0A;&#x3002;&#x800C;&#x4E0D;&#x662F;&#x591A;&#x5E74;&#x540E;&#xFF0C;&#x60F3;&#x8D77;&#x5F53;&#x521D;&#x4E3A;&#x522B;&#x4EBA;&#x517B;&#x4E86;&#x597D;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x8001;&#x5A46;&#x800C;&#x89C9;&#x5F97;2333</p>
<p>&#x53EA;&#x4E0D;&#x8FC7;&#xFF0C;&#x5728;&#x6781;&#x5C11;&#x6570;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F53;&#x4F60;&#x5728;&#x6EE1;&#x6708;&#x7684;&#x591C;&#x665A;&#x4EF0;&#x671B;&#x661F;&#x7A7A;&#x65F6;&#xFF0C;&#x5F53;&#x4F60;&#x5728;&#x6D77;&#x68E0;&#x76DB;&#x5F00;&#x7684;&#x6625;&#x5929;&#x53EA;&#x80FD;&#x5F3A;&#x884C;&#x62C9;&#x820D;&#x53CB;&#x53BB;&#x8D4F;&#x82B1;&#x65F6;&#xFF0C;&#x5F53;&#x4F60;&#x53D1;&#x73B0;&#x7F8E;&#x98DF;&#x5374;&#x65E0;&#x4EBA;&#x5206;&#x4EAB;&#x65F6;&#xFF0C;&#x4F60;&#x8FD8;&#x662F;&#x4F1A;&#x611F;&#x5230;&#x5185;&#x5FC3;&#x7684;&#x7A7A;&#x8361;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x591A;&#x6570;&#x65F6;&#x95F4;&#x5446;&#x5728;&#x5B66;&#x6821;&#x91CC;&#x65F6;&#xFF0C;&#x6211;&#x538B;&#x6839;&#x4E0D;&#x4F1A;&#x5BF9;&#x5B66;&#x6821;&#x91CC;&#x591A;&#x6570;&#x5973;&#x751F;&#x6709;&#x54EA;&#x6015;&#x4E00;&#x4E1D;&#x60F3;&#x6CD5;&#x3002;&#x4F60;&#x4EEC;&#x914D;&#x4E0D;&#x4E0A;&#x5C31;&#x662F;&#x914D;&#x4E0D;&#x4E0A;&#x3002;&#x201D;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x4E0D;&#x8BF4;&#x81EA;&#x5DF1;&#x662F;&#x4EC0;&#x4E48;&#x9876;&#x5C16;&#x806A;&#x660E;&#x6216;&#x8005;&#x591A;&#x5E74;&#x6280;&#x672F;&#x5927;&#x795E;&#xFF0C;&#x6211;&#x521A;&#x5165;&#x5927;&#x5B66;&#x65F6;&#x548C;&#x8EAB;&#x8FB9;&#x591A;&#x6570;&#x4EBA;&#x4E00;&#x6837;&#x5BF9;&#x7F16;&#x7A0B;&#x4E00;&#x7A8D;&#x4E0D;&#x901A;&#x3002;&#x6211;&#x73B0;&#x5728;&#x5927;&#x4E8C;&#x5728;&#x8BFB;&#xFF0C;&#x6BD4;&#x8EAB;&#x8FB9;&#x4E5D;&#x6210;&#x4EE5;&#x4E0A;&#x4EBA;&#x505A;&#x5F97;&#x66F4;&#x597D;&#xFF0C;&#x5916;&#x5305;&#x3001;&#x6BD4;&#x8D5B;&#x3001;&#x9879;&#x76EE;&#x90FD;&#x505A;&#x8FC7;&#xFF0C;&#x4E5F;&#x6709;&#x8D85;&#x51FA;&#x5B66;&#x9662;&#x7684;&#x540D;&#x58F0;&#x3002;</p>
<p>&#x4ECA;&#x665A;&#x53BB;&#x9012;&#x4EA4;&#x5B66;&#x9662;&#x7684;&#x67D0;&#x4E2A;&#x6BD4;&#x8D5B;&#x8BB0;&#x5F55;&#x65F6;&#xFF0C;&#x770B;&#x5230;&#x5929;&#x4E0A;&#x7684;&#x6708;&#x4EAE;&#x5F7B;&#x5E95;&#x60F3;&#x5F00;&#x4E86;&#xFF0C;&#x6709;&#x4E9B;&#x4E8B;&#x4E0D;&#x53EF;&#x80FD;&#x6309;&#x7167;&#x4F60;&#x6240;&#x60F3;&#x7684;&#x5267;&#x672C;&#x6765;&#x53D1;&#x5C55;&#x7684;&#x3002;&#x4F60;&#x4F55;&#x5FC5;&#x4E3A;&#x4E00;&#x6BB5;&#x4E0D;&#x53EF;&#x80FD;&#x5B9E;&#x73B0;&#x7684;&#x7231;&#x60C5;&#x5982;&#x6B64;&#x5351;&#x5FAE;&#x7740;&#x6D3B;&#x7740;&#x3002;</p>
<p>&#x600E;&#x4E48;&#x8BF4;&#x5462;&#xFF0C;&#x6211;&#x7684;&#x50B2;&#x6C14;&#x77AC;&#x95F4;&#x5C06;&#x6211;&#x5BF9;&#x90A3;&#x4E2A;&#x5973;&#x751F;&#x7684;&#x559C;&#x6B22;&#x51B2;&#x6DE1;&#x4E86;&#x4E0D;&#x5C11;&#xFF0C;&#x6211;&#x4E0D;&#x7B97;&#x591A;&#x4E48;&#x591A;&#x4E48;&#x4F18;&#x79C0;&#xFF0C;&#x4F46;&#x662F;&#x8FD8;&#x6709;&#x6709;&#x5F88;&#x591A;&#x8D85;&#x51FA;&#x5E38;&#x4EBA;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5982;&#x679C;&#x771F;&#x7684;&#x4E0D;&#x5408;&#x9002;&#xFF0C;&#x5C31;&#x4E0D;&#x8981;&#x59D4;&#x5C48;&#x81EA;&#x5DF1;&#xFF0C;&#x771F;&#x4EBA;&#x79C0;&#x548C;&#x80A5;&#x7682;&#x5267;&#x672C;&#x6765;&#x5C31;&#x4E0D;&#x662F;&#x6211;&#x751F;&#x6D3B;&#x91CC;&#x7684;&#x5FC5;&#x9700;&#x54C1;&#xFF0C;&#x4E0D;&#x80FD;&#x56E0;&#x4E3A;&#x77ED;&#x671F;&#x7684;&#x5355;&#x8EAB;&#x727A;&#x7272;&#x81EA;&#x5DF1;&#x8FDB;&#x6B65;&#x7684;&#x65F6;&#x95F4;&#x53BB;&#x6D6A;&#x8D39;&#x5728;&#x4E00;&#x4E9B;&#x751F;&#x6D3B;&#x8DA3;&#x5473;&#x4E0D;&#x5728;&#x540C;&#x4E00;&#x5C42;&#x6B21;&#x7684;&#x4EBA;&#x8EAB;&#x4E0A;&#xFF0C;&#x65E9;&#x665A;&#x4F1A;&#x9047;&#x5230;&#x6709;&#x8DA3;&#x7684;&#x4EBA;&#x3002;</p>
<p>&#x4ECE;&#x524D;&#x6709;&#x4E2A;&#x4EBA;&#x5F88;&#x7231;&#x4F60;&#xFF0C;&#x4F46;&#x98CE;&#x504F;&#x504F;&#x628A;&#x8DDD;&#x79BB;&#x5439;&#x5F97;&#x597D;&#x8FDC;&#x3002;&#x4EBA;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x7231;&#xFF0C;&#x4EBA;&#x4EEC;&#x9700;&#x8981;&#x7684;&#x662F;&#x67D0;&#x79CD;&#x5F62;&#x5F0F;&#x7684;&#x6210;&#x529F;&#x3002;&#x53EF;&#x4EE5;&#x662F;&#x7231;&#xFF0C;&#x4F46;&#x4E0D;&#x662F;&#x5FC5;&#x987B;&#x7684;&#x3002;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x5FC3;&#x91CC;&#x90FD;&#x6709;&#x4E00;&#x56E2;&#x706B;&#xFF0C;&#x53EA;&#x6709;&#x61C2;&#x5F97;&#x4EBA;&#x624D;&#x80FD;&#x770B;&#x89C1;&#x5F7C;&#x6B64;&#x5FC3;&#x4E2D;&#x7684;&#x706B;&#xFF0C;&#x76F8;&#x4E92;&#x53D6;&#x6696;&#x3002;&#x800C;&#x90A3;&#x4E9B;&#x5728;&#x4F60;&#x8EAB;&#x4E0A;&#x53EA;&#x80FD;&#x770B;&#x5230;&#x70DF;&#x7684;&#x4EBA;&#xFF0C;&#x5E76;&#x4E0D;&#x61C2;&#x4F60;&#x3002;&#x4F60;&#x7167;&#x4EAE;&#x4E0D;&#x4E86;&#x5979;&#xFF0C;&#x5979;&#x4E5F;&#x6E29;&#x6696;&#x4E0D;&#x4E86;&#x4F60;&#x3002;&#x6216;&#x8BB8;&#x5979;&#x80FD;&#x770B;&#x5230;&#x522B;&#x4EBA;&#x5FC3;&#x4E2D;&#x7684;&#x706B;&#xFF0C;&#x4F46;&#x5979;&#x5BF9;&#x4F60;&#x800C;&#x8A00;&#xFF0C;&#x53EA;&#x662F;&#x8DEF;&#x4EBA;&#x3002;</p>
<p>&#x6211;&#x60F3;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x5F88;&#x5389;&#x5BB3;&#x7684;&#x4EBA;&#xFF0C;&#x8BA9;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x4E86;&#x6211;&#xFF0C;&#x800C;&#x6709;&#x4E9B;&#x5C0F;&#x5C0F;&#x7684;&#x4E0D;&#x4E00;&#x6837;&#x3002;&#x800C;&#x6211;&#x7684;&#x4E16;&#x754C;&#xFF0C;&#x4ECE;&#x524D;&#x662F;&#x4F60;&#xFF0C;&#x73B0;&#x5728;&#x53EA;&#x6709;&#x6211;&#x3002;&#x4EBA;&#x751F;&#x672C;&#x6765;&#x5C31;&#x4E92;&#x4E0D;&#x76F8;&#x6B20;&#xFF0C;&#x522B;&#x4EBA;&#x5BF9;&#x4F60;&#x4ED8;&#x51FA;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x522B;&#x4EBA;&#x559C;&#x6B22;&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x6709;&#x7ED3;&#x679C;&#x7684;&#x4ED8;&#x51FA;&#x624D;&#x662F;&#x4ED8;&#x51FA;&#xFF0C;&#x6CA1;&#x6709;&#x7ED3;&#x679C;&#x7684;&#x4ED8;&#x51FA;&#x53EB;&#x4EE3;&#x4EF7;&#x3002;&#x4EBA;&#x4E0E;&#x4EBA;&#x4E4B;&#x95F4;&#x76F8;&#x5904;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x4EB2;&#x60C5;&#x53CB;&#x60C5;&#x7231;&#x60C5;&#xFF0C;&#x90FD;&#x7EDD;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x5B64;&#x72EC;&#x5FCD;&#x53D7;&#x548C;&#x9ED8;&#x9ED8;&#x627F;&#x53D7;</p>
<p>&#x843D;&#x5728;&#x4E00;&#x4E2A;&#x4EBA;&#x4E00;&#x751F;&#x4E2D;&#x7684;&#x96EA;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x5168;&#x90E8;&#x770B;&#x89C1;&#x3002;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x751F;&#x547D;&#x4E2D;&#xFF0C;&#x5B64;&#x72EC;&#x7684;&#x8FC7;&#x51AC;&#xFF0C;&#x552F;&#x4E00;&#x80FD;&#x505A;&#x7684;&#xFF0C;&#x5C31;&#x662F;&#x611F;&#x8C22;&#x4F60;&#x5E26;&#x7ED9;&#x6211;&#x7684;&#x8BB0;&#x5FC6;&#x3002;&#x4E5F;&#x8BB8;&#x5F53;&#x4F60;&#x770B;&#x89C1;&#x4E86;&#x8FD9;&#x6837;&#x98CE;&#x8F7B;&#x4E91;&#x6DE1;&#x7684;&#x6211;&#xFF0C;&#x6211;&#x66FE;&#x7ECF;&#x75F4;&#x8FF7;&#x8FC7;&#x4F60;&#xFF0C;&#x4F46;&#x73B0;&#x5728;&#x6211;&#x7EDD;&#x5BF9;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x7231;&#x4F60;&#x3002;&#x4E5F;&#x8BB8;&#x4F60;&#x4F1A;&#x5728;&#x4EE5;&#x540E;&#x7684;&#x51E0;&#x5E74;&#x91CC;&#x627E;&#x5230;&#x771F;&#x7684;&#x5408;&#x9002;&#x7684;&#x4EBA;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x771F;&#x5FC3;&#x795D;&#x798F;&#x4F60;&#x3002;</p>

      
    </div><!-- .entry-content -->

    <footer class="entry-meta">
    <a href="/2016/11/15/当进程变为线程/">
    <time datetime="2016-11-14T18:05:20.000Z" class="entry-date">
        2016-11-15
    </time>
</a>
    
  <span class="article-delim">&#8226;</span>
  <div class="article-category">
  <a class="article-category-link" href="/categories/LIFE/">LIFE</a>
  </div>

    
    </footer>
</article>


    
<nav class="nav-single">
    <h3 class="assistive-text">文章导航</h3>
    
        <span class="nav-previous"><a href="/2016/11/15/从零开始学习Linux-9/" rel="prev"><span class="meta-nav">←</span> 从零开始学习Linux-9</a></span>
    
    
        <span class="nav-next"><a href="/2016/11/14/从零开始学习Linux-8/" rel="next">从零开始学习Linux-8 <span class="meta-nav">→</span></a></span>
    
</nav><!-- .nav-single -->







</div></div>
        <div id="secondary" class="widget-area" role="complementary">
  
    <aside id="search" class="widget widget_search"><form role="search" method="get" accept-charset="utf-8" id="searchform" class="searchform" action="//google.com/search">
    <div>
        <input type="text" value="" name="s" id="s" />
        <input type="submit" id="searchsubmit" value="搜索" />
    </div>
</form></aside>
  
    
  
    
  <aside class="widget">
    <h3 class="widget-title">Categories</h3>
    <div class="widget-content">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/LIFE/">LIFE</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/MAC/">MAC</a><span class="category-list-count">3</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/ML/">ML</a><span class="category-list-count">26</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/PGM/">PGM</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/iOS/">iOS</a><span class="category-list-count">22</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/御宅文化/">御宅文化</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/算法/">算法</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/编程/">编程</a><span class="category-list-count">58</span></li></ul>
    </div>
  </aside>

  
    
<div class="widget tag">
<h3 class="title">blogroll</h3>
<ul class="entry">


<li><a href="https://github.com/" target="_blank">我的github</a></li>


<li><a href="http://www.jianshu.com/users/41cd7711ed44/latest_articles" target="_blank">我的简书主页</a></li>


<li><a href="http://uuzdaisuki.com" target="_blank">leticia’s blog</a></li>


<li><a href="http://www.helloyzy.cn" target="_blank">acery</a></li>


<li><a href="http://wxjackie.com" target="_blank">WXJACKIE</a></li>


<li><a href="http://www.stephenzhang.me" target="_blank">stephenzhang</a></li>


<li><a href="blog.keybrl.com" target="_blank">keybrl</a></li>


<li><a href="http://blog.ciaran.cn" target="_blank">Ciaran</a></li>


<li><a href="http://1.dev.blog.qinka.pro" target="_blank">Qinka</a></li>


<li><a href="http://tobiasLee.top" target="_blank">TobiasLee</a></li>


<li><a href="http://blog.boileryao.com" target="_blank">bingo</a></li>

</ul>
</div>

  
    
  <aside class="widget">
    <h3 class="widget-title">Recents</h3>
    <div class="widget-content">
      <ul>
        
          <li>
            <a href="/2017/12/17/FastRCNN-FasterRCNN/">谈一谈 Fast R-CNN 和 Faster R-CNN</a>
          </li>
        
          <li>
            <a href="/2017/11/17/如何在Xcode中添加-bits-stdc-h-头文件/">如何在Xcode中添加&lt;bits/stdc++.h&gt;头文件</a>
          </li>
        
          <li>
            <a href="/2017/11/02/LSTM/">RNN 与 LSTM</a>
          </li>
        
          <li>
            <a href="/2017/11/01/循环神经网络-RNN/">循环神经网络_RNN</a>
          </li>
        
          <li>
            <a href="/2017/10/31/CNN之定位检测/">卷积神经网络之定位检测</a>
          </li>
        
      </ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Tags</h3>
    <div class="widget-content">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/Cloud-Computing/">Cloud Computing</a><span class="tag-list-count">3</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Cocoapods/">Cocoapods</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/HTML/">HTML</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Linux/">Linux</a><span class="tag-list-count">15</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Machine-Learning/">Machine Learning</a><span class="tag-list-count">17</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Matlab/">Matlab</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Neural-Networks/">Neural Networks</a><span class="tag-list-count">6</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Probabilistic-Graphical-Models/">Probabilistic Graphical Models</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIColor/">UIColor</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView/">UIView</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView-圆角/">UIView-圆角</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Vim/">Vim</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/bug/">bug</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/hexo/">hexo</a><span class="tag-list-count">4</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/openCV/">openCV</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/二维码/">二维码</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/指针/">指针</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/操作系统/">操作系统</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/数据库/">数据库</a><span class="tag-list-count">3</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/数据结构/">数据结构</a><span class="tag-list-count">20</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/算法/">算法</a><span class="tag-list-count">9</span></li></ul>
    </div>
  </aside>

  
</div>
      </div>
      <footer id="colophon" role="contentinfo">
    <p>&copy; 2017 SaberDa
    All rights reserved.</p>
    <p>Powered by <a href="http://hexo.io/" target="_blank">Hexo</a></p>
</footer>
    <script>window._bd_share_config={"common":{"bdSnsKey":{},"bdText":"","bdMini":"1","bdMiniList":false,"bdPic":"","bdStyle":"2","bdSize":"16"},"share":{}};with(document)0[(getElementsByTagName('head')[0]||body).appendChild(createElement('script')).src='http://bdimg.share.baidu.com/static/api/js/share.js?v=89860593.js?cdnversion='+~(-new Date()/36e5)];</script>

<script src="/js/jquery-2.0.3.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

<script src="/js/navigation.js"></script>

<div id="bg"></div>

  </div>
</body>
</html>