<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  
  <meta name="description" content="阿尔托利亚是我老婆~" />
  

  
  
  
  
  
  
  <title>详细谈谈二维码生成原理与编码（一） | SaberDa的幻想乡</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x672C;&amp;#x60F3;&amp;#x4E00;&amp;#x7BC7;&amp;#x6587;&amp;#x7AE0;&amp;#x5C31;&amp;#x89E3;&amp;#x51B3;&amp;#x7684;&amp;#xFF0C;&amp;#x540E;&amp;#x6765;&amp;#x53D1;&amp;#x73B0;&amp;#x9700;&amp;#x8981;&amp;#x4ECB;&amp;#x7ECD;&amp;#x7684;&amp;#x6709;&amp;#x70B9;&amp;#x591A;&amp;#xFF0C;&amp;#x4E00;">
<meta property="og:type" content="article">
<meta property="og:title" content="详细谈谈二维码生成原理与编码（一）">
<meta property="og:url" content="https://saberda.github.io/2017/05/15/二维码/index.html">
<meta property="og:site_name" content="SaberDa的幻想乡">
<meta property="og:description" content="&amp;#x672C;&amp;#x60F3;&amp;#x4E00;&amp;#x7BC7;&amp;#x6587;&amp;#x7AE0;&amp;#x5C31;&amp;#x89E3;&amp;#x51B3;&amp;#x7684;&amp;#xFF0C;&amp;#x540E;&amp;#x6765;&amp;#x53D1;&amp;#x73B0;&amp;#x9700;&amp;#x8981;&amp;#x4ECB;&amp;#x7ECD;&amp;#x7684;&amp;#x6709;&amp;#x70B9;&amp;#x591A;&amp;#xFF0C;&amp;#x4E00;">
<meta property="og:image" content="https://saberda.github.io/2017/05/15/二维码/图一.png">
<meta property="og:image" content="https://saberda.github.io/2017/05/15/二维码/图二.png">
<meta property="og:image" content="https://saberda.github.io/2017/05/15/二维码/图三.png">
<meta property="og:image" content="https://saberda.github.io/2017/05/15/二维码/二维码进行图像处理.png">
<meta property="og:image" content="https://saberda.github.io/2017/05/15/二维码/数字图像的采集过程.png">
<meta property="og:image" content="https://saberda.github.io/2017/05/15/二维码/预处理.png">
<meta property="og:image" content="https://saberda.github.io/2017/05/15/二维码/公式一.png">
<meta property="og:image" content="https://saberda.github.io/2017/05/15/二维码/公式二.png">
<meta property="og:image" content="https://saberda.github.io/2017/05/15/二维码/公式三.png">
<meta property="og:image" content="https://saberda.github.io/2017/05/15/二维码/效果图.png">
<meta property="og:updated_time" content="2017-05-15T16:00:05.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="详细谈谈二维码生成原理与编码（一）">
<meta name="twitter:description" content="&amp;#x672C;&amp;#x60F3;&amp;#x4E00;&amp;#x7BC7;&amp;#x6587;&amp;#x7AE0;&amp;#x5C31;&amp;#x89E3;&amp;#x51B3;&amp;#x7684;&amp;#xFF0C;&amp;#x540E;&amp;#x6765;&amp;#x53D1;&amp;#x73B0;&amp;#x9700;&amp;#x8981;&amp;#x4ECB;&amp;#x7ECD;&amp;#x7684;&amp;#x6709;&amp;#x70B9;&amp;#x591A;&amp;#xFF0C;&amp;#x4E00;">
<meta name="twitter:image" content="https://saberda.github.io/2017/05/15/二维码/图一.png">
  
  
    <link rel="icon" href="/css/images/favicon.ico">
  
  <link rel="stylesheet" href="/css/style.css">
  

  
  <!-- baidu webmaster push -->
  <script src='//push.zhanzhang.baidu.com/push.js'></script>
</head>
<body class="home blog custom-background custom-font-enabled single-author">
  <div id="page" class="hfeed site">
      <header id="masthead" class="site-header" role="banner">
    <hgroup>
      <h1 class="site-title">
        <a href="/" title="SaberDa的幻想乡" rel="home">SaberDa的幻想乡</a>
      </h1>
      
        <h2 class="site-description">
          <a href="/" id="subtitle">　　iOS/ ML　　|　　二次元　　|　　saberda@qq.com　　|　　从花时间省钱到花钱省时间</a>
        </h2>
      
    </hgroup>

    <nav id="site-navigation" class="main-navigation" role="navigation">
            <button class="menu-toggle">菜单</button>
            <a class="assistive-text" href="/#content" title="跳至内容">跳至内容</a><!--TODO-->
            <div class="menu-main-container">
                <ul id="menu-main" class="nav-menu">
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/archives">所有文章</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/">主页</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/编程/">编程</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/iOS/">iOS</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/ML/">ML</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/PGM/">PGM</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/MAC/">MAC</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/御宅文化/">御宅文化</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/LIFE/">LIFE</a></li>
                
                </ul>
            </div>
    </nav>
</header>
      <div id="main" class="wrapper">
        <div id="primary" class="site-content"><div id="content" role="main"><article id="post-二维码" class="post-二维码 post type-post status-publish format-standard hentry">
    <!---->

      <header class="entry-header">
        
        
  
    <h1 class="entry-title article-title">
      详细谈谈二维码生成原理与编码（一）
    </h1>
  

        
        <div class="comments-link">
            
            <a href="javascript:void(0);" data-url="https://saberda.github.io/2017/05/15/二维码/" data-id="cja3xch3z004i19b3l2fmkxpx" class="leave-reply bdsharebuttonbox" data-cmd="more">Share</a>
        </div><!-- .comments-link -->
      </header><!-- .entry-header -->

    <div class="entry-content">
      
        <pre><code>&#x672C;&#x60F3;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x5C31;&#x89E3;&#x51B3;&#x7684;&#xFF0C;&#x540E;&#x6765;&#x53D1;&#x73B0;&#x9700;&#x8981;&#x4ECB;&#x7ECD;&#x7684;&#x6709;&#x70B9;&#x591A;&#xFF0C;&#x4E00;&#x4E2A;&#x665A;&#x4E0A;&#x7EDD;&#x5BF9;&#x5199;&#x4E0D;&#x5B8C;&#xFF0C;&#x770B;&#x6765;&#x53C8;&#x8981;&#x5F00;&#x65B0;&#x5751;&#x4E86;&#x3002;
</code></pre><h2 id="&#x4E00;&#x3001;&#x4EC0;&#x4E48;&#x662F;&#x4E8C;&#x7EF4;&#x7801;&#xFF1F;"><a href="#&#x4E00;&#x3001;&#x4EC0;&#x4E48;&#x662F;&#x4E8C;&#x7EF4;&#x7801;&#xFF1F;" class="headerlink" title="&#x4E00;&#x3001;&#x4EC0;&#x4E48;&#x662F;&#x4E8C;&#x7EF4;&#x7801;&#xFF1F;"></a>&#x4E00;&#x3001;&#x4EC0;&#x4E48;&#x662F;&#x4E8C;&#x7EF4;&#x7801;&#xFF1F;</h2><p>&#x4E8C;&#x7EF4;&#x7801;&#x6709;&#x5F88;&#x591A;&#x79CD;&#xFF0C;&#x5176;&#x4E2D;&#x5360;&#x636E;&#x5927;&#x534A;&#x6C5F;&#x5C71;&#x7684;&#x4E3B;&#x8981;&#x6709;&#x4E24;&#x79CD;&#xFF0C;&#x4E00;&#x662F;&#x4EE5; PDF417 &#x4E3A;&#x4EE3;&#x8868;&#x7684;<a href="https://en.wikipedia.org/wiki/PDF417" target="_blank" rel="external">&#x5806;&#x53E0;&#x5F0F;&#x6761;&#x5F62;&#x4E8C;&#x7EF4;&#x7801;</a>&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x662F;&#x4EE5; QR Code &#x4E3A;&#x4EE3;&#x8868;&#x7684;<a href="https://en.wikipedia.org/wiki/QR_code" target="_blank" rel="external">&#x77E9;&#x9635;&#x5F0F;&#x4E8C;&#x7EF4;&#x7801;</a>&#x3002;</p>
<p>PDF417 &#x662F;&#x201C;&#x4FBF;&#x643A;&#x5F0F;&#x6570;&#x636E;&#x6587;&#x4EF6;&#x201D;&#x7684;&#x7F29;&#x5199;&#x3002;&#x5B83;&#x6700;&#x5C11;&#x5206;&#x4E3A;&#x4E09;&#x5C42;&#xFF0C;&#x6700;&#x591A; 90 &#x5C42;&#x3002;&#x5305;&#x62EC;&#x5DE6;&#x53F3;&#x7A7A;&#x767D;&#x533A;&#x3001;&#x8D77;&#x59CB;&#x7B26;&#x3001;&#x7EC8;&#x6B62;&#x7B26;&#x3001;&#x5DE6;&#x53F3;&#x5C42;&#x6307;&#x793A;&#x7B26;&#x53F7;&#x5B57;&#x7B26;&#x7B49;&#x3002;&#x5B83;&#x7684;&#x5177;&#x4F53;&#x67B6;&#x6784;&#x5982;&#x4E0B;&#x56FE;&#xFF1A;</p>
<a id="more"></a>
<p><img src="/2017/05/15/&#x4E8C;&#x7EF4;&#x7801;/&#x56FE;&#x4E00;.png" alt=""></p>
<p>QR Code &#x5206;&#x4E3A;&#x7F16;&#x7801;&#x533A;&#x4E0E;&#x529F;&#x80FD;&#x533A;&#x3002;&#x7F16;&#x7801;&#x533A;&#x4E3B;&#x8981;&#x8D1F;&#x8D23;&#x7248;&#x672C;&#x683C;&#x5F0F;&#x3001;&#x6570;&#x636E;&#x548C;&#x7EA0;&#x9519;&#x7F16;&#x7801;&#xFF1B;&#x529F;&#x80FD;&#x533A;&#x4E3B;&#x8981;&#x8D1F;&#x8D23;&#x4F4D;&#x7F6E;&#x63A2;&#x6D4B;&#x56FE;&#x5F62;&#x3001;&#x6821;&#x6B63;&#x56FE;&#x50CF;&#x4EE5;&#x53CA;&#x4F4D;&#x7F6E;&#x63A2;&#x6D4B;&#xFF0C;&#x5176;&#x4E2D;&#x4F4D;&#x7F6E;&#x63A2;&#x6D4B;&#x56FE;&#x5F62;&#x662F;&#x5FEB;&#x901F;&#x8BC6;&#x522B;&#x7684;&#x5173;&#x952E;&#x3002;&#x5B83;&#x7684;&#x5177;&#x4F53;&#x67B6;&#x6784;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="/2017/05/15/&#x4E8C;&#x7EF4;&#x7801;/&#x56FE;&#x4E8C;.png" alt=""></p>
<p>&#x5E76;&#x4E14; QR Code &#x6709;&#x6709;&#x591A;&#x79CD;&#x7248;&#x672C;&#xFF0C;&#x7248;&#x672C;&#x4E0E;&#x7248;&#x672C;&#x95F4;&#x7684;&#x4E3B;&#x8981;&#x5DEE;&#x522B;&#x5728;&#x4E8E;&#x56FE;&#x5F62;&#x7684;&#x5C3A;&#x5BF8;&#xFF0C;&#x5C3A;&#x5BF8;&#x8D8A;&#x5927;&#x6240;&#x80FD;&#x5B58;&#x50A8;&#x7684;&#x4FE1;&#x606F;&#x8D8A;&#x591A;&#x3002;&#x4E8C;&#x7EF4;&#x7801;&#x4E00;&#x5171;&#x6709;40&#x4E2A;&#x5C3A;&#x5BF8;&#x3002;&#x5B98;&#x65B9;&#x53EB;&#x7248;&#x672C;Version&#x3002;Version 1&#x662F;21 x 21&#x7684;&#x77E9;&#x9635;&#xFF0C;Version 2&#x662F; 25 x 25&#x7684;&#x77E9;&#x9635;&#xFF0C;Version 3&#x662F;29&#x7684;&#x5C3A;&#x5BF8;&#xFF0C;&#x6BCF;&#x589E;&#x52A0;&#x4E00;&#x4E2A;version&#xFF0C;&#x5C31;&#x4F1A;&#x589E;&#x52A0;4&#x7684;&#x5C3A;&#x5BF8;&#xFF0C;&#x516C;&#x5F0F;&#x662F;&#xFF1A;(V-1)*4 + 21&#xFF08;V&#x662F;&#x7248;&#x672C;&#x53F7;&#xFF09; &#x6700;&#x9AD8;Version 40&#xFF0C;(40-1)*4+21 = 177&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x9AD8;&#x662F;177 x 177 &#x7684;&#x6B63;&#x65B9;&#x5F62;&#x3002;</p>
<p><img src="/2017/05/15/&#x4E8C;&#x7EF4;&#x7801;/&#x56FE;&#x4E09;.png" alt=""></p>
<p>&#x76EE;&#x524D;&#x56FD;&#x5185;&#x751A;&#x81F3;&#x4E16;&#x754C;&#x8303;&#x56F4;&#x5185;&#x4F7F;&#x7528;&#x6700;&#x4E3A;&#x5E7F;&#x6CDB;&#x7684;&#x5C31;&#x662F; QR Code&#xFF0C;&#x6240;&#x4EE5;&#x672C;&#x7BC7;&#x6587;&#x7AE0;&#x5177;&#x4F53;&#x4ECB;&#x7ECD;&#x8BE5;&#x4E8C;&#x7EF4;&#x7801;&#xFF0C;&#x5E76;&#x4E14;&#x4E0B;&#x9762;&#x7684;&#x6587;&#x7AE0;&#x4E3A;&#x65B9;&#x4FBF;&#x5927;&#x5BB6;&#x7406;&#x89E3;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x4E8C;&#x7EF4;&#x7801;&#x5747;&#x6307; QR Code&#x3002;</p>
<h2 id="&#x4E8C;&#x3001;&#x600E;&#x6837;&#x5904;&#x7406;&#x4E00;&#x4E2A;&#x4E8C;&#x7EF4;&#x7801;&#xFF1F;"><a href="#&#x4E8C;&#x3001;&#x600E;&#x6837;&#x5904;&#x7406;&#x4E00;&#x4E2A;&#x4E8C;&#x7EF4;&#x7801;&#xFF1F;" class="headerlink" title="&#x4E8C;&#x3001;&#x600E;&#x6837;&#x5904;&#x7406;&#x4E00;&#x4E2A;&#x4E8C;&#x7EF4;&#x7801;&#xFF1F;"></a>&#x4E8C;&#x3001;&#x600E;&#x6837;&#x5904;&#x7406;&#x4E00;&#x4E2A;&#x4E8C;&#x7EF4;&#x7801;&#xFF1F;</h2><p>&#x8FD9;&#x4E2A;&#x90E8;&#x5206;&#x6211;&#x5C06;&#x5206;&#x4E3A;&#x4E24;&#x5927;&#x90E8;&#x5206;&#x6765;&#x8FDB;&#x884C;&#x5177;&#x4F53;&#x89E3;&#x91CA;&#x3002;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x56FE;&#x50CF;&#x5904;&#x7406;&#xFF0C;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x662F;&#x5177;&#x4F53;&#x89E3;&#x7801;&#x3002;</p>
<p>&#x56FE;&#x50CF;&#x5904;&#x7406;&#x53C8;&#x53EF;&#x4EE5;&#x7EC6;&#x5206;&#x4E3A;&#x4E09;&#x4E2A;&#x5C42;&#x6B21;&#xFF1A;</p>
<ol>
<li>&#x521D;&#x7EA7;&#x56FE;&#x50CF;&#x5904;&#x7406;&#xFF1A;&#x56FE;&#x50CF;&#x53BB;&#x566A;&#x4E0E;&#x56FE;&#x50CF;&#x9510;&#x5316;</li>
<li>&#x4E2D;&#x7EA7;&#x56FE;&#x50CF;&#x5904;&#x7406;&#xFF1A;&#x56FE;&#x50CF;&#x5206;&#x5272;&#x4E0E;&#x8FB9;&#x7F18;&#x63D0;&#x53D6;</li>
<li>&#x9AD8;&#x7EA7;&#x56FE;&#x50CF;&#x5904;&#x7406;&#xFF1A;&#x8BC6;&#x522B;&#x56FE;&#x50CF;&#x6240;&#x5305;&#x542B;&#x7684;&#x4FE1;&#x606F;</li>
</ol>
<p>&#x89E3;&#x7801;&#x8FC7;&#x7A0B;&#x4E5F;&#x4E3B;&#x8981;&#x7531;&#x4E09;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#xFF0C;&#x8FD9;&#x4E9B;&#x90E8;&#x5206;&#x7684;&#x5177;&#x4F53;&#x64CD;&#x4F5C;&#x4F1A;&#x5728;&#x4E0B;&#x6587;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#xFF1A;</p>
<ol>
<li>&#x4E8C;&#x7EF4;&#x7801;&#x7801;&#x5B57;&#x63D0;&#x53D6;</li>
<li>&#x7EA0;&#x9519;&#x8BD1;&#x7801;</li>
<li>&#x4FE1;&#x606F;&#x8BD1;&#x7801;</li>
</ol>
<p>&#x5176;&#x4E2D;&#x7EA0;&#x9519;&#x8BD1;&#x7801;&#x662F;&#x4E3A;&#x4E86;&#x6C42;&#x89E3;&#x4F34;&#x968F;&#x56E0;&#x5B50;&#xFF0C;&#x5373;&#x5224;&#x65AD;&#x6B63;&#x786E;&#x7801;&#x5B57;&#x7684;&#x4E2A;&#x6570; [&#x6B63;&#x786E;&#x7801;&#x5B57; = Y<sub>ji</sub><sup>&#x9519;&#x8BEF;&#x7801;&#x5B57;</sup>]</p>
<p>&#x4FE1;&#x606F;&#x8BD1;&#x7801; = &#x6A21;&#x5F0F;&#x6307;&#x793A; + &#x5B57;&#x7B26;&#x6BB5; + &#x6570;&#x636E;&#x4F4D;&#x6D41;&#x3002;&#x8BE5;&#x529F;&#x80FD;&#x4E00;&#x662F;&#x4E3A;&#x5224;&#x65AD;&#x7F16;&#x7801;&#x6A21;&#x5F0F;&#x4E0E;&#x5B57;&#x7B26;&#x4E2A;&#x6570;&#xFF0C;&#x4E8C;&#x662F;&#x6309;&#x7167;&#x5BF9;&#x5E94;&#x7684;&#x7F16;&#x7801;&#x8FDB;&#x884C;&#x89E3;&#x7801;</p>
<h2 id="&#x4E09;&#x3001;&#x56FE;&#x50CF;&#x5904;&#x7406;"><a href="#&#x4E09;&#x3001;&#x56FE;&#x50CF;&#x5904;&#x7406;" class="headerlink" title="&#x4E09;&#x3001;&#x56FE;&#x50CF;&#x5904;&#x7406;"></a>&#x4E09;&#x3001;&#x56FE;&#x50CF;&#x5904;&#x7406;</h2><p>&#x5148;&#x653E;&#x4E00;&#x5F20;&#x56FE;&#x6765;&#x5927;&#x81F4;&#x8868;&#x793A;&#x4E00;&#x4E0B;&#x56FE;&#x50CF;&#x5904;&#x7406;&#x7684;&#x4E3B;&#x8981;&#x6B65;&#x9AA4;</p>
<p><img src="/2017/05/15/&#x4E8C;&#x7EF4;&#x7801;/&#x4E8C;&#x7EF4;&#x7801;&#x8FDB;&#x884C;&#x56FE;&#x50CF;&#x5904;&#x7406;.png" alt=""></p>
<p>&#x5C06;&#x4E0A;&#x56FE;&#x6587;&#x5B57;&#x5316;&#x5177;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x4E00;&#x4E0B;&#x5177;&#x4F53;&#x6B65;&#x9AA4;&#xFF1A;</p>
<ul>
<li>&#x62CD;&#x6444;&#x56FE;&#x50CF;&#x8F93;&#x5165;</li>
<li>&#x9884;&#x5904;&#x7406;</li>
<li>&#x56FE;&#x50CF;&#x5B9A;&#x4F4D;</li>
<li>&#x56FE;&#x50CF;&#x6821;&#x6B63;</li>
<li>&#x89E3;&#x7801;&#x6216;&#x8BD1;&#x7801;</li>
</ul>
<p>&#x5173;&#x4E8E;&#x56FE;&#x50CF;&#x8F93;&#x5165;&#x7684;&#x6E20;&#x9053;&#x76EE;&#x524D;&#x4E3B;&#x8981;&#x5206;&#x4E3A;&#x56DB;&#x79CD;&#xFF0C;&#x8BE5;&#x56DB;&#x79CD;&#x5305;&#x542B;&#x4E86;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7684;&#x4FE1;&#x606F;&#x7801;&#x3002;</p>
<ol>
<li>&#x5149;&#x7BA1;&#x8F93;&#x5165;&#xFF1A;&#x4E3B;&#x8981;&#x91C7;&#x96C6;&#x4E00;&#x7EF4;&#x7801;</li>
<li>&#x6FC0;&#x5149;&#x8F93;&#x5165;&#xFF1A;&#x91C7;&#x96C6;&#x4E00;&#x7EF4;&#x7801;&#x4E0E;QR Code</li>
<li>&#x7EBF;&#x9635;&#x8F93;&#x5165;&#xFF1A;&#x5373;&#x7531;LED&#x7EC4;&#x6210;&#x7684;&#x77E9;&#x9635;&#x4E8C;&#x7EF4;&#x7801;</li>
<li>&#x56FE;&#x50CF;&#x8F93;&#x5165;&#xFF1A;&#x5373;&#x7167;&#x7247;&#x7B49;&#x5F62;&#x5F0F;&#x7684;&#x626B;&#x63CF;</li>
</ol>
<p>&#x56FE;&#x50CF;&#x7684;&#x91C7;&#x96C6;&#x4E0E;&#x6570;&#x5B57;&#x56FE;&#x50CF;&#x7684;&#x8D28;&#x91CF;&#x7531;&#x4E8C;&#x7EF4;&#x77E9;&#x9635;&#x7684;&#x5F62;&#x5F0F;&#x5B58;&#x50A8;&#x4E0E;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x3002;&#x5176;&#x4E2D;&#x8BE5;&#x56FE;&#x50CF;&#x7684;&#x5BF9;&#x6BD4;&#x5EA6;&#x3001;&#x6E05;&#x6670;&#x5EA6;&#x7B49;&#x7B49;&#x90FD;&#x662F;&#x56FE;&#x50CF;&#x8D28;&#x91CF;&#x7684;&#x4E3B;&#x8981;&#x5F71;&#x54CD;&#x56E0;&#x7D20;&#x3002;&#x6E05;&#x6670;&#x5EA6;&#x662F;&#x6307;&#x6240;&#x91C7;&#x96C6;&#x56FE;&#x50CF;&#x7684;&#x4EAE;&#x5EA6;&#x3001;&#x5BF9;&#x6BD4;&#x5EA6;&#x3001;&#x5C3A;&#x5BF8;&#x5927;&#x5C0F;&#x3001;&#x989C;&#x8272;&#x9971;&#x548C;&#x5EA6;&#xFF08;&#x989C;&#x8272;&#x9971;&#x548C;&#x5EA6;&#x8D8A;&#x5C0F;&#xFF0C;&#x6E05;&#x6670;&#x5EA6;&#x8D8A;&#x9AD8;&#xFF09;&#x3002;</p>
<p>&#x7528;&#x7269;&#x7406;&#x7684;&#x65B9;&#x5F0F;&#x8868;&#x793A;&#x56FE;&#x50CF;&#x91C7;&#x96C6;&#x53EF;&#x4EE5;&#x62BD;&#x8C61;&#x4E3A;&#x4E0B;&#x56FE;&#x6240;&#x8868;&#x793A;&#x7684;&#x6A21;&#x578B;&#xFF1A;</p>
<p><img src="/2017/05/15/&#x4E8C;&#x7EF4;&#x7801;/&#x6570;&#x5B57;&#x56FE;&#x50CF;&#x7684;&#x91C7;&#x96C6;&#x8FC7;&#x7A0B;.png" alt=""></p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;&#x9884;&#x5904;&#x7406;&#x6A21;&#x5757;&#x3002;&#x8FD9;&#x4E2A;&#x6A21;&#x5757;&#x662F;&#x76F8;&#x5F53;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x5176;&#x4E3B;&#x8981;&#x529F;&#x80FD;&#x5C31;&#x662F;&#x5C06;&#x4E8C;&#x7EF4;&#x7801;&#x4ECE;&#x4F17;&#x591A;&#x590D;&#x6742;&#x4FE1;&#x606F;&#x4E2D;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#x3002;&#x53EF;&#x80FD;&#x4F60;&#x4F1A;&#x95EE;&#xFF0C;&#x4E8C;&#x7EF4;&#x7801;&#x4E0D;&#x5C31;&#x5728;&#x90A3;&#x91CC;&#x561B;&#xFF0C;&#x4E00;&#x773C;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x89C1;&#xFF0C;&#x600E;&#x4E48;&#x4E2A;&#x590D;&#x6742;&#x6CD5;&#xFF1F;&#x4E5F;&#x8BB8;&#x5BF9;&#x4E8E;&#x4EBA;&#x773C;&#x6765;&#x8BF4;&#x4E8C;&#x7EF4;&#x7801;&#x5F88;&#x597D;&#x8FA8;&#x8BA4;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x6765;&#x8BF4;&#x53EF;&#x4E0D;&#x662F;&#x8FD9;&#x6837;&#x3002;&#x8BA1;&#x7B97;&#x5668;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x5217;&#x590D;&#x6742;&#x7684;&#x5224;&#x65AD;&#x624D;&#x80FD;&#x5206;&#x8FA8;&#x51FA;&#x4E8C;&#x7EF4;&#x7801;&#x7684;&#x4F4D;&#x7F6E;&#x3002;</p>
<p><img src="/2017/05/15/&#x4E8C;&#x7EF4;&#x7801;/&#x9884;&#x5904;&#x7406;.png" alt=""></p>
<p>&#x4E0A;&#x56FE;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x9884;&#x5904;&#x7406;&#x6240;&#x8FDB;&#x884C;&#x7684;&#x6B65;&#x9AA4;&#x3002;&#x54B1;&#x4EEC;&#x6765;&#x4E00;&#x4E2A;&#x4E2A;&#x7684;&#x5206;&#x6790;&#x3002;</p>
<p><strong>&#x56FE;&#x50CF;&#x7684;&#x7070;&#x5EA6;&#x5316;&#x5904;&#x7406;</strong></p>
<p>&#x6444;&#x50CF;&#x5934;&#x91C7;&#x96C6;&#x5230;&#x7684;&#x4E8C;&#x7EF4;&#x6761;&#x7801;&#x56FE;&#x7247;&#x662F;RGB&#x683C;&#x5F0F;&#x7684;&#x5F69;&#x8272;&#x56FE;&#x50CF;&#xFF0C;&#x7531;&#x7EA2;(Red)&#x3001;&#x7EFF;(Green)&#x3001;&#x84DD;(Blue)&#x4E09;&#x79CD;&#x57FA;&#x672C;&#x989C;&#x8272;&#x6309;&#x7167;&#x4E00;&#x5B9A;&#x7684;&#x6BD4;&#x4F8B;&#x6DF7;&#x5408;&#x5F97;&#x5230;&#xFF0C;&#x6BCF;&#x4E00;&#x79CD;&#x989C;&#x8272;&#x5206;&#x91CF;&#x6709;256&#x4E2A;&#x7070;&#x5EA6;&#x7EA7;&#xFF0C;&#x4E09;&#x79CD;&#x989C;&#x8272;&#x7EC4;&#x5408;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x51FA;&#x591A;&#x79CD;&#x989C;&#x8272;&#xFF0C;&#x51E0;&#x4E4E;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x4EBA;&#x7C7B;&#x80FD;&#x591F;&#x611F;&#x77E5;&#x5230;&#x7684;&#x6240;&#x6709;&#x989C;&#x8272;&#x3002;&#x5F69;&#x8272;&#x56FE;&#x50CF;&#x5305;&#x542B;&#x4E86;&#x5927;&#x91CF;&#x8BC6;&#x522B;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x8272;&#x5F69;&#x4FE1;&#x606F;&#xFF0C;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x90FD;&#x9700;&#x8981;&#x5360;&#x7528;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x3002;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#xFF0C;R&#x3001;G&#x3001;B&#x4E09;&#x4E2A;&#x5206;&#x91CF;&#x5206;&#x522B;&#x5360;&#x7528;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#x81F3;&#x5C11;&#x9700;&#x8981;&#x5360;&#x7528;&#x4E09;&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x5185;&#x5B58;&#x3002;&#x7070;&#x5EA6;&#x56FE;&#x50CF;&#x53EA;&#x8868;&#x793A;&#x4EAE;&#x5EA6;&#x4FE1;&#x606F;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5360;&#x7528;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x5185;&#x5B58;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5728;&#x56FE;&#x50CF;&#x5904;&#x7406;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x901A;&#x5E38;&#x90FD;&#x5148;&#x5C06;&#x5F69;&#x8272;&#x56FE;&#x50CF;&#x8F6C;&#x6362;&#x6210;&#x7070;&#x5EA6;&#x56FE;&#x50CF;&#xFF0C;&#x8FD9;&#x6837;&#x4E0D;&#x4F46;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x5B58;&#x50A8;&#x5F00;&#x9500;&#xFF0C;&#x800C;&#x4E14;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x540E;&#x7EED;&#x56FE;&#x50CF;&#x5904;&#x7406;&#x7684;&#x8BA1;&#x7B97;&#x91CF;&#xFF0C;&#x52A0;&#x5FEB;&#x4E8C;&#x7EF4;&#x6761;&#x7801;&#x8BC6;&#x522B;&#x901F;&#x5EA6;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x7070;&#x5EA6;&#x56FE;&#x50CF;&#x4E2D;&#x7070;&#x5EA6;&#x503C;&#x7528; Y &#x8868;&#x793A;&#xFF0C;&#x5F69;&#x8272;&#x56FE;&#x50CF;&#x5404;&#x5206;&#x91CF;&#x7684;&#x7070;&#x5EA6;&#x503C;&#x5206;&#x522B;&#x4E3A; R&#x3001; G&#x3001; B&#xFF0C;&#x90A3;&#x4E48;&#x6807;&#x51C6;&#x7684;&#x7070;&#x5EA6;&#x503C;Y&#x7684;&#x8BA1;&#x7B97;&#x516C;&#x5F0F;&#x4E3A;&#xFF1A;</p>
<center>Y = 0.30R+ 0.59G+0.11B</center>

<p><strong>&#x56FE;&#x50CF;&#x7684;&#x4E2D;&#x503C;&#x6EE4;&#x6CE2;&#x5904;&#x7406;</strong></p>
<p>&#x666E;&#x901A;CMOS&#x6444;&#x50CF;&#x5934;&#x91C7;&#x96C6;&#x5230;&#x7684;&#x4E8C;&#x7EF4;&#x6761;&#x7801;&#x56FE;&#x50CF;&#x4E2D;&#x7ECF;&#x5E38;&#x4F1A;&#x542B;&#x6709;&#x4E00;&#x4E9B;&#x566A;&#x58F0;&#x70B9;&#xFF0C;&#x5BFC;&#x81F4;&#x56FE;&#x50CF;&#x9000;&#x5316;&#xFF0C;&#x5BF9;&#x540E;&#x7EED;&#x7684;&#x6761;&#x7801;&#x8BC6;&#x522B;&#x4EA7;&#x751F;&#x4E25;&#x91CD;&#x7684;&#x5E72;&#x6270;&#xFF0C;&#x964D;&#x4F4E;&#x6761;&#x7801;&#x8BC6;&#x522B;&#x7387;&#x3002;&#x9488;&#x5BF9;&#x56FE;&#x50CF;&#x4E2D;&#x666E;&#x904D;&#x5B58;&#x5728;&#x7684;&#x9AD8;&#x65AF;&#x566A;&#x58F0;&#x3001;&#x6912;&#x76D0;&#x566A;&#x58F0;&#x91C7;&#x53D6;&#x4E86;&#x4E2D;&#x503C;&#x6EE4;&#x6CE2;&#x964D;&#x566A;&#x5904;&#x7406;&#xFF0C;&#x80FD;&#x591F;&#x6709;&#x6548;&#x7684;&#x53BB;&#x9664;&#x4E0A;&#x8FF0;&#x51E0;&#x79CD;&#x566A;&#x58F0;&#xFF0C;&#x4FDD;&#x62A4;&#x56FE;&#x50CF;&#x7684;&#x8FB9;&#x7F18;&#x4FE1;&#x606F;&#xFF0C;&#x4E0D;&#x4F1A;&#x5BF9;&#x540E;&#x7EED;&#x7684;&#x8FB9;&#x7F18;&#x63D0;&#x53D6;&#x4EA7;&#x751F;&#x5F88;&#x5927;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x4E2D;&#x503C;&#x6EE4;&#x6CE2;&#x5177;&#x6709;&#x826F;&#x597D;&#x7684;&#x566A;&#x58F0;&#x6291;&#x5236;&#x80FD;&#x529B;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x7EBF;&#x6027;&#x5E73;&#x6ED1;&#x6280;&#x672F;&#x3002;&#x5BF9;&#x4E8E;&#x50CF;&#x7D20;&#x70B9;&#xFF0C;&#x5B83;&#x7EDF;&#x8BA1;&#x5176;&#x9886;&#x57DF;&#x7A97;&#x53E3;&#x5185;&#x6240;&#x6709;&#x50CF;&#x7D20;&#x70B9;&#x7684;&#x7070;&#x5EA6;&#x503C;&#x5E76;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#xFF0C;&#x5C06;&#x8FD9;&#x4E2A;&#x50CF;&#x7D20;&#x70B9;&#x7684;&#x7070;&#x5EA6;&#x503C;&#x8BBE;&#x7F6E;&#x4E3A;&#x6392;&#x5E8F;&#x540E;&#x7684;&#x4E2D;&#x95F4;&#x503C;&#x3002;&#x4E00;&#x822C;&#x9009;&#x53D6;&#x7A97;&#x53E3;&#x50CF;&#x7D20;&#x70B9;&#x4E2A;&#x6570;&#x90FD;&#x4E3A;&#x5947;&#x6570;&#xFF0C;&#x56E0;&#x6B64;&#x4E2D;&#x503C;&#x6EE4;&#x6CE2;&#x7684;&#x6570;&#x5B66;&#x8868;&#x8FBE;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A;</p>
<center>P<sub>M</sub> = Median{ P<sub>1</sub>, P<sub>2</sub>, P<sub>3</sub> &#x2026; P<sub>n</sub> } = P<sub>i((n+1) / 2)</sub></center>


<p>&#x5176;&#x4E2D;&#xFF0C; P<sub>1</sub>, P<sub>2</sub>, P<sub>3</sub> &#x2026; P<sub>n</sub> &#x662F;&#x90BB;&#x57DF;&#x5185;&#x7684;&#x50CF;&#x7D20;&#x7070;&#x5EA6;&#x503C;&#xFF0C;P<sub>M</sub> &#x5C31;&#x662F;&#x90BB;&#x57DF;&#x5185;&#x7684;&#x4E2D;&#x6307;&#x3002;</p>
<p>&#x7A97;&#x53E3;&#x9009;&#x53D6;&#x5BF9;&#x56FE;&#x50CF;&#x4E2D;&#x503C;&#x6EE4;&#x6CE2;&#x7684;&#x6548;&#x679C;&#x4E5F;&#x5C06;&#x4EA7;&#x751F;&#x5F88;&#x5927;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x6839;&#x636E;&#x4E0D;&#x540C;&#x7684;&#x5E94;&#x7528;&#x573A;&#x5408;&#x9700;&#x8981;&#x91C7;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x91C7;&#x6837;&#x7A97;&#x53E3;&#xFF0C;&#x5E38;&#x89C1;&#x7684;&#x91C7;&#x6837;&#x7A97;&#x53E3;&#x6709;&#x5341;&#x5B57;&#x5F62;&#x3001;&#x7C73;&#x5B57;&#x578B;&#x3001;&#x68F1;&#x5F62;&#x3001;&#x77E9;&#x5F62;&#x7B49;&#xFF0C;&#x5176;&#x4E2D;&#x77E9;&#x5F62;&#x7A97;&#x53E3;&#x6700;&#x4E3A;&#x5E38;&#x7528;&#x3002;&#x672C;&#x6587;&#x4E3B;&#x8981;&#x662F;&#x53BB;&#x9664;&#x4E8C;&#x7EF4;&#x6761;&#x7801;&#x56FE;&#x50CF;&#x4E2D;&#x542B;&#x6709;&#x7684;&#x6912;&#x76D0;&#x566A;&#x58F0;&#xFF0C;&#x7ED3;&#x5408;&#x4E8C;&#x7EF4;&#x6761;&#x7801;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x9009;&#x7528; 3*3 &#x7684;&#x77E9;&#x5F62;&#x7A97;&#x53E3;&#x4F5C;&#x4E3A;&#x6EE4;&#x6CE2;&#x7A97;&#x53E3;&#x3002;</p>
<p>&#x4E2D;&#x503C;&#x6EE4;&#x6CE2;&#x662F;&#x901A;&#x8FC7;&#x5BF9;&#x90BB;&#x57DF;&#x5185;&#x50CF;&#x7D20;&#x7684;&#x7070;&#x5EA6;&#x503C;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#xFF0C;&#x80FD;&#x540E;&#x9009;&#x53D6;&#x6392;&#x5E8F;&#x7ED3;&#x679C;&#x7684;&#x4E2D;&#x95F4;&#x503C;&#x4F5C;&#x4E3A;&#x8BE5;&#x50CF;&#x7D20;&#x70B9;&#x7684;&#x7070;&#x5EA6;&#x503C;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x56FE;&#x50CF;&#x4E2D;&#x5B58;&#x5728;&#x7684;&#x6912;&#x76D0;&#x566A;&#x58F0;&#x4E00;&#x822C;&#x662F;&#x968F;&#x673A;&#x5206;&#x6563;&#x5206;&#x5E03;&#x7684;&#xFF0C;&#x5728;&#x8F83;&#x5C0F;&#x7684;&#x9886;&#x57DF;&#x5185;&#x901A;&#x5E38;&#x4E0D;&#x4F1A;&#x5B58;&#x5728;&#x591A;&#x4E2A;&#x6912;&#x76D0;&#x566A;&#x58F0;&#xFF0C;&#x7ECF;&#x8FC7;&#x6392;&#x5E8F;&#x540E;&#xFF0C;&#x566A;&#x58F0;&#x70B9;&#x901A;&#x5E38;&#x662F;&#x6392;&#x5728;&#x9760;&#x524D;&#x6216;&#x8005;&#x9760;&#x540E;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x4E2D;&#x503C;&#x70B9;&#x7684;&#x503C;&#x6BD4;&#x8F83;&#x80FD;&#x4EE3;&#x8868;&#x8FD9;&#x4E2A;&#x50CF;&#x7D20;&#x70B9;&#x7684;&#x5B9E;&#x9645;&#x7070;&#x5EA6;&#x503C;&#x3002;&#x4E2D;&#x503C;&#x6EE4;&#x6CE2;&#x7684;&#x5177;&#x4F53;&#x64CD;&#x4F5C;&#x8FC7;&#x7A0B;&#x5982;&#x4E0B;&#xFF1A;</p>
<ol>
<li>&#x904D;&#x5386;&#x8FD9;&#x4E2A;&#x6A21;&#x677F;&#x4E2D;&#x6240;&#x6709;&#x50CF;&#x7D20;&#x70B9;&#x7684;&#x7070;&#x5EA6;&#x503C;</li>
<li>&#x5C06;&#x8FD9;&#x4E9B;&#x7070;&#x5EA6;&#x503C;&#x4ECE;&#x5C0F;&#x5230;&#x5927;&#x8FDB;&#x884C;&#x6392;&#x5E8F;</li>
<li>&#x9009;&#x53D6;&#x6392;&#x5E8F;&#x7ED3;&#x679C;&#x7684;&#x4E2D;&#x95F4;&#x503C;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x4F5C;&#x4E3A;&#x8FD9;&#x4E2A;&#x6A21;&#x677F;&#x4E2D;&#x5FC3;&#x50CF;&#x7D20;&#x70B9;&#x7684;&#x7070;&#x5EA6;&#x503C;</li>
</ol>
<p><strong>&#x56FE;&#x50CF;&#x7684;&#x4E8C;&#x503C;&#x5316;&#x5904;&#x7406;</strong></p>
<p>&#x57FA;&#x4E8E;&#x95E8;&#x9650;&#x5316;&#x7684;&#x4E8C;&#x503C;&#x5316;&#x65B9;&#x6CD5;&#x3002;&#x5927;&#x6D25;&#x7B97;&#x6CD5;(Otsu)&#x5C31;&#x662F;&#x5176;&#x4E2D;&#x7684;&#x4EE3;&#x8868;&#xFF0C;&#x5BF9;&#x5149;&#x7167;&#x5747;&#x5300;&#x7684;&#x56FE;&#x7247;&#x5177;&#x6709;&#x826F;&#x597D;&#x7684;&#x5206;&#x5272;&#x6548;&#x679C;&#x3002;&#x4F46;&#x62CD;&#x6444;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;&#x5149;&#x6E90;&#x7684;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x7ECF;&#x5E38;&#x4F1A;&#x5BFC;&#x81F4;&#x62CD;&#x6444;&#x5230;&#x7684;&#x56FE;&#x50CF;&#x5B58;&#x5728;&#x5149;&#x7167;&#x4E0D;&#x5747;&#x7684;&#x73B0;&#x8C61;&#xFF0C;&#x56FE;&#x50CF;&#x4E2D;&#x9760;&#x8FD1;&#x5149;&#x6E90;&#x90A3;&#x8FB9;&#x6BD4;&#x8F83;&#x660E;&#x4EAE;&#xFF0C;&#x53E6;&#x4E00;&#x8FB9;&#x5219;&#x6BD4;&#x8F83;&#x6697;&#xFF0C;&#x5BF9;&#x540E;&#x7EED;&#x7684;&#x56FE;&#x50CF;&#x4E8C;&#x503C;&#x5316;&#x5904;&#x7406;&#x4EA7;&#x751F;&#x4E25;&#x91CD;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x8FD9;&#x91CC;&#x5C31;&#x91C7;&#x7528;&#x4E86;&#x4E00;&#x79CD;&#x81EA;&#x9002;&#x5E94;&#x4EAE;&#x5EA6;&#x5747;&#x8861;&#x5316;&#x7B97;&#x6CD5;&#x3002;</p>
<p>&#x65E5;&#x672C;&#x5B66;&#x8005;&#x5927;&#x6D25;&#x5C55;&#x4E4B;&#x9996;&#x5148;&#x63D0;&#x51FA;&#x4E86;&#x6700;&#x5927;&#x7C7B;&#x95F4;&#x65B9;&#x5DEE;&#x7406;&#x8BBA;&#xFF0C;&#x4E5F;&#x53EB;&#x505A;&#x5927;&#x6D25;&#x7B97;&#x6CD5;&#xFF0C;&#x7B80;&#x79F0; OTSU &#x7B97;&#x6CD5;&#x3002;&#x5B83;&#x7684;&#x57FA;&#x672C;&#x601D;&#x60F3;&#x5982;&#x4E0B;&#xFF1A;&#x8BBE;&#x5B9A;&#x4E00;&#x4E2A;&#x9608;&#x503C; t&#xFF0C;&#x5B83;&#x628A;&#x4E00;&#x5E45;&#x7070;&#x5EA6;&#x56FE;&#x50CF;&#x5206;&#x5272;&#x6210;&#x4E24;&#x7EC4;&#xFF0C;&#x4E00;&#x7EC4;&#x7070;&#x5EA6;&#x5BF9;&#x5E94;&#x76EE;&#x6807;&#x56FE;&#x50CF;&#xFF0C;&#x53E6;&#x4E00;&#x7EC4;&#x5BF9;&#x5E94;&#x80CC;&#x666F;&#x56FE;&#x50CF;&#x3002;&#x5047;&#x8BBE;&#x7070;&#x5EA6;&#x56FE;&#x50CF;&#x7684;&#x7070;&#x5EA6;&#x503C;&#x4E3A; 0~k &#x7EA7;&#xFF0C; t &#x4ECE; 0 &#x5F00;&#x59CB;&#x53D6;&#x503C;&#xFF0C;&#x4E00;&#x76F4;&#x5230; k&#xFF0C;&#x5F53; t=T &#x4F7F;&#x5F97;&#x8FD9;&#x4E24;&#x7EC4;&#x7070;&#x5EA6;&#x503C;&#x7684;&#x7C7B;&#x95F4;&#x65B9;&#x5DEE;&#x6700;&#x5927;&#xFF0C;&#x7C7B;&#x5185;&#x65B9;&#x5DEE;&#x6700;&#x5C0F;&#x65F6;&#xFF0C;&#x76EE;&#x6807;&#x56FE;&#x50CF;&#x548C;&#x80CC;&#x666F;&#x56FE;&#x50CF;&#x4E24;&#x90E8;&#x5206;&#x7684;&#x5DEE;&#x522B;&#x8FBE;&#x5230;&#x4E86;&#x6700;&#x5927;&#x5316;&#xFF0C;&#x82E5;&#x5C06;&#x6B64;&#x65F6;&#x7684;&#x9608;&#x503C; T &#x4F5C;&#x4E3A;&#x4E8C;&#x503C;&#x5316;&#x7684;&#x95E8;&#x9650;&#x503C;&#xFF0C;&#x5C06;&#x83B7;&#x5F97;&#x6700;&#x4F73;&#x7684;&#x4E8C;&#x503C;&#x5316;&#x6548;&#x679C;&#x3002;</p>
<p>&#x6BD4;&#x5982;:&#x4E00;&#x5E45;&#x5927;&#x5C0F;&#x4E3A; M*N &#x7684; QR &#x6761;&#x7801;&#x56FE;&#x50CF;&#xFF0C;&#x8BBE;&#x9608;&#x503C; t &#x5C06;&#x56FE;&#x50CF;&#x5206;&#x5272;&#x6210;&#x524D;&#x666F;&#x8272;&#x548C;&#x80CC;&#x666F;&#x8272;&#x4E24;&#x7EC4;&#xFF0C;n<sub>i</sub> &#x4E3A;&#x56FE;&#x50CF;&#x4E2D;&#x7070;&#x5EA6;&#x503C;&#x7684;&#x50CF;&#x7D20;&#x4E2A;&#x6570;&#xFF0C; G &#x4E3A;&#x7070;&#x5EA6;&#x56FE;&#x7684;&#x6700;&#x5927;&#x7070;&#x5EA6;&#x7EA7;&#xFF0C;8&#x4F4D;&#x7070;&#x5EA6;&#x56FE;&#x7684;&#x6700;&#x5927;&#x7070;&#x5EA6;&#x7EA7;&#x4E3A;255&#xFF0C;&#x5219;&#xFF1A;</p>
<p>&#x524D;&#x666F;/&#x80CC;&#x666F;&#x8272;&#x50CF;&#x7D20;&#x70B9;&#x5360;&#x6574;&#x4E2A;&#x56FE;&#x50CF;&#x7684;&#x6BD4;&#x4F8B; &#x3C9;1 &#x548C; &#x3C9;2 &#x5206;&#x522B;&#x4E3A;&#xFF1A;</p>
<p><img src="/2017/05/15/&#x4E8C;&#x7EF4;&#x7801;/&#x516C;&#x5F0F;&#x4E00;.png" alt=""></p>
<p>&#x524D;&#x666F;/&#x80CC;&#x666F;&#x8272;&#x50CF;&#x7D20;&#x70B9;&#x7684;&#x5E73;&#x5747;&#x7070;&#x5EA6;&#x503C; &#x3BC;1 &#x548C; &#x3BC;2 &#x5206;&#x522B;&#x4E3A;&#xFF1A;</p>
<p><img src="/2017/05/15/&#x4E8C;&#x7EF4;&#x7801;/&#x516C;&#x5F0F;&#x4E8C;.png" alt=""></p>
<p>&#x6574;&#x5E45;&#x56FE;&#x50CF;&#x7684;&#x5E73;&#x5747;&#x7070;&#x5EA6;&#x503C; &#x3BC; &#x4E3A;&#xFF1A;</p>
<p><img src="/2017/05/15/&#x4E8C;&#x7EF4;&#x7801;/&#x516C;&#x5F0F;&#x4E09;.png" alt=""></p>
<p>&#x5219;&#x4E24;&#x7EC4;&#x56FE;&#x50CF;&#x7684;&#x7C7B;&#x95F4;&#x65B9;&#x5DEE; &#x3C3;<sup>2</sup>(t) &#x4E3A;&#xFF1A;</p>
<center>&#x3C3;<sup>2</sup>(t) = &#x3C9;1&#x3BC;1 - &#x3BC;<sup>2</sup> + &#x3C9;2&#x3BC;2 - &#x3BC;<sup>2</sup></center>

<p>&#x5F53; 0~k &#x4E4B;&#x95F4;&#x6539;&#x53D8; t&#xFF0C;&#x5E26;&#x5165;&#x5230;&#x4E0A;&#x5F0F;&#x4E2D;&#xFF0C;&#x5F53; t=T &#x4F7F;&#x5F97; &#x3C3;<sup>2</sup>(t) &#x53D6;&#x5F97;&#x6700;&#x5927;&#x503C;&#x65F6;&#xFF0C;&#x6709;&#x7531;&#x5927;&#x6D25;&#x5B9A;&#x5F8B;&#x6211;&#x4EEC;&#x5F97;&#x77E5;&#xFF0C;T &#x5373;&#x4E3A;&#x6700;&#x4F73;&#x9619;&#x503C;&#xFF0C;T = max[&#x3C3;<sup>2</sup>(t)]&#x3002;&#x6839;&#x636E;&#x9619;&#x503C; T &#x5C06;&#x56FE;&#x50CF;&#x6570;&#x636E;&#x5206;&#x4E3A;&#x5927;&#x4E8E;&#x9619;&#x503C;&#x4E0E;&#x5C0F;&#x4E8E;&#x9619;&#x503C;&#x4E24;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x5927;&#x6D25;&#x7B97;&#x6CD5;&#x662F;&#x5168;&#x5C40;&#x9608;&#x503C;&#x6CD5;&#xFF0C;&#x56FE;&#x50CF;&#x5206;&#x5272;&#x9608;&#x503C;&#x7684;&#x9009;&#x53D6;&#x662F;&#x5EFA;&#x7ACB;&#x5728;&#x6574;&#x5E45;&#x56FE;&#x7247;&#x524D;&#x666F;&#x8272;&#x548C;&#x80CC;&#x666F;&#x8272;&#x7684;&#x533A;&#x5206;&#x57FA;&#x7840;&#x4E0A;&#x7684;&#xFF0C;&#x5F53;&#x56FE;&#x50CF;&#x4E2D;&#x5B58;&#x5728;&#x6BD4;&#x8F83;&#x4E25;&#x91CD;&#x7684;&#x5149;&#x7167;&#x4E0D;&#x5747;&#x65F6;&#xFF0C;&#x5BB9;&#x6613;&#x9519;&#x8BEF;&#x7684;&#x5C06;&#x56FE;&#x50CF;&#x4E2D;&#x8F83;&#x6697;&#x7684;&#x90E8;&#x5206;&#x8BA4;&#x4E3A;&#x662F;&#x524D;&#x666F;&#x8272;&#xFF0C;&#x8F83;&#x4EAE;&#x7684;&#x90E8;&#x5206;&#x80CC;&#x666F;&#x8272;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x628A;&#x6761;&#x7801;&#x672C;&#x8EAB;&#x4F5C;&#x4E3A;&#x524D;&#x666F;&#x8272;&#xFF0C;&#x5F97;&#x5230;&#x9519;&#x8BEF;&#x7684;&#x95E8;&#x9650;&#x9608;&#x503C;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x6548;&#x679C;&#x5E76;&#x4E0D;&#x7406;&#x60F3;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x4F7F;&#x7528;&#x81EA;&#x9002;&#x5E94;&#x4EAE;&#x5EA6;&#x8C03;&#x8282;&#xFF01;</p>
<p><strong>&#x4E8C;&#x7EF4;&#x7801;&#x9884;&#x5904;&#x7406;&#x4E4B;&#x81EA;&#x9002;&#x5E94;&#x4EAE;&#x5EA6;&#x5747;&#x8861;&#x7B97;&#x6CD5;&#x7684;&#x4ECB;&#x7ECD;&#xFF1A;</strong></p>
<p>&#x7B2C;&#x4E00;&#x6B65;&#xFF1A;&#x5C06;&#x6761;&#x5F62;&#x7801;&#x56FE;&#x50CF;&#x7684;&#x7B2C;&#x4E00;&#x884C;&#x50CF;&#x7D20;&#x5747;&#x7B49;&#x7684;&#x5206;&#x6210; N &#x5757;&#xFF0C;&#x5047;&#x8BBE;&#x6BCF;&#x4E00;&#x5757;&#x542B;&#x6709; C &#x4E2A;&#x50CF;&#x7D20;&#xFF0C;&#x5757;&#x5185;&#x6BCF;&#x4E2A;&#x50CF;&#x7D20;&#x70B9;&#x5206;&#x522B;&#x6807;&#x8BB0;&#x4E3A; p<sub>N1</sub>, p<sub>N2</sub>, p<sub>N3</sub>, &#x2026;, p<sub>NC</sub>&#x3002;&#x5219;&#x56FE;&#x50CF;&#x4E00;&#x884C;&#x7684;&#x50CF;&#x7D20;&#x70B9;&#x603B;&#x6570;&#x4E2A;&#x6570; K = N * C&#x3002;p<sub>N1</sub> &#x548C; p<sub>NC</sub> &#x5206;&#x522B;&#x4E3A;&#x8FD9;&#x4E2A;&#x5FEB;&#x4E2D;&#x7B2C;&#x4E00;&#x4E2A;&#x548C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#xFF0C;&#x8BA1;&#x7B97;&#x51FA;&#x6BCF;&#x5757;&#x7684;&#x7070;&#x5EA6;&#x7B49;&#x7EA7;&#x8BB0;&#x4E3A; SL<sub>N</sub> &#x4E3A;&#xFF1A;</p>
<center>SL<sub>N</sub> = MAX_M(p<sub>N1</sub>~p<sub>NC</sub>) / M</center>

<p>&#x5176;&#x4E2D;&#xFF0C;MAX_M(p<sub>N1</sub>~p<sub>NC</sub>) = &#x2211; H<sub>pi</sub>&#x3002;H<sub>pi</sub> &#x4E3A;&#x8FD9;&#x4E2A;&#x5757;&#x4E2D;&#x6700;&#x5927;&#x7684; M &#x4E2A;&#x50CF;&#x7D20;&#x70B9;&#x7684;&#x7070;&#x5EA6;&#x503C;&#xFF0C;&#x5229;&#x7528;&#x6C42;&#x5E73;&#x5747;&#x503C;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x51CF;&#x5C0F;&#x566A;&#x58F0;&#x70B9;&#x7684;&#x5E72;&#x6270;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x6B65;&#xFF1A;&#x8BA1;&#x7B97;&#x524D;&#x540E;&#x4E24;&#x5757;&#x7684;&#x63D2;&#x503C;&#x4E3A;&#xFF1A;</p>
<center>D<sub>i</sub>ff<sub>N</sub> = | SL<sub>N</sub> - SL<sub>N+1</sub> |</center>


<p>&#x540C;&#x65F6;&#xFF0C;&#x4E0D;&#x65AD;&#x5C06;&#x5757;&#x7684;&#x5927;&#x5C0F;&#x8FDB;&#x884C;&#x5BF9;&#x7B49;&#x5206;&#x88C2;&#xFF0C;&#x76F4;&#x81F3;&#x5DEE;&#x503C; D<sub>i</sub>ff<sub>N</sub> &#x5C0F;&#x4E8E;&#x9619;&#x503C;&#x6216;&#x8005;&#x5757;&#x7684;&#x5927;&#x5C0F;&#x4E0D;&#x5927;&#x4E8E; M&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#x6B65;&#xFF1A;&#x5728;&#x76F8;&#x90BB;&#x4E24;&#x4E2A;&#x5757;&#x4E4B;&#x95F4;&#x4F7F;&#x7528;&#x7EBF;&#x6027;&#x63D2;&#x503C;&#x8BA1;&#x7B97;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA1;&#x7B97;&#x51FA;&#x5757;&#x5185;&#x6BCF;&#x4E2A;&#x70B9;&#x7684;&#x50CF;&#x7D20;&#x7070;&#x5EA6;&#x503C;&#xFF0C;&#x7528; S<sub>Ni</sub> &#x8868;&#x793A;&#x5982;&#x4E0B;&#xFF1A;</p>
<center>S<sub>Ni</sub> = ( SL<sub>N</sub> <em> ( C-1 ) + SL<sub>N</sub> </em> i ) / C</center>


<p>&#x5176;&#x4E2D;&#xFF0C;S<sub>Ni</sub> &#x8868;&#x793A;&#x7B2C; N &#x5757;&#x4E2D;&#x7684;&#x7B2C; i &#x4E2A;&#x50CF;&#x7D20;&#x7684;&#x7070;&#x5EA6;&#x503C;&#x3002;</p>
<p>&#x7B2C;&#x56DB;&#x6B65;&#xFF1A;&#x57FA;&#x4E8E;&#x4E0A;&#x8BC9;&#x8BA1;&#x7B97;&#x51FA;&#x7684;&#x5149;&#x7167;&#x5206;&#x5E03;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x81EA;&#x9002;&#x5E94;&#x7684;&#x8C03;&#x6574;&#x7ED9;&#x5404;&#x4E2A;&#x50CF;&#x7D20;&#x70B9;&#x7684;&#x589E;&#x76CA;&#x3002;&#x5982;&#x679C; S<sub>Ni</sub> &#x7684;&#x503C;&#x8F83;&#x5C0F;&#xFF0C;&#x8FD9;&#x4E2A;&#x50CF;&#x7D20;&#x70B9;&#x7684;&#x589E;&#x76CA;&#x5C31;&#x53EF;&#x4EE5;&#x9002;&#x5F53;&#x52A0;&#x5927;&#xFF0C;&#x53CD;&#x4E4B;&#x5219;&#x51CF;&#x5C0F;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x5C06;&#x80CC;&#x666F;&#x8F83;&#x6697;&#x7684;&#x90E8;&#x5206;&#x52A0;&#x91CF;&#xFF0C;&#x80CC;&#x666F;&#x660E;&#x4EAE;&#x7684;&#x90E8;&#x5206;&#x5219;&#x57FA;&#x672C;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#xFF0C;&#x8FBE;&#x5230;&#x5149;&#x7167;&#x8865;&#x507F;&#x671F;&#x671B;&#x7684;&#x6548;&#x679C;&#x3002;&#x5177;&#x4F53;&#x7684;&#x589E;&#x76CA;&#x516C;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A;</p>
<center>AGC<sub>Ni</sub> = BC / S<sub>Ni</sub></center>


<p>&#x5176;&#x4E2D;&#xFF0C;AGC<sub>Ni</sub> &#x4E3A;&#x7B2C; N &#x5757;&#x7B2C; i &#x4E2A;&#x50CF;&#x7D20;&#x7684;&#x589E;&#x76CA;&#x3002;BC&#x662F;&#x7ECF;&#x9A8C;&#x503C;&#xFF0C;&#x7528;&#x6765;&#x63A7;&#x5236;&#x56FE;&#x50CF;&#x4EAE;&#x5EA6;&#x7684;&#x7CFB;&#x6570;&#x503C;&#xFF0C;&#x901A;&#x8FC7;&#x53CD;&#x590D;&#x8BD5;&#x9A8C;&#xFF0C;&#x5F97;&#x51FA;&#x5F53; BC = 240 &#x65F6;&#x80FD;&#x83B7;&#x5F97;&#x826F;&#x597D;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<p>&#x5904;&#x7406;&#x540E;&#x56FE;&#x50CF;&#x6BCF;&#x4E2A;&#x50CF;&#x7D20;&#x70B9;&#x7684;&#x7070;&#x5EA6;&#x503C;&#x4E3A;&#xFF1A;</p>
<center>p<sub>Ni</sub>&#x2018; = p<sub>Ni</sub> * AGC<sub>Ni</sub></center>

<p>&#x8FD9;&#x91CC;&#x7684; p<sub>Ni</sub> &#x4E3A;&#x539F;&#x59CB;&#x7070;&#x5EA6;&#x503C;&#xFF0C;p<sub>Ni</sub>&#x2018; &#x4E3A;&#x539F;&#x56FE;&#x50CF;&#x4E2D;&#x7684;&#x50CF;&#x7D20;&#x70B9;&#x5728;&#x7ECF;&#x8FC7;&#x81EA;&#x9002;&#x5E94;&#x589E;&#x76CA;&#x53D8;&#x6362;&#x540E;&#x7684;&#x7070;&#x5EA6;&#x503C;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x5F53; SL<sub>N</sub> &#x7684;&#x7070;&#x5EA6;&#x7EA7;&#x6BD4;&#x8F83;&#x5927;&#x65F6;&#xFF0C;&#x5DF2;&#x7ECF;&#x4E0D;&#x9700;&#x8981;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x589E;&#x76CA;&#x5904;&#x7406;&#xFF0C;&#x6B64;&#x65F6;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BBE;&#x5B9A;&#x4E00;&#x4E2A;&#x9619;&#x503C; T&#xFF0C;&#x5F53; SL<sub>N</sub> &#x8D85;&#x8FC7;&#x8FD9;&#x4E2A;&#x9619;&#x503C;&#x65F6;&#xFF0C;&#x4E0D;&#x5BF9;&#x8BE5;&#x50CF;&#x7D20;&#x70B9;&#x8FDB;&#x884C;&#x589E;&#x76CA;&#x5904;&#x7406;&#x3002;</p>
<p>&#x7B2C;&#x4E94;&#x6B65;&#xFF1A;&#x91C7;&#x7528;&#x5927;&#x6D25;&#x7B97;&#x6CD5;&#x5BF9;&#x81EA;&#x9002;&#x5E94;&#x4EAE;&#x5EA6;&#x5747;&#x8861;&#x540E;&#x7684;&#x56FE;&#x5F62;&#x8FDB;&#x884C;&#x4E8C;&#x503C;&#x5316;&#x5904;&#x7406;&#xFF0C;&#x6548;&#x679C;&#x5982;&#x4E0B;&#x56FE;&#xFF1A;</p>
<p><img src="/2017/05/15/&#x4E8C;&#x7EF4;&#x7801;/&#x6548;&#x679C;&#x56FE;.png" alt=""></p>
<p>&#x7B97;&#x6CD5;&#x90E8;&#x5206;&#x6682;&#x65F6;&#x5230;&#x6B64;&#x7ED3;&#x675F;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x5C06;&#x4ECB;&#x7ECD;&#x4E8C;&#x7EF4;&#x7801;&#x7684;&#x5B9A;&#x4F4D;&#x65B9;&#x5F0F;&#x4E0E;&#x89E3;&#x7801;&#x8FC7;&#x7A0B;&#x3002;</p>

      
    </div><!-- .entry-content -->

    <footer class="entry-meta">
    <a href="/2017/05/15/二维码/">
    <time datetime="2017-05-15T11:38:03.000Z" class="entry-date">
        2017-05-15
    </time>
</a>
    
  <span class="article-delim">&#8226;</span>
  <div class="article-category">
  <a class="article-category-link" href="/categories/编程/">编程</a>
  </div>

    
  <span class="article-delim">&#8226;</span>
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/二维码/">二维码</a></li></ul>

    </footer>
</article>


    
<nav class="nav-single">
    <h3 class="assistive-text">文章导航</h3>
    
        <span class="nav-previous"><a href="/2017/07/19/MapReduce-and-Hadoop/" rel="prev"><span class="meta-nav">←</span> MapReduce &amp; Hadoop</a></span>
    
    
        <span class="nav-next"><a href="/2017/04/21/模拟退火/" rel="next">模拟退火 <span class="meta-nav">→</span></a></span>
    
</nav><!-- .nav-single -->







</div></div>
        <div id="secondary" class="widget-area" role="complementary">
  
    <aside id="search" class="widget widget_search"><form role="search" method="get" accept-charset="utf-8" id="searchform" class="searchform" action="//google.com/search">
    <div>
        <input type="text" value="" name="s" id="s" />
        <input type="submit" id="searchsubmit" value="搜索" />
    </div>
</form></aside>
  
    
  
    
  <aside class="widget">
    <h3 class="widget-title">Categories</h3>
    <div class="widget-content">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/LIFE/">LIFE</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/MAC/">MAC</a><span class="category-list-count">3</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/ML/">ML</a><span class="category-list-count">25</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/PGM/">PGM</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/iOS/">iOS</a><span class="category-list-count">22</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/御宅文化/">御宅文化</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/算法/">算法</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/编程/">编程</a><span class="category-list-count">58</span></li></ul>
    </div>
  </aside>

  
    
<div class="widget tag">
<h3 class="title">blogroll</h3>
<ul class="entry">


<li><a href="https://github.com/" target="_blank">我的github</a></li>


<li><a href="http://www.jianshu.com/users/41cd7711ed44/latest_articles" target="_blank">我的简书主页</a></li>


<li><a href="http://uuzdaisuki.com" target="_blank">leticia’s blog</a></li>


<li><a href="http://www.helloyzy.cn" target="_blank">acery</a></li>


<li><a href="http://wxjackie.com" target="_blank">WXJACKIE</a></li>


<li><a href="http://www.stephenzhang.me" target="_blank">stephenzhang</a></li>


<li><a href="blog.keybrl.com" target="_blank">keybrl</a></li>


<li><a href="http://www.ciaran.cn/" target="_blank">Ciaran</a></li>


<li><a href="http://1.dev.blog.qinka.pro" target="_blank">Qinka</a></li>


<li><a href="http://tobiasLee.top" target="_blank">TobiasLee</a></li>


<li><a href="http://blog.boileryao.com" target="_blank">bingo</a></li>

</ul>
</div>

  
    
  <aside class="widget">
    <h3 class="widget-title">Recents</h3>
    <div class="widget-content">
      <ul>
        
          <li>
            <a href="/2017/11/17/如何在Xcode中添加-bits-stdc-h-头文件/">如何在Xcode中添加&lt;bits/stdc++.h&gt;头文件</a>
          </li>
        
          <li>
            <a href="/2017/11/02/LSTM/">RNN 与 LSTM</a>
          </li>
        
          <li>
            <a href="/2017/11/01/循环神经网络-RNN/">循环神经网络_RNN</a>
          </li>
        
          <li>
            <a href="/2017/10/31/CNN之定位检测/">卷积神经网络之定位检测</a>
          </li>
        
          <li>
            <a href="/2017/10/27/CNN-Structure-2/">CNN_Structure_2</a>
          </li>
        
      </ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Tags</h3>
    <div class="widget-content">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/Cloud-Computing/">Cloud Computing</a><span class="tag-list-count">3</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Cocoapods/">Cocoapods</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/HTML/">HTML</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Linux/">Linux</a><span class="tag-list-count">15</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Machine-Learning/">Machine Learning</a><span class="tag-list-count">17</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Matlab/">Matlab</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Neural-Networks/">Neural Networks</a><span class="tag-list-count">5</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Probabilistic-Graphical-Models/">Probabilistic Graphical Models</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIColor/">UIColor</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView/">UIView</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView-圆角/">UIView-圆角</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Vim/">Vim</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/bug/">bug</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/hexo/">hexo</a><span class="tag-list-count">4</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/openCV/">openCV</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/二维码/">二维码</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/指针/">指针</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/操作系统/">操作系统</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/数据库/">数据库</a><span class="tag-list-count">3</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/数据结构/">数据结构</a><span class="tag-list-count">20</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/算法/">算法</a><span class="tag-list-count">9</span></li></ul>
    </div>
  </aside>

  
</div>
      </div>
      <footer id="colophon" role="contentinfo">
    <p>&copy; 2017 SaberDa
    All rights reserved.</p>
    <p>Powered by <a href="http://hexo.io/" target="_blank">Hexo</a></p>
</footer>
    <script>window._bd_share_config={"common":{"bdSnsKey":{},"bdText":"","bdMini":"1","bdMiniList":false,"bdPic":"","bdStyle":"2","bdSize":"16"},"share":{}};with(document)0[(getElementsByTagName('head')[0]||body).appendChild(createElement('script')).src='http://bdimg.share.baidu.com/static/api/js/share.js?v=89860593.js?cdnversion='+~(-new Date()/36e5)];</script>

<script src="/js/jquery-2.0.3.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

<script src="/js/navigation.js"></script>

<div id="bg"></div>

  </div>
</body>
</html>