<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  
  <meta name="description" content="阿尔托利亚是我老婆~" />
  

  
  
  
  
  
  
  <title>散列表 | SaberDa的幻想乡</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x6563;&amp;#x5217;&amp;#x8868;&amp;#x662F;&amp;#x4EC0;&amp;#x4E48;&amp;#xFF1F;&amp;#x6211;&amp;#x5728;&amp;#x9759;&amp;#x6001;&amp;#x67E5;&amp;#x627E;&amp;#x8868;&amp;#x4E0E;&amp;#x9759;&amp;#x6001;&amp;#x67E5;&amp;#x627E;&amp;#x8868;&amp;#x4E24;&amp;#x7BC7;&amp;#x6587;&amp;#x7AE0;&amp;#x4E2D;">
<meta property="og:type" content="article">
<meta property="og:title" content="散列表">
<meta property="og:url" content="https://saberda.github.io/2016/11/17/散列表/index.html">
<meta property="og:site_name" content="SaberDa的幻想乡">
<meta property="og:description" content="&amp;#x6563;&amp;#x5217;&amp;#x8868;&amp;#x662F;&amp;#x4EC0;&amp;#x4E48;&amp;#xFF1F;&amp;#x6211;&amp;#x5728;&amp;#x9759;&amp;#x6001;&amp;#x67E5;&amp;#x627E;&amp;#x8868;&amp;#x4E0E;&amp;#x9759;&amp;#x6001;&amp;#x67E5;&amp;#x627E;&amp;#x8868;&amp;#x4E24;&amp;#x7BC7;&amp;#x6587;&amp;#x7AE0;&amp;#x4E2D;">
<meta property="og:updated_time" content="2016-11-17T12:34:36.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="散列表">
<meta name="twitter:description" content="&amp;#x6563;&amp;#x5217;&amp;#x8868;&amp;#x662F;&amp;#x4EC0;&amp;#x4E48;&amp;#xFF1F;&amp;#x6211;&amp;#x5728;&amp;#x9759;&amp;#x6001;&amp;#x67E5;&amp;#x627E;&amp;#x8868;&amp;#x4E0E;&amp;#x9759;&amp;#x6001;&amp;#x67E5;&amp;#x627E;&amp;#x8868;&amp;#x4E24;&amp;#x7BC7;&amp;#x6587;&amp;#x7AE0;&amp;#x4E2D;">
  
  
    <link rel="icon" href="/css/images/favicon.ico">
  
  <link rel="stylesheet" href="/css/style.css">
  

  
  <!-- baidu webmaster push -->
  <script src='//push.zhanzhang.baidu.com/push.js'></script>
</head>
<body class="home blog custom-background custom-font-enabled single-author">
  <div id="page" class="hfeed site">
      <header id="masthead" class="site-header" role="banner">
    <hgroup>
      <h1 class="site-title">
        <a href="/" title="SaberDa的幻想乡" rel="home">SaberDa的幻想乡</a>
      </h1>
      
        <h2 class="site-description">
          <a href="/" id="subtitle">　　iOS　　|　　二次元　　|　　630991493@qq.com　　|　　没人是真正高冷的 只不过暖的不再是你</a>
        </h2>
      
    </hgroup>

    <nav id="site-navigation" class="main-navigation" role="navigation">
            <button class="menu-toggle">菜单</button>
            <a class="assistive-text" href="/#content" title="跳至内容">跳至内容</a><!--TODO-->
            <div class="menu-main-container">
                <ul id="menu-main" class="nav-menu">
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/archives">所有文章</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/">主页</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/编程/">编程</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/iOS/">iOS</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/MAC/">MAC</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/御宅文化/">御宅文化</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/LIFE/">LIFE</a></li>
                
                </ul>
            </div>
    </nav>
</header>
      <div id="main" class="wrapper">
        <div id="primary" class="site-content"><div id="content" role="main"><article id="post-散列表" class="post-散列表 post type-post status-publish format-standard hentry">
    <!---->

      <header class="entry-header">
        
        
  
    <h1 class="entry-title article-title">
      散列表
    </h1>
  

        
        <div class="comments-link">
            
            <a href="javascript:void(0);" data-url="https://saberda.github.io/2016/11/17/散列表/" data-id="civntez2m004g0zb3fjaariyg" class="leave-reply bdsharebuttonbox" data-cmd="more">Share</a>
        </div><!-- .comments-link -->
      </header><!-- .entry-header -->

    <div class="entry-content">
      
        <h2 id="&#x6563;&#x5217;&#x8868;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;"><a href="#&#x6563;&#x5217;&#x8868;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;" class="headerlink" title="&#x6563;&#x5217;&#x8868;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;"></a>&#x6563;&#x5217;&#x8868;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</h2><p>&#x6211;&#x5728;&#x9759;&#x6001;&#x67E5;&#x627E;&#x8868;&#x4E0E;&#x9759;&#x6001;&#x67E5;&#x627E;&#x8868;&#x4E24;&#x7BC7;&#x6587;&#x7AE0;&#x4E2D;&#x8868;&#x793A;&#x67E5;&#x627E;&#x8868;&#x7684;&#x5404;&#x79CD;&#x7ED3;&#x6784;&#x7684;&#x5171;&#x540C;&#x7279;&#x70B9;&#xFF1A;&#x8BB0;&#x5F55;&#x5728;&#x8868;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#x548C;&#x5B83;&#x7684;&#x5173;&#x952E;&#x5B57;&#x4E4B;&#x95F4;&#x4E0D;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x786E;&#x5B9A;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x67E5;&#x627E;&#x7684;&#x8FC7;&#x7A0B;&#x4E3A;&#x7ED9;&#x5B9A;&#x503C;&#x4F9D;&#x6B21;&#x548C;&#x5173;&#x952E;&#x5B57;&#x96C6;&#x5408;&#x4E2D;&#x5404;&#x4E2A;&#x5173;&#x952E;&#x5B57;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#xFF0C;&#x67E5;&#x627E;&#x7684;&#x6548;&#x7387;&#x53D6;&#x51B3;&#x4E8E;&#x548C;&#x7ED9;&#x5B9A;&#x503C;&#x6BD4;&#x8F83;&#x7684;&#x5173;&#x952E;&#x5B57;&#x4E2A;&#x6570;&#x3002;</p>
<p>&#x7528;&#x8FD9;&#x7C7B;&#x65B9;&#x6CD5;&#x8868;&#x793A;&#x7684;&#x67E5;&#x627E;&#x8868;&#xFF0C;&#x5176;&#x5E73;&#x5747;&#x67E5;&#x627E;&#x957F;&#x5EA6;&#x90FD;&#x4E0D;&#x4E3A;0&#x3002;&#x4E0D;&#x540C;&#x7684;&#x8868;&#x793A;&#x65B9;&#x6CD5;&#xFF0C;&#x5176;&#x5DEE;&#x522B;&#x4EC5;&#x5728;&#x4E8E;&#xFF1A;&#x5173;&#x952E;&#x5B57;&#x4E0E;&#x7ED9;&#x5B9A;&#x503C;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x7684;&#x987A;&#x5E8F;&#x4E0D;&#x540C;&#x3002;</p>
<a id="more"></a>
<p>&#x5BF9;&#x4E8E;&#x9891;&#x7E41;&#x6BD4;&#x8F83;&#x7684;&#x67E5;&#x627E;&#x8868;&#xFF0C;&#x5E0C;&#x671B;ASL = 0&#x3002;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#xFF1A;&#x9884;&#x5148;&#x77E5;&#x9053;&#x6240;&#x67E5;&#x5173;&#x952E;&#x5B57;&#x5728;&#x8868;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x5373;&#x8981;&#x6C42;&#xFF1A;&#x8BB0;&#x5F55;&#x5728;&#x8868;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#x548C;&#x5176;&#x5173;&#x952E;&#x5B57;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x4E00;&#x79CD;&#x786E;&#x5B9A;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>
<p>eg&#xFF1A;&#x4E3A;zsr&#x8FFD;&#x6C42;&#x7684;1000&#x540D;&#x59B9;&#x5B50;&#x5EFA;&#x7ACB;&#x4E00;&#x5F20;&#x67E5;&#x627E;&#x8868;&#xFF0C;&#x5176;&#x5173;&#x952E;&#x5B57;&#x4E3A;&#x5E8F;&#x53F7;&#xFF0C;&#x5176;&#x503C;&#x5F97;&#x8303;&#x56F4;&#x4E3A; xx000~xx999 (&#x524D;&#x4E24;&#x4F4D;&#x662F;&#x5E74;&#x4EFD;)&#x3002;<br>&#x82E5;&#x4EE5;&#x4E0B;&#x6807;&#x8303;&#x56F4;&#x4E3A;000~999&#x7684;&#x987A;&#x5E8F;&#x8868;&#x8868;&#x793A;&#x4E4B;&#xFF0C;&#x5219;&#x67E5;&#x627E;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x8FDB;&#x884C;&#x4E3A;&#xFF1A;&#x53D6;&#x7ED9;&#x5B9A;&#x503C;&#xFF08;&#x5E8F;&#x53F7;&#xFF09;&#x7684;&#x540E;&#x4E09;&#x4F4D;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x7ECF;&#x8FC7;&#x6BD4;&#x8F83;&#x4FBF;&#x53EF;&#x76F4;&#x63A5;&#x4ECE;&#x987A;&#x5E8F;&#x8868;&#x4E2D;&#x627E;&#x5230;&#x5F85;&#x67E5;&#x5173;&#x952E;&#x5B57;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x52A8;&#x6001;&#x67E5;&#x627E;&#x8868;&#x800C;&#x8A00;&#xFF1A;<br>1&#xFF09;&#x8868;&#x957F;&#x4E0D;&#x786E;&#x5B9A;&#xFF1B;<br>2&#xFF09;&#x5728;&#x8BBE;&#x8BA1;&#x67E5;&#x627E;&#x8868;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EA;&#x77E5;&#x9053;&#x5173;&#x952E;&#x5B57;&#x6240;&#x5C5E;&#x7684;&#x8303;&#x56F4;&#xFF0C;&#x800C;&#x4E0D;&#x77E5;&#x9053;&#x786E;&#x5207;&#x7684;&#x5173;&#x952E;&#x5B57;&#xFF1B;</p>
<p>&#x56E0;&#x6B64;&#x5728;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x9700;&#x5728;&#x5173;&#x952E;&#x5B57;&#x4E0E;&#x8BB0;&#x5F55;&#x5728;&#x8868;&#x4E2D;&#x7684;&#x5B58;&#x50A8;&#x4F4D;&#x7F6E;&#x4E4B;&#x95F4;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x5173;&#x7CFB;&#xFF0C;&#x4EE5; f(key) &#x4F5C;&#x4E3A;&#x5173;&#x952E;&#x5B57;&#x4E3A; key &#x7684;&#x8BB0;&#x5F55;&#x5728;&#x8868;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x901A;&#x5E38;&#x79F0; f(key) &#x4E3A;&#x6563;&#x5217;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x6563;&#x5217;&#x51FD;&#x6570;&#x7684;&#x6027;&#x8D28;&#xFF1A;</p>
<ul>
<li>&#x6563;&#x5217;(Hash)&#x51FD;&#x6570;&#x662F;&#x4E00;&#x4E2A;&#x6620;&#x50CF;&#xFF0C;&#x5373;&#xFF1A;&#x5C06;&#x5173;&#x952E;&#x5B57;&#x7684;&#x96C6;&#x5408;&#x6620;&#x5C04;&#x67D0;&#x4E2A;&#x5730;&#x5740;&#x96C6;&#x5408;&#x4E0A;&#xFF0C;&#x4ED6;&#x7684;&#x8BBE;&#x7F6E;&#x5F88;&#x7075;&#x6D3B;&#xFF0C;&#x53EA;&#x8981;&#x8FD9;&#x4E2A;&#x5730;&#x5740;&#x96C6;&#x5408;&#x7684;&#x5927;&#x5C0F;&#x4E0D;&#x8D85;&#x51FA;&#x5141;&#x8BB8;&#x8303;&#x56F4;&#x5185;&#x5373;&#x53EF;&#xFF1B;</li>
<li>&#x7531;&#x4E8E;&#x6563;&#x5217;&#x51FD;&#x6570;&#x662F;&#x4E00;&#x4E2A;&#x538B;&#x7F29;&#x6620;&#x50CF;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x4EA7;&#x751F;&#x51B2;&#x7A81;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5373; key1 != key2 &#xFF0C;&#x4F46;&#x662F; f(key1) = f(key2)</li>
<li>&#x5F88;&#x96BE;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x4E0D;&#x4EA7;&#x751F;&#x51B2;&#x7A81;&#x7684;&#x6563;&#x5217;&#x51FD;&#x6570;&#x3002;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EA;&#x80FD;&#x9009;&#x62E9;&#x6070;&#x5F53;&#x7684;&#x6563;&#x5217;&#x51FD;&#x6570;&#xFF0C;&#x662F;&#x51B2;&#x7A81;&#x5C3D;&#x53EF;&#x80FD;&#x5C11;&#x7684;&#x4EA7;&#x751F;&#x3002;</li>
</ul>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x6784;&#x9020;&#x8FD9;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x67E5;&#x627E;&#x8868;&#x65F6;&#xFF0C;&#x9664;&#x4E86;&#x9700;&#x8981;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x597D;(&#x5C3D;&#x53EF;&#x80FD;&#x5C11;&#x4EA7;&#x751F;&#x51B2;&#x7A81;)&#x7684;&#x6563;&#x5217;&#x51FD;&#x6570;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x4E00;&#x79CD;&#x89E3;&#x51B3;&#x51B2;&#x7A81;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<h2 id="&#x6563;&#x5217;&#x8868;&#x7684;&#x5B9A;&#x4E49;"><a href="#&#x6563;&#x5217;&#x8868;&#x7684;&#x5B9A;&#x4E49;" class="headerlink" title="&#x6563;&#x5217;&#x8868;&#x7684;&#x5B9A;&#x4E49;"></a>&#x6563;&#x5217;&#x8868;&#x7684;&#x5B9A;&#x4E49;</h2><p>&#x6839;&#x636E;&#x8BBE;&#x5B9A;&#x7684;&#x6563;&#x5217;&#x51FD;&#x6570; H(key) &#x548C;&#x6240;&#x9009;&#x4E2D;&#x7684;&#x5904;&#x7406;&#x51B2;&#x7A81;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5C06;&#x4E00;&#x7EC4;&#x5173;&#x952E;&#x5B57;&#x6620;&#x50CF;&#x5230;&#x4E00;&#x4E2A;&#x6709;&#x9650;&#x7684;&#x3001;&#x5730;&#x5740;&#x8FDE;&#x7EED;&#x7684;&#x5730;&#x5740;&#x96C6;&#x4E0A;&#xFF0C;&#x5E76;&#x4EE5;&#x5173;&#x952E;&#x5B57;&#x5728;&#x5730;&#x5740;&#x96C6;&#x4E2D;&#x7684;&#x201C;&#x50CF;&#x201D;&#x4F5C;&#x4E3A;&#x76F8;&#x5E94;&#x8BB0;&#x5F55;&#x5728;&#x8868;&#x4E2D;&#x7684;&#x5B58;&#x50A8;&#x4F4D;&#x7F6E;&#xFF0C;&#x5982;&#x6B64;&#x6784;&#x9020;&#x6240;&#x5F97;&#x7684;&#x67E5;&#x627E;&#x8868;&#x79F0;&#x4E4B;&#x4E3A;&#x201C;&#x6563;&#x5217;&#x8868;&#x201D;</p>
<h2 id="&#x6784;&#x9020;&#x6563;&#x5217;&#x51FD;&#x6570;&#x7684;&#x65B9;&#x6CD5;"><a href="#&#x6784;&#x9020;&#x6563;&#x5217;&#x51FD;&#x6570;&#x7684;&#x65B9;&#x6CD5;" class="headerlink" title="&#x6784;&#x9020;&#x6563;&#x5217;&#x51FD;&#x6570;&#x7684;&#x65B9;&#x6CD5;"></a>&#x6784;&#x9020;&#x6563;&#x5217;&#x51FD;&#x6570;&#x7684;&#x65B9;&#x6CD5;</h2><p>&#x5BF9;&#x6570;&#x5B57;&#x7684;&#x5173;&#x952E;&#x5B57;&#x53EF;&#x6709;&#x4EE5;&#x4E0B;&#x6784;&#x9020;&#x65B9;&#x6CD5;&#xFF1A;<br>&#x76F4;&#x63A5;&#x5B9A;&#x5740;&#x6CD5;&#x3001;&#x6570;&#x5B57;&#x5206;&#x6790;&#x6CD5;&#x3001;&#x5E73;&#x65B9;&#x53D6;&#x4E2D;&#x6CD5;&#x3001;&#x6298;&#x53E0;&#x6CD5;&#x3001;<strong>&#x9664;&#x7559;&#x4F59;&#x6570;&#x6CD5;</strong>&#x3001;&#x968F;&#x673A;&#x6570;&#x6CD5;</p>
<p>&#x82E5;&#x662F;&#x975E;&#x6570;&#x5B57;&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x5219;&#x9700;&#x5148;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x6570;&#x5B57;&#x5316;&#x5904;&#x7406;&#x3002;</p>
<p>1.&#x76F4;&#x63A5;&#x5B9A;&#x5740;&#x6CD5;&#xFF1A;&#x6563;&#x5217;&#x51FD;&#x6570;&#x4E3A;&#x5173;&#x952E;&#x5B57;&#x7684;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#xFF0C;&#x8BBE; H(key) = key &#x6216; H(key) = a * key + b<br>&#x6B64;&#x6CD5;&#x4EC5;&#x9002;&#x5408;&#x4E8E;&#xFF1A;&#x5730;&#x5740;&#x96C6;&#x5408;&#x7684;&#x5927;&#x5C0F;==&#x5173;&#x952E;&#x5B57;&#x96C6;&#x5408;&#x7684;&#x5927;&#x5C0F;</p>
<p>2.&#x6570;&#x5B57;&#x5206;&#x6790;&#x6CD5;&#xFF1A;&#x5047;&#x8BBE;&#x5173;&#x952E;&#x5B57;&#x96C6;&#x5408;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5173;&#x952E;&#x5B57;&#x90FD;&#x662F;&#x6709;s&#x4E3A;&#x6709;&#x6548;&#x6570;&#x5B57;&#x7EC4;&#x6210;(u1,u2,&#x2026;,us)&#xFF0C;&#x5206;&#x6790;&#x5173;&#x952E;&#x5B57;&#x96C6;&#x4E2D;&#x7684;&#x5168;&#x4F53;&#xFF0C;&#x5E76;&#x4ECE;&#x4E2D;&#x63D0;&#x53D6;&#x5206;&#x5E03;&#x5747;&#x5300;&#x7684;&#x82E5;&#x5E72;&#x4F4D;&#x6216;&#x4ED6;&#x4EEC;&#x7684;&#x7EC4;&#x5408;&#x4F5C;&#x4E3A;&#x5730;&#x5740;<br>&#x6B64;&#x6CD5;&#x4EC5;&#x9002;&#x5408;&#x4E8E;&#xFF1A;&#x80FD;&#x9884;&#x5148;&#x4F30;&#x8BA1;&#x51FA;&#x5168;&#x4F53;&#x5173;&#x952E;&#x5B57;&#x7684;&#x6BCF;&#x4E00;&#x4F4D;&#x4E0A;<br>&#x5404;&#x79CD;&#x6570;&#x5B57;&#x51FA;&#x73B0;&#x7684;&#x9891;&#x5EA6;</p>
<p>3.&#x5E73;&#x6CD5;&#x53D6;&#x4E2D;&#x6CD5;&#xFF1A;&#x4EE5;&#x5173;&#x952E;&#x5B57;&#x7684;&#x5E73;&#x65B9;&#x503C;&#x7684;&#x4E2D;&#x95F4;&#x51E0;&#x4F4D;&#x4F5C;&#x4E3A;&#x5B58;&#x50A8;&#x5730;&#x5740;&#x3002;&#x6C42;&#x5173;&#x952E;&#x5B57;&#x5E73;&#x65B9;&#x503C;&#x7684;&#x76EE;&#x7684;&#x662F;&#x6269;&#x5927;&#x5DEE;&#x522B;&#xFF0C;&#x540C;&#x65F6;&#x5E73;&#x65B9;&#x503C;&#x7684;&#x4E2D;&#x95F4;&#x5404;&#x4F4D;&#x53C8;&#x80FD;&#x53D7;&#x5230;&#x6574;&#x4E2A;&#x5173;&#x952E;&#x5B57;&#x4E2D;&#x5404;&#x4F4D;&#x7684;&#x5F71;&#x54CD;<br>&#x6B64;&#x65B9;&#x6CD5;&#x4EC5;&#x9002;&#x5408;&#x4E8E;&#xFF1A;&#x5173;&#x952E;&#x5B57;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4F4D;&#x90FD;&#x6709;&#x67D0;&#x4E9B;&#x6570;&#x5B57;&#x91CD;&#x590D;&#x51FA;&#x73B0;&#x9891;&#x5EA6;&#x5F88;&#x9AD8;&#x7684;&#x73B0;&#x8C61;</p>
<p>4.&#x6298;&#x53E0;&#x6CD5;&#xFF1A;&#x5C06;&#x5173;&#x952E;&#x5B57;&#x5206;&#x5272;&#x6210;&#x82E5;&#x5E72;&#x90E8;&#x5206;&#xFF0C;&#x7136;&#x540E;&#x53D6;&#x4ED6;&#x4EEC;&#x7684;&#x53E0;&#x52A0;&#x548C;&#x4E3A;&#x6563;&#x5217;&#x5730;&#x5740;&#x3002;&#x6709;&#x4E24;&#x79CD;&#x53E0;&#x52A0;&#x5904;&#x7406;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;<strong>&#x79FB;&#x4F4D;&#x53E0;&#x52A0;&#x548C;&#x95F4;&#x754C;&#x53E0;&#x52A0;</strong><br>&#x6B64;&#x65B9;&#x6CD5;&#x4EC5;&#x9002;&#x5408;&#x4E8E;&#xFF1A;&#x5173;&#x952E;&#x5B57;&#x7684;&#x6570;&#x5B57;&#x4F4D;&#x6570;&#x7279;&#x522B;&#x591A;</p>
<p>5.<strong>&#x9664;&#x7559;&#x4F59;&#x6570;&#x6CD5;</strong></p>
<p>&#x8BBE;&#x5B9A;&#x6563;&#x5217;&#x51FD;&#x6570;&#x4E3A; H(key) = key MOD p &#xFF0C;&#x5176;&#x4E2D; p &lt;= m (&#x8868;&#x957F;) &#x5E76;&#x4E14; p &#x5E94;&#x4E3A;&#x4E0D;&#x5927;&#x4E8E; m &#x7684;&#x6700;&#x5927;&#x7D20;&#x6570;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5BF9;p&#x52A0;&#x9650;&#x5236;&#xFF1F;<br>&#x51CF;&#x5C11;&#x51B2;&#x7A81;</p>
<p>6.&#x968F;&#x673A;&#x6570;&#x6CD5;&#xFF1A;&#x8BBE;&#x6563;&#x5217;&#x51FD;&#x6570;&#x4E3A; H(key) = Random(key) &#xFF0C;&#x5176;&#x4E2D; Random &#x4E3A;&#x4F2A;&#x968F;&#x673A;&#x51FD;&#x6570;<br>&#x901A;&#x5E38;&#x6B64;&#x65B9;&#x6CD5;&#x7528;&#x4E8E;&#x5BF9;&#x957F;&#x5EA6;&#x4E0D;&#x7B49;&#x7684;&#x5173;&#x952E;&#x5B57;&#x6784;&#x9020;&#x6563;&#x5217;&#x51FD;&#x6570;</p>
<p>&#x5B9E;&#x9645;&#x9020;&#x8868;&#x65F6;&#xFF0C;&#x91C7;&#x7528;&#x4F55;&#x79CD;&#x6784;&#x9020;&#x6563;&#x5217;&#x51FD;&#x6570;&#x7684;&#x65B9;&#x6CD5;&#x53D6;&#x51B3;&#x4E8E;&#x5EFA;&#x8868;&#x7684;&#x5173;&#x952E;&#x5B57;&#x96C6;&#x5408;&#x7684;&#x60C5;&#x51B5;&#xFF08;&#x5305;&#x62EC;&#x5173;&#x952E;&#x5B57;&#x7684;&#x8303;&#x56F4;&#x4E0E;&#x5F62;&#x6001;&#xFF09;&#xFF0C;&#x603B;&#x7684;&#x539F;&#x5219;&#x662F;&#x4F7F;&#x4EA7;&#x751F;&#x51B2;&#x7A81;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x964D;&#x5230;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x5C0F;</p>
<h2 id="&#x5904;&#x7406;&#x51B2;&#x7A81;&#x7684;&#x65B9;&#x6CD5;"><a href="#&#x5904;&#x7406;&#x51B2;&#x7A81;&#x7684;&#x65B9;&#x6CD5;" class="headerlink" title="&#x5904;&#x7406;&#x51B2;&#x7A81;&#x7684;&#x65B9;&#x6CD5;"></a>&#x5904;&#x7406;&#x51B2;&#x7A81;&#x7684;&#x65B9;&#x6CD5;</h2><p>&#x5904;&#x7406;&#x51B2;&#x7A81;&#x7684;<strong>&#x5B9E;&#x9645;&#x542B;&#x4E49;</strong>&#x662F;&#xFF1A;&#x4E3A;&#x4EA7;&#x751F;&#x51B2;&#x7A81;&#x7684;&#x5730;&#x5740;&#x5BFB;&#x627E;&#x4E0B;&#x4E00;&#x4E2A;&#x6563;&#x5217;&#x5730;&#x5740;</p>
<ul>
<li>&#x5F00;&#x653E;&#x5730;&#x5740;&#x6CD5;</li>
<li>&#x94FE;&#x5730;&#x5740;&#x6CD5;</li>
</ul>
<p>1.&#x5F00;&#x653E;&#x5B9A;&#x5740;&#x6CD5;&#xFF1A;&#x4E3A;&#x4EA7;&#x751F;&#x51B2;&#x7A81;&#x7684;&#x5730;&#x5740;H(key)&#x6C42;&#x5F97;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#x5E8F;&#x5217;&#xFF1A;H1,H2,&#x2026;,Hs (1&lt;=s&lt;=m-1) &#xFF0C;&#x5176;&#x4E2D; H0 = H(key) ,<br>Hi = (H(key) + di) MOD m , i = 1,2,&#x2026;,s</p>
<p>&#x5BF9;&#x589E;&#x91CF;di&#x6709;&#x4E09;&#x79CD;&#x53D6;&#x6CD5;&#xFF1A;<br>1&#xFF09;&#x7EBF;&#x6027;&#x63A2;&#x6D4B;&#x518D;&#x6563;&#x5217;&#xFF1A;di = c <em> i &#x6700;&#x7B80;&#x5355;&#x7684;&#x60C5;&#x51B5;&#xFF0C;c = 1<br>2&#xFF09;&#x5E73;&#x65B9;&#x6CD5;&#x63A2;&#x6D4B;&#x518D;&#x6563;&#x5217;&#xFF1A;di = 1^2, -1^2, 2^2, -2^2&#x2026;<br>3&#xFF09;&#x968F;&#x673A;&#x63A2;&#x6D4B;&#x518D;&#x6563;&#x5217;&#xFF1A;di&#x662F;&#x4E00;&#x7EC4;&#x4F2A;&#x968F;&#x673A;&#x6570;&#x5217;&#xFF0C;&#x6216;&#x8005; di = i </em> H2(key) (&#x53C8;&#x79F0;&#x53CC;&#x6563;&#x5217;&#x51FD;&#x6570;&#x63A2;&#x6D4B;)</p>
<p>eg&#xFF1A;<br>&#x5173;&#x952E;&#x5B57;&#x96C6;&#x5408;&#xFF1A;{19,01,23,14,55,68,11,82,36}<br>&#x8BBE;&#x6563;&#x5217;&#x51FD;&#x6570; H(key) = key MOD 11 (&#x8868;&#x957F;&#x4E3A;11)<br>&#x82E5;&#x91C7;&#x7528;&#x7EBF;&#x6027;&#x63A2;&#x6D4B;&#x518D;&#x6563;&#x5217;&#x5904;&#x7406;&#x51B2;&#x7A81;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div></pre></td><td class="code"><pre><div class="line">0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 </div><div class="line">55  01  23  14  68  11  82  36  19</div></pre></td></tr></table></figure> 
<p>2.&#x94FE;&#x5730;&#x5740;&#x6CD5;&#xFF1A;&#x5C06;&#x6240;&#x6709;&#x6563;&#x5217;&#x5730;&#x5740;&#x76F8;&#x540C;&#x7684;&#x8BB0;&#x5F55;&#x90FD;&#x8FDE;&#x63A5;&#x5728;&#x540C;&#x4E00;&#x94FE;&#x8868;&#x4E2D;</p>
<h2 id="&#x6563;&#x5217;&#x8868;&#x7684;&#x67E5;&#x627E;"><a href="#&#x6563;&#x5217;&#x8868;&#x7684;&#x67E5;&#x627E;" class="headerlink" title="&#x6563;&#x5217;&#x8868;&#x7684;&#x67E5;&#x627E;"></a>&#x6563;&#x5217;&#x8868;&#x7684;&#x67E5;&#x627E;</h2><p>&#x67E5;&#x627E;&#x8FC7;&#x7A0B;&#x4E0E;&#x5EFA;&#x8868;&#x8FC7;&#x7A0B;&#x4E00;&#x81F4;&#x3002;&#x5047;&#x8BBE;&#x91C7;&#x7528;&#x5F00;&#x653E;&#x5B9A;&#x5740;&#x6CD5;&#x5904;&#x7406;&#x51B2;&#x7A81;&#xFF0C;&#x5219;&#x67E5;&#x627E;&#x8FC7;&#x7A0B;&#x4E3A;&#xFF1A;</p>
<p>&#x5BF9;&#x4E8E;&#x7ED9;&#x5B9A;&#x503C;K&#xFF0C;&#x8BA1;&#x7B97;&#x6563;&#x5217;&#x5730;&#x5740; i = H(k)<br>&#x82E5; r[i] = NULL &#xFF0C;&#x5219;&#x67E5;&#x627E;&#x4E0D;&#x6210;&#x529F;<br>&#x82E5; r[i].key = K &#xFF0C;&#x5219;&#x67E5;&#x627E;&#x6210;&#x529F;<br>&#x5426;&#x5219;&#x6C42;&#x4E0B;&#x4E00;&#x5730;&#x5740; Hi &#xFF0C;&#x76F4;&#x81F3;<br> r[Hi] = NULL &#xFF08;&#x67E5;&#x627E;&#x4E0D;&#x6210;&#x529F;&#xFF09;<br>&#x6216; r[Hi] = K &#xFF08;&#x67E5;&#x627E;&#x6210;&#x529F;&#xFF09;&#x4E3A;&#x6B62;</p>
<p>&#x6563;&#x5217;&#x8868;&#x67E5;&#x627E;&#x7684;&#x5206;&#x6790;&#xFF1A;</p>
<p>&#x4ECE;&#x67E5;&#x627E;&#x8FC7;&#x7A0B;&#x5F97;&#x77E5;&#xFF0C;&#x6563;&#x5217;&#x8868;&#x67E5;&#x627E;&#x8FC7;&#x7A0B;&#x7684;&#x5E73;&#x5747;&#x957F;&#x5EA6;&#x5B9E;&#x9645;&#x4E0A;&#x5E76;&#x4E0D;&#x4E3A;0</p>
<p>&#x7EDD;&#x5BF9;&#x6563;&#x5217;&#x8868;ASL&#x7684;<strong>&#x56E0;&#x7D20;</strong>&#xFF1A;</p>
<ul>
<li>&#x9009;&#x7528;&#x7684;&#x6563;&#x5217;&#x51FD;&#x6570;</li>
<li>&#x9009;&#x7528;&#x7684;&#x5904;&#x7406;&#x51B2;&#x7A81;&#x7684;&#x65B9;&#x6CD5;</li>
<li>&#x6563;&#x5217;&#x8868;&#x7684;&#x9971;&#x548C;&#x7A0B;&#x5EA6;&#xFF0C;&#x88C5;&#x8F7D;&#x56E0;&#x5B50; &#x3B1; = n/m &#x503C;&#x5F97;&#x5927;&#x5C0F;&#xFF08;n&#x4E3A;&#x8BB0;&#x5F55;&#x6570;&#xFF0C;m&#x4E3A;&#x8868;&#x7684;&#x957F;&#x5EA6;&#xFF09;</li>
</ul>
<p>&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x9009;&#x7528;&#x7684;&#x6563;&#x5217;&#x51FD;&#x6570;&#x662F;&#x5747;&#x5300;&#x7684;&#xFF0C;&#x5219;&#x5728;&#x8BA8;&#x8BBA;ASl&#x65F6;&#x53EF;&#x4EE5;&#x4E0D;&#x8003;&#x8651;&#x5176;&#x4ED6;&#x56E0;&#x7D20;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;<strong>&#x6563;&#x5217;&#x8868;&#x7684;ASL&#x662F;&#x5904;&#x7406;&#x51B2;&#x7A81;&#x65B9;&#x6CD5;&#x548C;&#x88C5;&#x8F7D;&#x56E0;&#x5B50;&#x7684;&#x51FD;&#x6570;</strong></p>
<p>&#x53EF;&#x4EE5;&#x8BC1;&#x660E;&#xFF0C;&#x67E5;&#x627E;&#x6210;&#x529F;&#x65F6;&#x53EF;&#x4EE5;&#x6709;&#x4E00;&#x4E0B;&#x7ED3;&#x679C;&#xFF08;&#x8BC1;&#x660E;&#x8FC7;&#x7A0B;&#x53C2;&#x89C1;&#x7B97;&#x6CD5;&#x5BFC;&#x8BBA;&#xFF09;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div></pre></td><td class="code"><pre><div class="line">&#x7EBF;&#x6027;&#x63A2;&#x6D4B;&#x518D;&#x6563;&#x5217;&#xFF1A; Snl = 1/2 * (1+1/(1-&#x3B1;))</div><div class="line">&#x968F;&#x673A;&#x63A2;&#x6D4B;&#x518D;&#x6563;&#x5217;&#xFF1A; Snr = -1/&#x3B1; * ln(1-&#x3B1;)</div><div class="line">&#x94FE;&#x5730;&#x5740;&#x6CD5;&#xFF1A; Snc = 1 + 2/&#x3B1;</div></pre></td></tr></table></figure>
<p>&#x4ECE;&#x4EE5;&#x4E0A;&#x7ED3;&#x679C;&#x53EF;&#x89C1;&#xFF0C;&#x6563;&#x5217;&#x8868;&#x7684;&#x5E73;&#x5747;&#x67E5;&#x627E;&#x957F;&#x5EA6;&#x662F; &#x3B1; &#x7684;&#x51FD;&#x6570;&#xFF0C;&#x800C;&#x4E0D;&#x662F; n &#x7684;&#x51FD;&#x6570;&#x3002;&#x8FD9;&#x8BF4;&#x660E;&#xFF0C;&#x7528;&#x6563;&#x5217;&#x8868;&#x6784;&#x9020;&#x67E5;&#x627E;&#x8868;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x9002;&#x5F53;&#x7684;&#x88C5;&#x586B;&#x56E0;&#x5B50; &#x3B1; &#x4F7F;&#x5F97;ASL&#x9650;&#x5B9A;&#x5728;&#x67D0;&#x4E2A;&#x8303;&#x56F4;&#x5185;&#x3002;</p>
<p><strong>&#x8FD9;&#x5C31;&#x662F;&#x6240;&#x6709;&#x6563;&#x5217;&#x8868;&#x7684;&#x7279;&#x70B9;</strong></p>
<h2 id="&#x6563;&#x5217;&#x8868;&#x7684;&#x5220;&#x9664;&#x64CD;&#x4F5C;"><a href="#&#x6563;&#x5217;&#x8868;&#x7684;&#x5220;&#x9664;&#x64CD;&#x4F5C;" class="headerlink" title="&#x6563;&#x5217;&#x8868;&#x7684;&#x5220;&#x9664;&#x64CD;&#x4F5C;"></a>&#x6563;&#x5217;&#x8868;&#x7684;&#x5220;&#x9664;&#x64CD;&#x4F5C;</h2><p>&#x4ECE;&#x6563;&#x5217;&#x8868;&#x4E2D;&#x5220;&#x9664;&#x8BB0;&#x5F55;&#x65F6;&#xFF0C;&#x8981;&#x505A;&#x7279;&#x6B8A;&#x5904;&#x7406;&#xFF0C;&#x76F8;&#x5E94;&#x7684;&#xFF0C;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x67E5;&#x627E;&#x7684;&#x7B97;&#x6CD5;</p>
<h2 id="&#x6563;&#x5217;&#x8868;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x6784;&#x9020;&#x9759;&#x6001;&#x67E5;&#x627E;&#x8868;"><a href="#&#x6563;&#x5217;&#x8868;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x6784;&#x9020;&#x9759;&#x6001;&#x67E5;&#x627E;&#x8868;" class="headerlink" title="&#x6563;&#x5217;&#x8868;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x6784;&#x9020;&#x9759;&#x6001;&#x67E5;&#x627E;&#x8868;"></a>&#x6563;&#x5217;&#x8868;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x6784;&#x9020;&#x9759;&#x6001;&#x67E5;&#x627E;&#x8868;</h2><p>&#x5E76;&#x4E14;&#xFF0C;&#x5BF9;&#x9759;&#x6001;&#x67E5;&#x627E;&#x8868;&#xFF0C;&#x6709;&#x65F6;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x4E0D;&#x53D1;&#x751F;&#x51B2;&#x7A81;&#x7684;&#x6563;&#x5217;&#x51FD;&#x6570;&#x3002;&#x5373;&#x6B64;&#x65F6;&#x7684;&#x6563;&#x5217;&#x8868;&#x7684;ASL=0&#xFF0C;&#x79F0;&#x6B64;&#x7C7B;&#x6563;&#x5217;&#x51FD;&#x6570;&#x4E3A;&#x7406;&#x60F3;&#x7684;&#x6563;&#x5217;&#x51FD;&#x6570;</p>

      
    </div><!-- .entry-content -->

    <footer class="entry-meta">
    <a href="/2016/11/17/散列表/">
    <time datetime="2016-11-17T02:19:01.000Z" class="entry-date">
        2016-11-17
    </time>
</a>
    
  <span class="article-delim">&#8226;</span>
  <div class="article-category">
  <a class="article-category-link" href="/categories/编程/">编程</a>
  </div>

    
  <span class="article-delim">&#8226;</span>
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/数据结构/">数据结构</a></li></ul>

    </footer>
</article>


    
<nav class="nav-single">
    <h3 class="assistive-text">文章导航</h3>
    
        <span class="nav-previous"><a href="/2016/11/17/串的模式匹配问题/" rel="prev"><span class="meta-nav">←</span> 串的模式匹配问题</a></span>
    
    
        <span class="nav-next"><a href="/2016/11/16/从零开始学习Linux-10/" rel="next">从零开始学习Linux-10(正则表达式) <span class="meta-nav">→</span></a></span>
    
</nav><!-- .nav-single -->







</div></div>
        <div id="secondary" class="widget-area" role="complementary">
  
    <aside id="search" class="widget widget_search"><form role="search" method="get" accept-charset="utf-8" id="searchform" class="searchform" action="//google.com/search">
    <div>
        <input type="text" value="" name="s" id="s" />
        <input type="submit" id="searchsubmit" value="搜索" />
    </div>
</form></aside>
  
    
  
    
  <aside class="widget">
    <h3 class="widget-title">Categories</h3>
    <div class="widget-content">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/LIFE/">LIFE</a><span class="category-list-count">3</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/MAC/">MAC</a><span class="category-list-count">3</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/iOS/">iOS</a><span class="category-list-count">20</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/御宅文化/">御宅文化</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/编程/">编程</a><span class="category-list-count">51</span></li></ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Recents</h3>
    <div class="widget-content">
      <ul>
        
          <li>
            <a href="/2016/11/18/从零开始学习Linux-13/">从零开始学习Linux-13</a>
          </li>
        
          <li>
            <a href="/2016/11/18/从零开始学习Linux-12/">从零开始学习Linux-12</a>
          </li>
        
          <li>
            <a href="/2016/11/18/cmatrix的安装/">cmatrix的安装</a>
          </li>
        
          <li>
            <a href="/2016/11/18/从零开始学习Linux-11/">从零开始学习Linux-11</a>
          </li>
        
          <li>
            <a href="/2016/11/17/串的模式匹配问题/">串的模式匹配问题</a>
          </li>
        
      </ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Tags</h3>
    <div class="widget-content">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/Cocoapods/">Cocoapods</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/HTML/">HTML</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Linux/">Linux</a><span class="tag-list-count">15</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Matlab/">Matlab</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIColor/">UIColor</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView/">UIView</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView-圆角/">UIView-圆角</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/bug/">bug</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/hexo/">hexo</a><span class="tag-list-count">4</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/指针/">指针</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/数据结构/">数据结构</a><span class="tag-list-count">20</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/算法/">算法</a><span class="tag-list-count">8</span></li></ul>
    </div>
  </aside>

  
    
<div class="widget tag">
<h3 class="title">blogroll</h3>
<ul class="entry">


<li><a href="https://github.com/" target="_blank">github</a></li>


<li><a href="http://www.jianshu.com/users/41cd7711ed44/latest_articles" target="_blank">我的简书主页</a></li>

</ul>
</div>

  
</div>
      </div>
      <footer id="colophon" role="contentinfo">
    <p>&copy; 2016 SaberDa
    All rights reserved.</p>
    <p>Powered by <a href="http://hexo.io/" target="_blank">Hexo</a></p>
</footer>
    <script>window._bd_share_config={"common":{"bdSnsKey":{},"bdText":"","bdMini":"1","bdMiniList":false,"bdPic":"","bdStyle":"2","bdSize":"16"},"share":{}};with(document)0[(getElementsByTagName('head')[0]||body).appendChild(createElement('script')).src='http://bdimg.share.baidu.com/static/api/js/share.js?v=89860593.js?cdnversion='+~(-new Date()/36e5)];</script>

<script src="/js/jquery-2.0.3.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

<script src="/js/navigation.js"></script>

<div id="bg"></div>

  </div>
</body>
</html>