<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  
  <meta name="description" content="阿尔托利亚是我老婆~" />
  

  
  
  
  
  
  
  <title>代码签名探析 | SaberDa的幻想乡</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;quot;&amp;#x7528;&amp;#x6237;&amp;#x4F1A;&amp;#x611F;&amp;#x6FC0;&amp;#x4EE3;&amp;#x7801;&amp;#x7B7E;&amp;#x540D;&amp;#x5E26;&amp;#x6765;&amp;#x7684;&amp;#x597D;&amp;#x5904;&amp;quot; &amp;#x2013; Apple Developer Library
&amp;#x5728; iOS &amp;#x6216; macOS &amp;#x5E73;&amp;#x53F">
<meta property="og:type" content="article">
<meta property="og:title" content="代码签名探析">
<meta property="og:url" content="https://saberda.github.io/2016/11/06/代码签名探析/index.html">
<meta property="og:site_name" content="SaberDa的幻想乡">
<meta property="og:description" content="&amp;quot;&amp;#x7528;&amp;#x6237;&amp;#x4F1A;&amp;#x611F;&amp;#x6FC0;&amp;#x4EE3;&amp;#x7801;&amp;#x7B7E;&amp;#x540D;&amp;#x5E26;&amp;#x6765;&amp;#x7684;&amp;#x597D;&amp;#x5904;&amp;quot; &amp;#x2013; Apple Developer Library
&amp;#x5728; iOS &amp;#x6216; macOS &amp;#x5E73;&amp;#x53F">
<meta property="og:image" content="https://saberda.github.io/2016/11/06/代码签名探析/1.png">
<meta property="og:image" content="https://saberda.github.io/2016/11/06/代码签名探析/2.png">
<meta property="og:image" content="https://saberda.github.io/2016/11/06/代码签名探析/3.png">
<meta property="og:image" content="https://saberda.github.io/2016/11/06/代码签名探析/4.png">
<meta property="og:updated_time" content="2016-11-06T04:00:01.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="代码签名探析">
<meta name="twitter:description" content="&amp;quot;&amp;#x7528;&amp;#x6237;&amp;#x4F1A;&amp;#x611F;&amp;#x6FC0;&amp;#x4EE3;&amp;#x7801;&amp;#x7B7E;&amp;#x540D;&amp;#x5E26;&amp;#x6765;&amp;#x7684;&amp;#x597D;&amp;#x5904;&amp;quot; &amp;#x2013; Apple Developer Library
&amp;#x5728; iOS &amp;#x6216; macOS &amp;#x5E73;&amp;#x53F">
<meta name="twitter:image" content="https://saberda.github.io/2016/11/06/代码签名探析/1.png">
  
  
    <link rel="icon" href="/css/images/favicon.ico">
  
  <link rel="stylesheet" href="/css/style.css">
  

  
  <!-- baidu webmaster push -->
  <script src='//push.zhanzhang.baidu.com/push.js'></script>
</head>
<body class="home blog custom-background custom-font-enabled single-author">
  <div id="page" class="hfeed site">
      <header id="masthead" class="site-header" role="banner">
    <hgroup>
      <h1 class="site-title">
        <a href="/" title="SaberDa的幻想乡" rel="home">SaberDa的幻想乡</a>
      </h1>
      
        <h2 class="site-description">
          <a href="/" id="subtitle">　　iOS　　|　　二次元　　|　　630991493@qq.com　　|　　害怕输 就不会给自己输的机会</a>
        </h2>
      
    </hgroup>

    <nav id="site-navigation" class="main-navigation" role="navigation">
            <button class="menu-toggle">菜单</button>
            <a class="assistive-text" href="/#content" title="跳至内容">跳至内容</a><!--TODO-->
            <div class="menu-main-container">
                <ul id="menu-main" class="nav-menu">
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/archives">所有文章</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/">主页</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/编程/">编程</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/iOS/">iOS</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/MAC/">MAC</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/御宅文化/">御宅文化</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/LIFE/">LIFE</a></li>
                
                </ul>
            </div>
    </nav>
</header>
      <div id="main" class="wrapper">
        <div id="primary" class="site-content"><div id="content" role="main"><article id="post-代码签名探析" class="post-代码签名探析 post type-post status-publish format-standard hentry">
    <!---->

      <header class="entry-header">
        
        
  
    <h1 class="entry-title article-title">
      代码签名探析
    </h1>
  

        
        <div class="comments-link">
            
            <a href="javascript:void(0);" data-url="https://saberda.github.io/2016/11/06/代码签名探析/" data-id="civnz5czc0038pvb3xw75glew" class="leave-reply bdsharebuttonbox" data-cmd="more">Share</a>
        </div><!-- .comments-link -->
      </header><!-- .entry-header -->

    <div class="entry-content">
      
        <pre><code>&quot;&#x7528;&#x6237;&#x4F1A;&#x611F;&#x6FC0;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x5E26;&#x6765;&#x7684;&#x597D;&#x5904;&quot; &#x2013; Apple Developer Library
</code></pre><p>&#x5728; iOS &#x6216; macOS &#x5E73;&#x53F0;&#x4E0A;&#x8FDB;&#x884C;&#x5E94;&#x7528;&#x5F00;&#x53D1;&#x65F6;&#xFF0C;&#x4F60;&#x6240;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7684; API &#x5927;&#x591A;&#x8BBE;&#x8BA1;&#x5F97;&#x7B80;&#x6D01;&#x660E;&#x4E86;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x8F7B;&#x6613;&#x5730;&#x5B9E;&#x73B0;&#x9177;&#x70AB;&#x7684;&#x52A8;&#x753B;&#x6548;&#x679C;&#xFF0C;&#x4FBF;&#x6377;&#x5730;&#x8FDB;&#x884C;&#x5E94;&#x7528;&#x53D1;&#x5E03;&#x524D;&#x6D4B;&#x8BD5;&#xFF0C;&#x6216;&#x662F;&#x7528; Core Data &#x5C06;&#x6570;&#x636E;&#x5B89;&#x5168;&#x7684;&#x5B58;&#x50A8;&#x5728;&#x672C;&#x5730;&#x3002;&#x4F46;&#x662F;&#x603B;&#x6709;&#x4E00;&#x5929;&#xFF0C;&#x4F60;&#x4F1A;&#x78B0;&#x4E0A;&#x4EE3;&#x7801;&#x7B7E;&#x540D; (code signing) &#x548C;&#x914D;&#x7F6E;&#x6587;&#x4EF6; (provisioning)&#xFF0C;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x4F1A;&#x662F;&#x4F60;&#x5728;&#x5FC3;&#x91CC;&#x95EE;&#x5019;&#x67D0;&#x4E9B;&#x4EBA;&#x7956;&#x5B97;&#x7684;&#x5F00;&#x59CB;&#x3002;</p>
<a id="more"></a>
<p>&#x5982;&#x679C;&#x4F60;&#x5DF2;&#x7ECF;&#x5728; iOS &#x4E0A;&#x5F00;&#x53D1;&#x8FC7;&#x5E94;&#x7528;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x591A;&#x534A;&#x5DF2;&#x7ECF;&#x4E0E;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x6216;&#x8BBE;&#x5907;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x6253;&#x8FC7;&#x4EA4;&#x9053;&#x4E86;&#x3002;&#x5373;&#x4F7F;&#x662F; macOS &#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x53D1;&#x5E03;&#x81EA;&#x5DF1;&#x7684;&#x5E94;&#x7528;&#x5230; Mac App Store &#x4E0A;&#x53BB;&#x6216;&#x8005;&#x60F3;&#x53C2;&#x4E0E;&#x82F9;&#x679C;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x9879;&#x76EE;&#xFF0C;&#x90A3;&#x4E48;&#x4E5F;&#x4E0D;&#x5F97;&#x4E0D;&#x5F00;&#x59CB;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x7B7E;&#x540D;&#x3002;</p>
<p>&#x5927;&#x591A;&#x6570;&#x65F6;&#x5019;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x770B;&#x4E0A;&#x53BB;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x96BE;&#x4EE5;&#x7406;&#x89E3;&#x7684;&#x795E;&#x79D8;&#x9ED1;&#x76D2;&#x3002;&#x5728;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x91CC;&#x6211;&#x4F1A;&#x5C3D;&#x53EF;&#x80FD;&#x63ED;&#x793A;&#x76D2;&#x5B50;&#x5185;&#x90E8;&#x7684;&#x8FD0;&#x4F5C;&#x673A;&#x7406;&#x3002;</p>
<p>&#x901A;&#x5E38;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x76F4;&#x63A5;&#x770B;&#x5230;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x7684;&#x8FD0;&#x4F5C;&#x8FC7;&#x7A0B;&#xFF0C;&#x5B83;&#x4EEC;&#x9690;&#x85CF;&#x5728; iOS &#x7CFB;&#x7EDF;&#x5185;&#x90E8;&#x548C; SDK &#x4E4B;&#x4E2D;&#x3002;&#x4F46;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x89C2;&#x5BDF;&#x8BBE;&#x7F6E;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x6240;&#x9700;&#x5DE5;&#x5177;&#x7684;&#x8FD0;&#x4F5C;&#x65B9;&#x5F0F;&#xFF0C;&#x6765;&#x627E;&#x51FA;&#x4E00;&#x4E9B;&#x7EBF;&#x7D22;&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x53EF;&#x4EE5;&#x53C2;&#x8003; macOS &#x4E0A;&#x7684;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x8FD0;&#x4F5C;&#x65B9;&#x5F0F;&#xFF0C;&#x6BD5;&#x7ADF; iOS &#x548C; macOS &#x7CFB;&#x51FA;&#x540C;&#x6E90;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4ECE;&#x4ED6;&#x4EEC;&#x7684;&#x5BF9;&#x6BD4;&#x4E4B;&#x4E2D;&#x5F97;&#x5230;&#x5F88;&#x591A;&#x6709;&#x7528;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<p>macOS &#x4E0A;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x6280;&#x672F;&#x548C;&#x76F8;&#x5E94;&#x7684; API &#x662F;&#x5728; Mac OS X Leopard 10.5 &#x4E0A;&#x9996;&#x6B21;&#x51FA;&#x73B0;&#x7684;&#xFF0C;&#x8FD9;&#x521A;&#x597D;&#x662F;&#x7B2C;&#x4E00;&#x53F0; iPhone &#x53D1;&#x5E03;&#x7684;&#x65F6;&#x5019;&#x3002;&#x8FD9;&#x5E76;&#x975E;&#x5DE7;&#x5408;&#xFF0C;&#x56E0;&#x4E3A;&#x5728; iOS &#x4E0A;&#xFF0C;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x8D77;&#x5230;&#x7684;&#x4F5C;&#x7528;&#x66F4;&#x52A0;&#x91CD;&#x8981;&#x3002;iPhone &#x662F;&#x5728;&#x4F17;&#x591A;&#x6E38;&#x620F;&#x4E3B;&#x673A;&#x4E4B;&#x540E;&#x7B2C;&#x4E00;&#x4E2A;&#x5927;&#x89C4;&#x6A21;&#x51FA;&#x552E;&#x5E76;&#x4E14;&#x4ECE;&#x5934;&#x5C31;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x7684;&#x8BA1;&#x7B97;&#x5E73;&#x53F0;&#x3002;&#x53EA;&#x6709;&#x5728;&#x8D8A;&#x72F1;&#x4E4B;&#x540E;&#xFF0C;iOS &#x624D;&#x80FD;&#x8FD0;&#x884C;&#x6CA1;&#x6709;&#x7B7E;&#x540D;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x8D8A;&#x72F1;&#x4F7F;&#x5E94;&#x7528;&#x53EF;&#x4EE5;&#x7ED5;&#x8FC7;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x548C;&#x6C99;&#x76D2;&#x5B89;&#x5168;&#x673A;&#x5236;&#x7684;&#x5168;&#x90E8;&#x9650;&#x5236;&#xFF0C;&#x8FD9;&#x4F1A;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5371;&#x9669;&#x7684;&#x884C;&#x4E3A;&#x3002;</p>
<h2 id="&#x8BC1;&#x4E66;&#x548C;&#x5BC6;&#x5319;"><a href="#&#x8BC1;&#x4E66;&#x548C;&#x5BC6;&#x5319;" class="headerlink" title="&#x8BC1;&#x4E66;&#x548C;&#x5BC6;&#x5319;"></a>&#x8BC1;&#x4E66;&#x548C;&#x5BC6;&#x5319;</h2><p>&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A; iOS &#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x5728;&#x4F60;&#x5F00;&#x53D1;&#x4F7F;&#x7528;&#x7684;&#x673A;&#x5668;&#x4E0A;&#x5E94;&#x8BE5;&#x5DF2;&#x7ECF;&#x6709;&#x4E00;&#x4E2A;&#x8BC1;&#x4E66;&#xFF0C;&#x4E00;&#x4E2A;&#x516C;&#x94A5;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x4E2A;&#x79C1;&#x94A5;&#x3002;&#x8FD9;&#x4E9B;&#x662F;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x673A;&#x5236;&#x7684;&#x6838;&#x5FC3;&#x3002;&#x50CF; SSL &#x4E00;&#x6837;&#xFF0C;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x4E5F;&#x4F9D;&#x8D56;&#x4E8E;&#x91C7;&#x7528; X.509 &#x6807;&#x51C6;&#x7684;&#x516C;&#x5F00;&#x5BC6;&#x94A5;&#x52A0;&#x5BC6;&#x3002;</p>
<p>&#x5728; macOS &#x4E0A;&#xFF0C;X.509 &#x7684;&#x57FA;&#x672C;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF08;&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;&#x4F8B;&#x5982;&#x8BC1;&#x4E66;&#x7B49;&#xFF09;&#x90FD;&#x662F;&#x7531;&#x4E00;&#x4E2A;&#x53EB;&#x94A5;&#x5319;&#x4E32;&#x8BBF;&#x95EE;&#x7684;&#x5DE5;&#x5177;&#x6765;&#x8FDB;&#x884C;&#x7BA1;&#x7406;&#x3002;&#x6253;&#x5F00;&#x4F60;&#x5F00;&#x53D1;&#x673A;&#x5668;&#x4E0A;&#x7684;&#x94A5;&#x5319;&#x4E32;&#x8BBF;&#x95EE;&#x5E94;&#x7528;&#xFF0C;&#x9009;&#x62E9;&#x7C7B;&#x522B;&#x9009;&#x9879;&#x4E0B;&#x7684;&#x201C;&#x6211;&#x7684;&#x8BC1;&#x4E66;&#xFF08;My Certificates&#xFF09;&#x201D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6240;&#x6709;&#x4F60;&#x6301;&#x6709;&#x7684;&#x79C1;&#x94A5;&#x76F8;&#x5BF9;&#x5E94;&#x7684;&#x8BC1;&#x4E66;&#x3002;&#x8981;&#x7528;&#x4E00;&#x4E2A;&#x8BC1;&#x4E66;&#x8BBE;&#x7F6E;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x62E5;&#x6709;&#x79C1;&#x94A5;&#xFF0C;&#x6240;&#x4EE5;&#x6240;&#x6709;&#x4F60;&#x62E5;&#x6709;&#x79C1;&#x94A5;&#x7684;&#x8BC1;&#x4E66;&#x90FD;&#x4F1A;&#x88AB;&#x5217;&#x5728;&#x8FD9;&#x91CC;&#x3002;&#x5982;&#x679C;&#x4F60;&#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x8BC1;&#x4E66;&#x7684;&#x79C1;&#x94A5;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C55;&#x5F00;&#x8BC1;&#x4E66;&#x5E76;&#x5C06;&#x5B83;&#x7684;&#x79C1;&#x94A5;&#x663E;&#x793A;&#x51FA;&#x6765;&#xFF1A;</p>
<p><img src="/2016/11/06/&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x63A2;&#x6790;/1.png" alt=""></p>
<p>&#x5982;&#x679C;&#x4F60;&#x8981;&#x5BFC;&#x51FA;&#x8BC1;&#x4E66;&#xFF0C;&#x4F8B;&#x5982;&#x4E3A;&#x4E86;&#x5907;&#x4EFD;&#xFF08;&#x5F3A;&#x70C8;&#x5EFA;&#x8BAE;&#x8FDB;&#x884C;&#xFF09;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x8BB0;&#x5F97;&#x5C55;&#x5F00;&#x8BC1;&#x4E66;&#x90A3;&#x4E00;&#x6761;&#x663E;&#x793A;&#x51FA;&#x79C1;&#x94A5;&#x5E76;&#x5C06;&#x4E24;&#x884C;&#x90FD;&#x9009;&#x4E2D;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x5FEB;&#x901F;&#x5730;&#x663E;&#x793A;&#x51FA;&#x4F60;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#x80FD;&#x7528;&#x6765;&#x5BF9;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x7B7E;&#x540D;&#x7684;&#x8BA4;&#x8BC1;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x5229;&#x7528;&#x7528;&#x9014;&#x5E7F;&#x6CDB;&#x7684;&#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177; security</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div></pre></td><td class="code"><pre><div class="line">security find-identity -v -p codesigning                       </div><div class="line"> 1) 01C8E9712E9632E6D84EC533827B4478938A3B15 &quot;iPhone Developer: Thomas Kollbach (7TPNXN7G6K)&quot;</div></pre></td></tr></table></figure>
<p>&#x6982;&#x62EC;&#x7684;&#x8BB2;&#xFF0C;&#x4E00;&#x4E2A;&#x8BC1;&#x4E66;&#x662F;&#x4E00;&#x4E2A;&#x516C;&#x94A5;&#x52A0;&#x4E0A;&#x8BB8;&#x591A;&#x9644;&#x52A0;&#x4FE1;&#x606F;&#xFF0C;&#x8FD9;&#x4E9B;&#x9644;&#x52A0;&#x4FE1;&#x606F;&#x90FD;&#x662F;&#x88AB;&#x67D0;&#x4E2A;&#x8BA4;&#x8BC1;&#x673A;&#x6784;&#xFF08;Certificate Authority &#x7B80;&#x79F0; CA&#xFF09;&#x8FDB;&#x884C;&#x7B7E;&#x540D;&#x8BA4;&#x8BC1;&#x8FC7;&#x7684;&#xFF0C;&#x8BA4;&#x8BC1;&#x8FD9;&#x4E2A;&#x8BC1;&#x4E66;&#x4E2D;&#x7684;&#x4FE1;&#x606F;&#x662F;&#x51C6;&#x786E;&#x65E0;&#x8BEF;&#x7684;&#x3002;&#x5BF9;&#x4E8E; iOS &#x5F00;&#x53D1;&#x6765;&#x8BF4;&#x8FD9;&#x4E2A;&#x8BA4;&#x8BC1;&#x673A;&#x6784;&#x5C31;&#x662F;&#x82F9;&#x679C;&#x7684;&#x8BA4;&#x8BC1;&#x90E8;&#x95E8; Apple Worldwide Developer Relations CA&#x3002;&#x8BA4;&#x8BC1;&#x7684;&#x7B7E;&#x540D;&#x6709;&#x56FA;&#x5B9A;&#x7684;&#x6709;&#x6548;&#x671F;&#xFF0C;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#x5F53;&#x524D;&#x7CFB;&#x7EDF;&#x65F6;&#x95F4;&#x9700;&#x8981;&#x88AB;&#x6B63;&#x786E;&#x8BBE;&#x7F6E;&#xFF0C;&#x56E0;&#x4E3A;&#x8BC1;&#x4E66;&#x662F;&#x57FA;&#x4E8E;&#x5F53;&#x524D;&#x65F6;&#x95F4;&#x8FDB;&#x884C;&#x6838;&#x5BF9;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x5C06;&#x7CFB;&#x7EDF;&#x65F6;&#x95F4;&#x8BBE;&#x5B9A;&#x5230;&#x8FC7;&#x53BB;&#x4F1A;&#x5BF9; iOS &#x9020;&#x6210;&#x591A;&#x65B9;&#x9762;&#x7834;&#x574F;&#x7684;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#x3002;</p>
<p><img src="/2016/11/06/&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x63A2;&#x6790;/2.png" alt=""></p>
<p>&#x5BF9;&#x4E8E; iOS &#x5F00;&#x53D1;&#x6765;&#x8BF4;&#xFF0C;&#x4E00;&#x822C;&#x4F1A;&#x6709;&#x4E24;&#x4E2A;&#x8BC1;&#x4E66;&#xFF1A;&#x4E00;&#x4E2A;&#x5E26;&#x6709;&#x524D;&#x7F00; iPhone Developer&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x5E26;&#x6709;&#x524D;&#x7F00; iPhone Distribution&#x3002;&#x524D;&#x8005;&#x7528;&#x4E8E;&#x4F7F;&#x5E94;&#x7528;&#x53EF;&#x4EE5;&#x5728;&#x4F60;&#x7684;&#x6D4B;&#x8BD5;&#x8BBE;&#x5907;&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x540E;&#x8005;&#x662F;&#x5728;&#x63D0;&#x4EA4;&#x5E94;&#x7528;&#x5230; APP store &#x65F6;&#x7528;&#x5230;&#x3002;&#x4E00;&#x4E2A;&#x8BC1;&#x4E66;&#x7684;&#x7528;&#x9014;&#x53D6;&#x51B3;&#x4E8E;&#x5B83;&#x6240;&#x5305;&#x542B;&#x7684;&#x5185;&#x90E8;&#x4FE1;&#x606F;&#xFF0C;&#x5728;&#x94A5;&#x5319;&#x4E32;&#x8BBF;&#x95EE;&#x4E2D;&#x53CC;&#x51FB;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x8BC1;&#x4E66;&#x6587;&#x4EF6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x8BB8;&#x591A;&#x8BE6;&#x7EC6;&#x6761;&#x76EE;&#xFF0C;&#x62D6;&#x52A8;&#x5230;&#x6700;&#x4E0B;&#x9762;&#x6709;&#x4E00;&#x6761;&#x6807;&#x8BB0;&#x7740; Apple Developer Certificate (Submission)&#xFF0C; &#x6216;&#x8005; Apple Developer Certificate (Development)&#xFF0C;&#x5177;&#x4F53;&#x4F60;&#x4F1A;&#x770B;&#x5230;&#x54EA;&#x4E00;&#x79CD;&#xFF0C;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x6240;&#x6253;&#x5F00;&#x7684;&#x8BC1;&#x4E66;&#x662F;&#x54EA;&#x4E00;&#x79CD;&#x7C7B;&#x578B;&#xFF0C;iOS &#x7CFB;&#x7EDF;&#x4F1A;&#x5229;&#x7528;&#x8FD9;&#x4E2A;&#x4FE1;&#x606F;&#x6765;&#x5224;&#x65AD;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x662F;&#x8FD0;&#x884C;&#x5728;&#x5F00;&#x53D1;&#x6A21;&#x5F0F;&#x4E0B;&#x8FD8;&#x662F;&#x53D1;&#x5E03;&#x6A21;&#x5F0F;&#xFF0C;&#x5E76;&#x636E;&#x6B64;&#x5224;&#x65AD;&#x4EE5;&#x5207;&#x6362;&#x5E94;&#x7528;&#x8FD0;&#x884C;&#x89C4;&#x5219;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x8BA9;&#x62E5;&#x6709;&#x516C;&#x94A5;&#x7684;&#x8BC1;&#x4E66;&#x8D77;&#x4F5C;&#x7528;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6709;&#x79C1;&#x94A5;&#x3002;&#x79C1;&#x94A5;&#x662F;&#x4F60;&#x5728;&#x4E3A;&#x7EC4;&#x6210;&#x5E94;&#x7528;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;&#x8FDB;&#x884C;&#x7B7E;&#x540D;&#x65F6;&#x6D3E;&#x4E0A;&#x7528;&#x573A;&#x7684;&#x3002;&#x6CA1;&#x6709;&#x79C1;&#x94A5;&#xFF0C;&#x4F60;&#x5C31;&#x65E0;&#x6CD5;&#x7528;&#x8BC1;&#x4E66;&#x548C;&#x516C;&#x94A5;&#x5BF9;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#x8BBE;&#x7F6E;&#x7B7E;&#x540D;&#x3002;</p>
<p>&#x7B7E;&#x540D;&#x8FC7;&#x7A0B;&#x672C;&#x8EAB;&#x662F;&#x7531;&#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177; codesign &#x6765;&#x5B8C;&#x6210;&#x7684;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5728; Xcode &#x4E2D;&#x7F16;&#x8BD1;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#xFF0C;&#x8FD9;&#x4E2A;&#x5E94;&#x7528;&#x6784;&#x5EFA;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#x4F1A;&#x81EA;&#x52A8;&#x8C03;&#x7528; codesign &#x547D;&#x4EE4;&#x8FDB;&#x884C;&#x7B7E;&#x540D;&#xFF0C;codesign &#x4E5F;&#x6B63;&#x662F;&#x7ED9;&#x4F60;&#x63D0;&#x4F9B;&#x4E86;&#x8BB8;&#x591A;&#x683C;&#x5F0F;&#x53CB;&#x597D;&#x5E76;&#x4E14;&#x6709;&#x7528;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x7684;&#x90A3;&#x4E00;&#x4E2A;&#x5DE5;&#x5177;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5728; Xcode &#x7684; project settings &#x4E2D;&#x8BBE;&#x7F6E;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x4FE1;&#x606F;&#x3002;</p>
<p><img src="/2016/11/06/&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x63A2;&#x6790;/3.png" alt=""></p>
<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F; Xcode &#x53EA;&#x5141;&#x8BB8;&#x4F60;&#x5728;&#x6709;&#x9650;&#x7684;&#x9009;&#x9879;&#x4E2D;&#x8FDB;&#x884C;&#x9009;&#x62E9;&#xFF0C;&#x8FD9;&#x4E9B;&#x9009;&#x9879;&#x90FD;&#x662F;&#x4F60;&#x65E2;&#x62E5;&#x6709;&#x516C;&#x94A5;&#x4E5F;&#x62E5;&#x6709;&#x79C1;&#x94A5;&#x7684;&#x8BC1;&#x4E66;&#x3002;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x5728;&#x9009;&#x9879;&#x4E2D;&#x6CA1;&#x6709;&#x51FA;&#x73B0;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x90A3;&#x4E00;&#x4E2A;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x9700;&#x8981;&#x68C0;&#x67E5;&#x7684;&#x7B2C;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#x4F60;&#x662F;&#x5426;&#x62E5;&#x6709;&#x8FD9;&#x4E2A;&#x8BC1;&#x4E66;&#x7684;&#x79C1;&#x94A5;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#x4F60;&#x9700;&#x8981;&#x533A;&#x5206;&#x5F00;&#x7528;&#x4E8E;&#x5F00;&#x53D1;&#x6D4B;&#x8BD5;&#x8FD8;&#x662F;&#x7528;&#x4E8E;&#x53D1;&#x5E03;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8981;&#x5728;&#x673A;&#x5668;&#x4E0A;&#x6D4B;&#x8BD5;&#x4F60;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x7528;&#x7528;&#x4E8E;&#x5F00;&#x53D1;&#x6D4B;&#x8BD5;&#x7684;&#x90A3;&#x4E00;&#x5BF9;&#x5BC6;&#x5319;&#x6765;&#x8FDB;&#x884C;&#x7B7E;&#x540D;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x662F;&#x8981;&#x53D1;&#x5E03;&#x5E94;&#x7528;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x7ED9;&#x6D4B;&#x8BD5;&#x4EBA;&#x5458;&#x8FD8;&#x662F;&#x53D1;&#x5E03;&#x5230; APP Store&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x7528;&#x7528;&#x4E8E;&#x53D1;&#x5E03;&#x7684;&#x90A3;&#x4E00;&#x5BF9;&#x5BC6;&#x5319;&#x6765;&#x8FDB;&#x884C;&#x7B7E;&#x540D;&#x3002;</p>
<p>&#x4E00;&#x76F4;&#x4EE5;&#x6765;&#xFF0C;&#x4EE5;&#x4E0A;&#x8FD9;&#x4E9B;&#x5C31;&#x662F;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x7684;&#x5168;&#x90E8;&#xFF0C;&#x8BBE;&#x7F6E;&#x4E86;&#x8FD9;&#x4E9B;&#x5C31;&#x51E0;&#x4E4E;&#x5B8C;&#x6210;&#x4E86;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5728; Xcode &#x7684; project settings &#x4E2D;&#x51FA;&#x73B0;&#x4E86;&#x8BBE;&#x7F6E;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7684;&#x9009;&#x9879;&#x3002;&#x5982;&#x679C;&#x4F60;&#x9009;&#x62E9;&#x4E86;&#x67D0;&#x4E00;&#x4E2A;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x9009;&#x62E9;&#x8FD9;&#x4E2A;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7684;&#x8BC1;&#x4E66;&#x4E2D;&#x6240;&#x5305;&#x542B;&#x7684;&#x516C;&#x94A5;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x90A3;&#x4E2A;&#x5BC6;&#x5319;&#x5BF9;&#xFF0C;&#x6216;&#x8005;&#x4F60;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x8BA9; Xcode &#x81EA;&#x52A8;&#x5B8C;&#x6210;&#x6B63;&#x786E;&#x7684;&#x8BBE;&#x7F6E;&#x3002;&#x5173;&#x4E8E;&#x8FD9;&#x65B9;&#x9762;&#x6211;&#x4EEC;&#x7A0D;&#x540E;&#x518D;&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#xFF0C;&#x9996;&#x5148;&#x8FD8;&#x662F;&#x56DE;&#x5230;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x3002;</p>
<h2 id="&#x4E00;&#x4E2A;&#x5DF2;&#x7B7E;&#x540D;&#x5E94;&#x7528;&#x7684;&#x7EC4;&#x6210;"><a href="#&#x4E00;&#x4E2A;&#x5DF2;&#x7B7E;&#x540D;&#x5E94;&#x7528;&#x7684;&#x7EC4;&#x6210;" class="headerlink" title="&#x4E00;&#x4E2A;&#x5DF2;&#x7B7E;&#x540D;&#x5E94;&#x7528;&#x7684;&#x7EC4;&#x6210;"></a>&#x4E00;&#x4E2A;&#x5DF2;&#x7B7E;&#x540D;&#x5E94;&#x7528;&#x7684;&#x7EC4;&#x6210;</h2><p>&#x4E00;&#x4E2A;&#x5DF2;&#x7B7E;&#x540D;&#x7684;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x7684;&#x7B7E;&#x540D;&#x5305;&#x542B;&#x5728; Mach-O &#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;&#x683C;&#x5F0F;&#x4E2D;&#xFF1B;&#x5BF9;&#x4E8E;&#x4F8B;&#x5982;&#x811A;&#x672C;&#x8FD9;&#x6837;&#x7684;&#x975E; Mach-O &#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#xFF0C;&#x5C31;&#x5B58;&#x653E;&#x5728;&#x8BE5;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x7684;&#x6269;&#x5C55;&#x5C5E;&#x6027;&#x4E2D;&#x3002;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x4F7F;&#x5F97;&#x5728; macOS &#x548C; iOS &#x4E0A;&#x7684;&#x4EFB;&#x4F55;&#x53EF;&#x6267;&#x884C;&#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;&#x90FD;&#x53EF;&#x4EE5;&#x88AB;&#x8BBE;&#x7F6E;&#x7B7E;&#x540D;&#xFF1A;&#x4E0D;&#x8BBA;&#x662F;&#x52A8;&#x6001;&#x5E93;&#xFF0C;&#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177;&#xFF0C;&#x8FD8;&#x662F; .app &#x540E;&#x7F00;&#x7684;&#x7A0B;&#x5E8F;&#x5305;&#x3002;&#x8FD9;&#x4E5F;&#x610F;&#x5473;&#x7740;&#x8BBE;&#x7F6E;&#x7B7E;&#x540D;&#x7684;&#x8FC7;&#x7A0B;&#x5B9E;&#x9645;&#x4E0A;&#x4F1A;&#x6539;&#x52A8;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x7684;&#x6587;&#x4EF6;&#x5185;&#x5BB9;&#xFF0C;&#x5C06;&#x7B7E;&#x540D;&#x6570;&#x636E;&#x5199;&#x5165;&#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;&#x4E2D;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x8BC1;&#x4E66;&#x548C;&#x5B83;&#x7684;&#x79C1;&#x94A5;&#xFF0C;&#x90A3;&#x4E48;&#x7528; codesign &#x6765;&#x8BBE;&#x7F6E;&#x7B7E;&#x540D;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x5C1D;&#x8BD5;&#x7528;&#x4E0B;&#x9762;&#x5217;&#x51FA;&#x7684;&#x8FD9;&#x4E2A;&#x8BC1;&#x4E66;&#x6765;&#x4E3A; Example.app &#x8BBE;&#x7F6E;&#x7B7E;&#x540D;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">codesign -s &apos;iPhone Developer: Thomas Kollbach (7TPNXN7G6K)&apos; Example.app</div></pre></td></tr></table></figure>
<p>&#x5982;&#x679C;&#x4F60;&#x60F3;&#x4E3A;&#x67D0;&#x4E00;&#x4E2A; app &#x7A0B;&#x5E8F;&#x5305;&#x91CD;&#x65B0;&#x8BBE;&#x7F6E;&#x7B7E;&#x540D;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x5C31;&#x5F88;&#x6709;&#x7528;&#x4E86;&#x3002;&#x4E3A;&#x4E86;&#x91CD;&#x65B0;&#x8BBE;&#x7F6E;&#x7B7E;&#x540D;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x5E26;&#x4E0A; -f &#x53C2;&#x6570;&#xFF0C;&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;codesign &#x4F1A;&#x7528;&#x4F60;&#x9009;&#x62E9;&#x7684;&#x7B7E;&#x540D;&#x66FF;&#x6362;&#x6389;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x7684;&#x90A3;&#x4E00;&#x4E2A;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">codesign -f -s &apos;iPhone Developer: Thomas Kollbach (7TPNXN7G6K)&apos; Example.app</div></pre></td></tr></table></figure>
<p>codesign &#x8FD8;&#x53EF;&#x4EE5;&#x4E3A;&#x4F60;&#x63D0;&#x4F9B;&#x6709;&#x5173;&#x4E00;&#x4E2A;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x7B7E;&#x540D;&#x72B6;&#x6001;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x5728;&#x51FA;&#x73B0;&#x4E0D;&#x660E;&#x9519;&#x8BEF;&#x65F6;&#x4F1A;&#x63D0;&#x4F9B;&#x5DE8;&#x5927;&#x7684;&#x5E2E;&#x52A9;&#x3002;&#x4E3E;&#x4F8B;&#x6765;&#x8BF4;&#xFF0C;$ codesign -vv -d Example.app &#x4F1A;&#x5217;&#x51FA;&#x4E00;&#x4E9B;&#x6709;&#x5173; Example.app &#x7684;&#x7B7E;&#x540D;&#x4FE1;&#x606F;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div></pre></td><td class="code"><pre><div class="line">Executable=/Users/toto/Library/Developer/Xcode/DerivedData/Example-cfsbhbvmswdivqhekxfykvkpngkg/Build/Products/Debug-iphoneos/Example.app/Example</div><div class="line">Identifier=ch.kollba.example</div><div class="line">Format=bundle with Mach-O thin (arm64)</div><div class="line">CodeDirectory v=20200 size=26663 flags=0x0(none) hashes=1324+5 location=embedded</div><div class="line">Signature size=4336</div><div class="line">Authority=iPhone Developer: Thomas Kollbach (7TPNXN7G6K)</div><div class="line">Authority=Apple Worldwide Developer Relations Certification Authority</div><div class="line">Authority=Apple Root CA</div><div class="line">Signed Time=29.09.2014 22:29:07</div><div class="line">Info.plist entries=33</div><div class="line">TeamIdentifier=DZM8538E3E</div><div class="line">Sealed Resources version=2 rules=4 files=120</div><div class="line">Internal requirements count=1 size=184</div></pre></td></tr></table></figure>
<p>&#x4F60;&#x9700;&#x8981;&#x67E5;&#x770B;&#x7684;&#x7B2C;&#x4E00;&#x4EF6;&#x4E8B;&#x662F;&#x4EE5; Authority &#x5F00;&#x5934;&#x7684;&#x90A3;&#x4E09;&#x884C;&#x3002;&#x8FD9;&#x4E09;&#x884C;&#x544A;&#x8BC9;&#x4F60;&#x5230;&#x5E95;&#x662F;&#x54EA;&#x4E00;&#x4E2A;&#x8BC1;&#x4E66;&#x4E3A;&#x8FD9;&#x4E2A; app &#x8BBE;&#x7F6E;&#x4E86;&#x7B7E;&#x540D;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#x5F53;&#x7136;&#x662F;&#x6211;&#x7684;&#x8BC1;&#x4E66;&#xFF0C;iPhone Developer: Thomas Kollbach (7TPNXN7G6K)&#x3002;&#x6211;&#x7684;&#x8FD9;&#x4E2A;&#x8BC1;&#x4E66;&#x5219;&#x662F;&#x88AB;&#x8BC1;&#x4E66; Apple Worldwide Developer Relations Certification Authority &#x8BBE;&#x7F6E;&#x4E86;&#x7B7E;&#x540D;&#x7684;&#xFF0C;&#x4F9D;&#x6B64;&#x7C7B;&#x63A8;&#x8FD9;&#x4E2A;&#x8BC1;&#x4E66;&#x5219;&#x662F;&#x88AB;&#x8BC1;&#x4E66; Apple Root CA &#x8BBE;&#x7F6E;&#x4E86;&#x7B7E;&#x540D;&#x3002;</p>
<p>&#x5728; Format &#x4E2D;&#x4E5F;&#x5305;&#x542B;&#x4E86;&#x4E00;&#x4E9B;&#x5173;&#x4E8E;&#x4EE3;&#x7801;&#x7684;&#x4FE1;&#x606F;&#xFF1A;Example.app &#x5E76;&#x4E0D;&#x5355;&#x5355;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5305;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x4E86;&#x4E00;&#x4E2A; arm64 &#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;&#x3002;&#x4ECE; Executable &#x4E2D;&#x7684;&#x8DEF;&#x5F84;&#x4FE1;&#x606F;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4EE5;&#x6D4B;&#x8BD5;&#x4E3A;&#x76EE;&#x7684;&#x7684;&#x6253;&#x5305;&#xFF0C;&#x6240;&#x4EE5;&#x662F;&#x4E00;&#x4E2A; Mach-O thin &#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;&#x3002;</p>
<p>&#x5728;&#x4E00;&#x5806;&#x8BCA;&#x65AD;&#x4FE1;&#x606F;&#x4E2D;&#x8FD8;&#x5305;&#x542B;&#x4E86;&#x4E24;&#x4E2A;&#x975E;&#x5E38;&#x6709;&#x8DA3;&#x7684;&#x6761;&#x76EE;&#x3002; Identifier &#x662F;&#x6211;&#x5728; Xcode &#x4E2D;&#x8BBE;&#x7F6E;&#x7684; bundle identifier&#x3002; TeamIdentifier &#x7528;&#x4E8E;&#x6807;&#x8BC6;&#x6211;&#x7684;&#x5DE5;&#x4F5C;&#x7EC4;&#xFF08;&#x7CFB;&#x7EDF;&#x4F1A;&#x7528;&#x8FD9;&#x4E2A;&#x6765;&#x5224;&#x65AD;&#x5E94;&#x7528;&#x662F;&#x5426;&#x662F;&#x7531;&#x540C;&#x4E00;&#x4E2A;&#x5F00;&#x53D1;&#x8005;&#x53D1;&#x5E03;&#xFF09;&#x3002;&#x6B64;&#x5916;&#x7528;&#x4E8E;&#x53D1;&#x5E03;&#x5E94;&#x7528;&#x7684;&#x8BC1;&#x4E66;&#x4E2D;&#x4E5F;&#x5305;&#x542B;&#x8FD9;&#x79CD;&#x6807;&#x8BC6;&#xFF0C;&#x8FD9;&#x79CD;&#x6807;&#x8BC6;&#x5728;&#x533A;&#x5206;&#x540C;&#x4E00;&#x540D;&#x79F0;&#x4E0B;&#x7684;&#x4E0D;&#x540C;&#x8BC1;&#x4E66;&#x65F6;&#x975E;&#x5E38;&#x6709;&#x7528;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x8FD9;&#x4E2A;&#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;&#x5DF2;&#x7ECF;&#x7528;&#x8BC1;&#x4E66;&#x8BBE;&#x7F6E;&#x597D;&#x7B7E;&#x540D;&#x3002;&#x5C31;&#x50CF;&#x4E2D;&#x4E16;&#x7EAA;&#x4EBA;&#x7528;&#x8721;&#x6765;&#x5C01;&#x5370;&#x4FE1;&#x5C01;&#x4E00;&#x6837;&#xFF0C;&#x7B7E;&#x540D;&#x5C31;&#x8FD9;&#x6837;&#x5C01;&#x5370;&#x4E86;&#x8FD9;&#x4E2A;&#x5E94;&#x7528;&#x3002;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x6765;&#x68C0;&#x67E5;&#x4E00;&#x4E0B;&#x5C01;&#x5370;&#x662F;&#x5426;&#x5B8C;&#x597D;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">codesign --verify Example.app</div></pre></td></tr></table></figure>
<p>&#x5C31;&#x50CF;&#x5927;&#x591A;&#x6570; UNIX &#x5DE5;&#x5177;&#x4E00;&#x6837;&#xFF0C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x8F93;&#x51FA;&#x4EE3;&#x8868;&#x7B7E;&#x540D;&#x662F;&#x5B8C;&#x597D;&#x7684;&#x3002;&#x90A3;&#x4E48;&#x6211;&#x4E0B;&#x9762;&#x7834;&#x574F;&#x8FD9;&#x4E2A;&#x5C01;&#x5370;&#xFF0C;&#x53EA;&#x8981;&#x4FEE;&#x6539;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div></pre></td><td class="code"><pre><div class="line">echo &apos;lol&apos; &gt;&gt; Example.app/Example</div><div class="line">codesign --verify Example.app</div><div class="line">Example.app: main executable failed strict validation</div></pre></td></tr></table></figure>
<p>&#x4FEE;&#x6539;&#x5DF2;&#x7ECF;&#x7B7E;&#x540D;&#x7684;&#x5E94;&#x7528;&#x4F1A;&#x7834;&#x574F;&#x5C01;&#x5370;&#xFF0C;&#x4ECE;&#x547D;&#x4EE4;&#x884C;&#x8F93;&#x51FA;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x6240;&#x9884;&#x671F;&#x4E00;&#x6837;&#x8D77;&#x5230;&#x4E86;&#x4F5C;&#x7528;&#x3002;</p>
<h2 id="&#x7A0B;&#x5E8F;&#x5305;&#x548C;&#x5176;&#x4ED6;&#x8D44;&#x6E90;&#x6587;&#x4EF6;"><a href="#&#x7A0B;&#x5E8F;&#x5305;&#x548C;&#x5176;&#x4ED6;&#x8D44;&#x6E90;&#x6587;&#x4EF6;" class="headerlink" title="&#x7A0B;&#x5E8F;&#x5305;&#x548C;&#x5176;&#x4ED6;&#x8D44;&#x6E90;&#x6587;&#x4EF6;"></a>&#x7A0B;&#x5E8F;&#x5305;&#x548C;&#x5176;&#x4ED6;&#x8D44;&#x6E90;&#x6587;&#x4EF6;</h2><p>&#x5BF9;&#x4E8E;&#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177;&#x548C;&#x811A;&#x672C;&#x6765;&#x8BF4;&#xFF0C;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x88AB;&#x8BBE;&#x7F6E;&#x7B7E;&#x540D;&#xFF0C;&#x4F46;&#x662F; iOS &#x548C; OS X &#x7684;&#x5E94;&#x7528;&#x548C;&#x6846;&#x67B6;&#x5219;&#x662F;&#x5305;&#x542B;&#x4E86;&#x5B83;&#x4EEC;&#x6240;&#x9700;&#x8981;&#x7684;&#x8D44;&#x6E90;&#x5728;&#x5176;&#x4E2D;&#x7684;&#x3002;&#x8FD9;&#x4E9B;&#x8D44;&#x6E90;&#x5305;&#x62EC;&#x56FE;&#x7247;&#x548C;&#x4E0D;&#x540C;&#x7684;&#x8BED;&#x8A00;&#x6587;&#x4EF6;&#xFF0C;&#x8D44;&#x6E90;&#x4E2D;&#x4E5F;&#x5305;&#x62EC;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x5E94;&#x7528;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x4F8B;&#x5982; XIB/NIB &#x6587;&#x4EF6;&#xFF0C;&#x5B58;&#x6863;&#x6587;&#x4EF6;(archives)&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x8BC1;&#x4E66;&#x6587;&#x4EF6;&#x3002;&#x6240;&#x4EE5;&#x4E3A;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5305;&#x8BBE;&#x7F6E;&#x7B7E;&#x540D;&#x65F6;&#xFF0C;&#x8FD9;&#x4E2A;&#x5305;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x8D44;&#x6E90;&#x6587;&#x4EF6;&#x4E5F;&#x90FD;&#x4F1A;&#x88AB;&#x8BBE;&#x7F6E;&#x7B7E;&#x540D;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x8FBE;&#x5230;&#x4E3A;&#x6240;&#x6709;&#x6587;&#x4EF6;&#x8BBE;&#x7F6E;&#x7B7E;&#x540D;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x7B7E;&#x540D;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F1A;&#x5728;&#x7A0B;&#x5E8F;&#x5305;&#x4E2D;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;&#x53EB;&#x505A; _CodeSignatue/CodeResources &#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x4E2D;&#x5B58;&#x50A8;&#x4E86;&#x88AB;&#x7B7E;&#x540D;&#x7684;&#x7A0B;&#x5E8F;&#x5305;&#x4E2D;&#x6240;&#x6709;&#x6587;&#x4EF6;&#x7684;&#x7B7E;&#x540D;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x53BB;&#x67E5;&#x770B;&#x8FD9;&#x4E2A;&#x7B7E;&#x540D;&#x5217;&#x8868;&#x6587;&#x4EF6;&#xFF0C;&#x5B83;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A; plist &#x683C;&#x5F0F;&#x6587;&#x4EF6;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x5217;&#x8868;&#x6587;&#x4EF6;&#x4E2D;&#x4E0D;&#x5149;&#x5305;&#x542B;&#x4E86;&#x6587;&#x4EF6;&#x548C;&#x5B83;&#x4EEC;&#x7684;&#x7B7E;&#x540D;&#x7684;&#x5217;&#x8868;&#xFF0C;&#x8FD8;&#x5305;&#x542B;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x89C4;&#x5219;&#xFF0C;&#x8FD9;&#x4E9B;&#x89C4;&#x5219;&#x51B3;&#x5B9A;&#x4E86;&#x54EA;&#x4E9B;&#x8D44;&#x6E90;&#x6587;&#x4EF6;&#x5E94;&#x5F53;&#x88AB;&#x8BBE;&#x7F6E;&#x7B7E;&#x540D;&#x3002;&#x4F34;&#x968F; OS X 10.10 DP 5 &#x548C; 10.9.5 &#x7248;&#x672C;&#x7684;&#x53D1;&#x5E03;&#xFF0C;&#x82F9;&#x679C;&#x6539;&#x53D8;&#x4E86;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x7684;&#x683C;&#x5F0F;&#xFF0C;&#x4E5F;&#x6539;&#x53D8;&#x4E86;&#x6709;&#x5173;&#x8D44;&#x6E90;&#x7684;&#x89C4;&#x5219;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;10.9.5&#x6216;&#x8005;&#x66F4;&#x9AD8;&#x7248;&#x672C;&#x7684; codesign &#x5DE5;&#x5177;&#xFF0C;&#x5728; CodeResources &#x6587;&#x4EF6;&#x4E2D;&#x4F1A;&#x6709;4&#x4E2A;&#x4E0D;&#x540C;&#x533A;&#x57DF;&#xFF0C;&#x5176;&#x4E2D;&#x7684; rules &#x548C; files &#x662F;&#x4E3A;&#x8001;&#x7248;&#x672C;&#x51C6;&#x5907;&#x7684;&#xFF0C;&#x800C; files2 &#x548C; rules2&#x662F;&#x4E3A;&#x65B0;&#x7684;&#x7B2C;&#x4E8C;&#x7248;&#x7684;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x51C6;&#x5907;&#x7684;&#x3002;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x533A;&#x522B;&#x662F;&#x5728;&#x65B0;&#x7248;&#x672C;&#x4E2D;&#x4F60;&#x65E0;&#x6CD5;&#x518D;&#x5C06;&#x67D0;&#x4E9B;&#x8D44;&#x6E90;&#x6587;&#x4EF6;&#x6392;&#x9664;&#x5728;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x4E4B;&#x5916;&#xFF0C;&#x5728;&#x8FC7;&#x53BB;&#x4F60;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#xFF0C;&#x53EA;&#x8981;&#x5728;&#x88AB;&#x8BBE;&#x7F6E;&#x7B7E;&#x540D;&#x7684;&#x7A0B;&#x5E8F;&#x5305;&#x4E2D;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x540D;&#x4E3A; ResourceRules.plist &#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x4F1A;&#x89C4;&#x5B9A;&#x54EA;&#x4E9B;&#x8D44;&#x6E90;&#x6587;&#x4EF6;&#x5728;&#x68C0;&#x67E5;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x662F;&#x5426;&#x5B8C;&#x597D;&#x65F6;&#x5E94;&#x8BE5;&#x88AB;&#x5FFD;&#x7565;&#x3002;&#x4F46;&#x662F;&#x5728;&#x65B0;&#x7248;&#x672C;&#x7684;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x4E2D;&#xFF0C;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x4E0D;&#x518D;&#x6709;&#x6548;&#x3002;&#x6240;&#x6709;&#x7684;&#x4EE3;&#x7801;&#x6587;&#x4EF6;&#x548C;&#x8D44;&#x6E90;&#x6587;&#x4EF6;&#x90FD;&#x5FC5;&#x987B;&#x8BBE;&#x7F6E;&#x7B7E;&#x540D;&#xFF0C;&#x4E0D;&#x518D;&#x53EF;&#x4EE5;&#x6709;&#x4F8B;&#x5916;&#x3002;&#x5728;&#x65B0;&#x7248;&#x672C;&#x7684;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x89C4;&#x5B9A;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5305;&#x4E2D;&#x7684;&#x53EF;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x5305;&#xFF0C;&#x4F8B;&#x5982;&#x6269;&#x5C55; (extension)&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x7B7E;&#x540D;&#x7684;&#x4E2A;&#x4F53;&#xFF0C;&#x5728;&#x68C0;&#x67E5;&#x7B7E;&#x540D;&#x662F;&#x5426;&#x5B8C;&#x6574;&#x65F6;&#x5E94;&#x5F53;&#x88AB;&#x5355;&#x72EC;&#x5BF9;&#x5F85;&#x3002;</p>
<h2 id="&#x6388;&#x6743;&#x673A;&#x5236;-Entitlements-&#x548C;&#x914D;&#x7F6E;&#x6587;&#x4EF6;-Provisioning"><a href="#&#x6388;&#x6743;&#x673A;&#x5236;-Entitlements-&#x548C;&#x914D;&#x7F6E;&#x6587;&#x4EF6;-Provisioning" class="headerlink" title="&#x6388;&#x6743;&#x673A;&#x5236; (Entitlements) &#x548C;&#x914D;&#x7F6E;&#x6587;&#x4EF6; (Provisioning)"></a>&#x6388;&#x6743;&#x673A;&#x5236; (Entitlements) &#x548C;&#x914D;&#x7F6E;&#x6587;&#x4EF6; (Provisioning)</h2><p>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x5047;&#x8BBE;&#x6240;&#x6709;&#x7684;&#x8BC1;&#x4E66;&#x8D77;&#x5230;&#x7684;&#x4F5C;&#x7528;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x5047;&#x8BBE;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;&#x8BC1;&#x4E66;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x4E5F;&#x5C31;&#x76F8;&#x5E94;&#x7684;&#x6709;&#x6548;&#x3002;&#x7136;&#x800C;&#x8FD9;&#x5F53;&#x7136;&#x4E0D;&#x662F;&#x552F;&#x4E00;&#x7684;&#x89C4;&#x5219;&#x3002;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6709;&#x8BB8;&#x591A;&#x6807;&#x51C6;&#x6765;&#x68C0;&#x6D4B;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x5426;&#x5141;&#x8BB8;&#x8FD0;&#x884C;&#x3002;<br>&#x8FD9;&#x4E9B;&#x6807;&#x51C6;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x6210;&#x4E0D;&#x53D8;&#x7684;&#x3002;&#x4E3E;&#x4F8B;&#x6765;&#x8BF4;&#xFF0C;&#x5728; OS X &#x4E0A;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x662F;&#x5426;&#x5141;&#x8BB8;&#x88AB;&#x5F00;&#x542F;&#x662F;&#x7531; Gatekeeper &#x7684;&#x9009;&#x9879;&#x51B3;&#x5B9A;&#x7684;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x7CFB;&#x7EDF;&#x8BBE;&#x7F6E;&#x7684;&#x5B89;&#x5168;&#x9009;&#x9879;&#x4E2D;&#x6539;&#x53D8;&#x9009;&#x9879;&#x3002;&#x5728; Gatekeeper &#x9009;&#x9879;&#x4E2D;&#x9009;&#x62E9; &#x201C;&#x53D7;&#x4FE1;&#x4EFB;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x6216;&#x8005;&#x6765;&#x81EA; Mac App Store&#x201D; &#x4F1A;&#x8981;&#x6C42;&#x88AB;&#x6253;&#x5F00;&#x7684;&#x5E94;&#x7528;&#x5FC5;&#x987B;&#x88AB;&#x8BC1;&#x4E66;&#x7B7E;&#x540D;&#xFF0C;&#x53EF;&#x4EE5;&#x662F; Mac App Store &#x5F00;&#x53D1;&#x8005;&#x7684;&#x5E94;&#x7528;&#x53D1;&#x5E03;&#x8BC1;&#x4E66;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x5F00;&#x53D1;&#x8005; ID &#x8BC1;&#x4E66;&#x3002;&#x8FD9;&#x4E9B;&#x9009;&#x9879;&#x662F;&#x7531;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x5DE5;&#x5177; spctl &#x6765;&#x7BA1;&#x7406;&#x7684;&#xFF0C;&#x5B83;&#x7BA1;&#x7406;&#x7740;&#x7CFB;&#x7EDF;&#x7684;&#x6240;&#x6709;&#x5B89;&#x5168;&#x8BC4;&#x4F30;&#x7B56;&#x7565;&#x3002;</p>
<p>&#x5728; iOS &#x4E0A;&#x89C4;&#x5219;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x7528;&#x6237;&#x8FD8;&#x662F;&#x5F00;&#x53D1;&#x8005;&#x90FD;&#x4E0D;&#x80FD;&#x6539;&#x53D8;&#x5E94;&#x7528;&#x5F00;&#x542F;&#x7B56;&#x7565;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x6709;&#x4E00;&#x4E2A;&#x5F00;&#x53D1;&#x8005;&#x5E10;&#x53F7;&#x6216;&#x8005;&#x5E94;&#x7528;&#x53D1;&#x5E03;&#x8BC1;&#x4E66;&#x624D;&#x80FD;&#x8BA9;&#x5E94;&#x7528;&#x8FD0;&#x884C;&#x5728; iOS &#x7CFB;&#x7EDF;&#x4E0A;&#x3002;</p>
<p>&#x5373;&#x4F7F;&#x4F60;&#x53EF;&#x4EE5;&#x8BA9;&#x5E94;&#x7528;&#x8FD0;&#x884C;&#x8D77;&#x6765;&#xFF0C;&#x5728; iOS &#x4E0A;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x80FD;&#x505A;&#x4EC0;&#x4E48;&#x4F9D;&#x7136;&#x662F;&#x53D7;&#x9650;&#x5236;&#x7684;&#x3002;&#x8FD9;&#x4E9B;&#x9650;&#x5236;&#x662F;&#x6C99;&#x76D2;&#x7BA1;&#x7406;&#x7684;&#x3002;&#x6C99;&#x76D2;&#x548C;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x673A;&#x5236;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x8FD9;&#x5F88;&#x91CD;&#x8981;&#x3002;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x4FDD;&#x8BC1;&#x4E86;&#x8FD9;&#x4E2A;&#x5E94;&#x7528;&#x91CC;&#x6240;&#x5305;&#x542B;&#x7684;&#x5185;&#x5BB9;&#x6B63;&#x5982;&#x5B83;&#x6240;&#x8BF4;&#x7684;&#x90A3;&#x6837;&#x4E0D;&#x591A;&#x4E0D;&#x5C11;&#xFF0C;&#x800C;&#x6C99;&#x76D2;&#x5219;&#x662F;&#x9650;&#x5236;&#x4E86;&#x5E94;&#x7528;&#x8BBF;&#x95EE;&#x7CFB;&#x7EDF;&#x7684;&#x8D44;&#x6E90;&#x3002;&#x8FD9;&#x4E24;&#x79CD;&#x6280;&#x672F;&#x662F;&#x76F8;&#x4E92;&#x5408;&#x4F5C;&#x6765;&#x53D1;&#x6325;&#x4F5C;&#x7528;&#x7684;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x80FD;&#x963B;&#x6B62;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x8FD0;&#x884C;&#xFF0C;&#x4E5F;&#x90FD;&#x80FD;&#x5728; Xcode &#x4E2D;&#x5F15;&#x8D77;&#x5947;&#x602A;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4F46;&#x662F;&#x5728;&#x65E5;&#x5E38;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6C99;&#x76D2;&#x53EF;&#x80FD;&#x4F1A;&#x66F4;&#x7ECF;&#x5E38;&#x5F15;&#x8D77;&#x95EE;&#x9898;&#x3002;&#x6C99;&#x76D2;&#x673A;&#x5236;&#x5728;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x4F1A;&#x5F15;&#x8D77;&#x95EE;&#x9898;&#x5462;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x90FD;&#x662F;&#x7531;&#x4E8E;&#x4E00;&#x4E2A;&#x53EB;&#x505A;&#x6388;&#x6743;&#x7684;&#x673A;&#x5236;&#x51B3;&#x5B9A;&#x7684;&#x3002;</p>
<h2 id="&#x6388;&#x6743;&#x673A;&#x5236;"><a href="#&#x6388;&#x6743;&#x673A;&#x5236;" class="headerlink" title="&#x6388;&#x6743;&#x673A;&#x5236;"></a>&#x6388;&#x6743;&#x673A;&#x5236;</h2><p>&#x6388;&#x6743;&#x673A;&#x5236;&#x51B3;&#x5B9A;&#x4E86;&#x54EA;&#x4E9B;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x5728;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x4E0B;&#x5141;&#x8BB8;&#x88AB;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x4F7F;&#x7528;&#x3002;&#x7B80;&#x5355;&#x7684;&#x8BF4;&#x5B83;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x6C99;&#x76D2;&#x7684;&#x914D;&#x7F6E;&#x5217;&#x8868;&#xFF0C;&#x4E0A;&#x9762;&#x5217;&#x51FA;&#x4E86;&#x54EA;&#x4E9B;&#x884C;&#x4E3A;&#x88AB;&#x5141;&#x8BB8;&#xFF0C;&#x54EA;&#x4E9B;&#x4F1A;&#x88AB;&#x62D2;&#x7EDD;&#x3002;</p>
<p>&#x5F88;&#x53EF;&#x80FD;&#x4F60;&#x5DF2;&#x7ECF;&#x731C;&#x5230;&#x6388;&#x6743;&#x673A;&#x5236;&#x4E5F;&#x662F;&#x6309;&#x7167; plist &#x6587;&#x4EF6;&#x683C;&#x5F0F;&#x6765;&#x5217;&#x51FA;&#x7684;&#x3002;Xcode &#x4F1A;&#x5C06;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x4F5C;&#x4E3A; &#x2013;entitlements &#x53C2;&#x6570;&#x7684;&#x5185;&#x5BB9;&#x4F20;&#x7ED9; codesign &#xFF0C;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x5185;&#x90E8;&#x683C;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div><div class="line">17</div><div class="line">18</div><div class="line">19</div><div class="line">20</div><div class="line">21</div><div class="line">22</div><div class="line">23</div><div class="line">24</div><div class="line">25</div><div class="line">26</div></pre></td><td class="code"><pre><div class="line"></div><div class="line">&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;</div><div class="line">&lt;!DOCTYPE plist PUBLIC &quot;-//Apple//DTD PLIST 1.0//EN&quot; &quot;http://www.apple.com/DTDs/PropertyList-1.0.dtd&quot;&gt;</div><div class="line">&lt;plist version=&quot;1.0&quot;&gt;</div><div class="line">&lt;dict&gt;</div><div class="line">        &lt;key&gt;application-identifier&lt;/key&gt;</div><div class="line">        &lt;string&gt;7TPNXN7G6K.ch.kollba.example&lt;/string&gt;</div><div class="line">        &lt;key&gt;aps-environment&lt;/key&gt;</div><div class="line">        &lt;string&gt;development&lt;/string&gt;</div><div class="line">        &lt;key&gt;com.apple.developer.team-identifier&lt;/key&gt;</div><div class="line">        &lt;string&gt;7TPNXN7G6K&lt;/string&gt;</div><div class="line">        &lt;key&gt;com.apple.developer.ubiquity-container-identifiers&lt;/key&gt;</div><div class="line">        &lt;array&gt;</div><div class="line">                &lt;string&gt;7TPNXN7G6K.ch.kollba.example&lt;/string&gt;</div><div class="line">        &lt;/array&gt;</div><div class="line">        &lt;key&gt;com.apple.developer.ubiquity-kvstore-identifier&lt;/key&gt;</div><div class="line">        &lt;string&gt;7TPNXN7G6K.ch.kollba.example&lt;/string&gt;</div><div class="line">        &lt;key&gt;com.apple.security.application-groups&lt;/key&gt;</div><div class="line">        &lt;array&gt;</div><div class="line">                &lt;string&gt;group.ch.kollba.example&lt;/string&gt;</div><div class="line">        &lt;/array&gt;</div><div class="line">        &lt;key&gt;get-task-allow&lt;/key&gt;</div><div class="line">        &lt;true/&gt;</div><div class="line">&lt;/dict&gt;</div><div class="line">&lt;/plist&gt;</div><div class="line"></div></pre></td></tr></table></figure>
<p>&#x5728; Xcode &#x7684; Capabilities &#x9009;&#x9879;&#x5361;&#x4E0B;&#x9009;&#x62E9;&#x4E00;&#x4E9B;&#x9009;&#x9879;&#x4E4B;&#x540E;&#xFF0C;Xcode &#x5C31;&#x4F1A;&#x751F;&#x6210;&#x8FD9;&#x6837;&#x4E00;&#x6BB5; XML&#x3002; Xcode &#x4F1A;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x4E00;&#x4E2A; .entitlements &#x6587;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x9700;&#x8981;&#x7684;&#x65F6;&#x5019;&#x5F80;&#x91CC;&#x9762;&#x6DFB;&#x52A0;&#x6761;&#x76EE;&#x3002;&#x5F53;&#x6784;&#x5EFA;&#x6574;&#x4E2A;&#x5E94;&#x7528;&#x65F6;&#xFF0C;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x4E5F;&#x4F1A;&#x63D0;&#x4EA4;&#x7ED9; codesign &#x4F5C;&#x4E3A;&#x5E94;&#x7528;&#x6240;&#x9700;&#x8981;&#x62E5;&#x6709;&#x54EA;&#x4E9B;&#x6388;&#x6743;&#x7684;&#x53C2;&#x8003;&#x3002;&#x8FD9;&#x4E9B;&#x6388;&#x6743;&#x4FE1;&#x606F;&#x5FC5;&#x987B;&#x90FD;&#x5728;&#x5F00;&#x53D1;&#x8005;&#x4E2D;&#x5FC3;&#x7684; App ID &#x4E2D;&#x542F;&#x7528;&#xFF0C;&#x5E76;&#x4E14;&#x5305;&#x542B;&#x5728;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x7A0D;&#x540E;&#x6211;&#x4EEC;&#x4F1A;&#x8BE6;&#x7EC6;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E00;&#x70B9;&#x3002;&#x5728;&#x6784;&#x5EFA;&#x5E94;&#x7528;&#x65F6;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x6388;&#x6743;&#x6587;&#x4EF6;&#x53EF;&#x4EE5;&#x5728; Xcode build setting &#x4E2D;&#x7684; code signing entitlements &#x4E2D;&#x8BBE;&#x7F6E;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x5E94;&#x7528;&#x4E2D;&#x6211;&#x542F;&#x7528;&#x4E86; iCloud &#x952E;&#x503C;&#x5BF9;&#x5B58;&#x50A8; (key-value storage) (com.apple.developer.ubiquity-kvstore-identifier) &#xFF0C;&#x4EE5;&#x53CA; iCloud &#x6587;&#x6863;&#x5B58;&#x50A8; (com.apple.developer.ubiquity-container-identifiers)&#x3002;&#x53E6;&#x5916;&#x6211;&#x8FD8;&#x5C06;&#x5E94;&#x7528;&#x6DFB;&#x52A0;&#x8FDB;&#x4E86;&#x4E00;&#x4E2A; App Group (&#x6BD4;&#x5982;&#x8BF4;&#x4E3A;&#x4E86;&#x4E0E;&#x6269;&#x5C55; (extensions) &#x5171;&#x4EAB;&#x6570;&#x636E;&#xFF0C;com.apple.security.application-groups)&#xFF0C; &#x6700;&#x540E;&#x5F00;&#x542F;&#x4E86;&#x63A8;&#x9001;&#x529F;&#x80FD; (aps-environment)&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5F00;&#x53D1;&#x7248;&#x672C;&#xFF0C;&#x6211;&#x4F1A;&#x6709;&#x5C06;&#x5B83;&#x8FDE;&#x63A5;&#x5230;&#x8C03;&#x8BD5;&#x5668;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x5C06; get-task-allow &#x8BBE;&#x4E3A; true&#x3002;&#x53E6;&#x5916;&#xFF0C;app id&#xFF0C;&#x4E5F;&#x5C31;&#x662F; bundle id &#x52A0;&#x4E0A;&#x5F00;&#x53D1;&#x8005; id&#xFF0C;&#x4E5F;&#x88AB;&#x5355;&#x72EC;&#x5217;&#x51FA;&#x6765;&#x4E86;&#x3002;</p>
<p>&#x5F53;&#x7136;&#x4F60;&#x5E76;&#x4E0D;&#x80FD;&#x968F;&#x5FC3;&#x6240;&#x6B32;&#x7684;&#x53D6;&#x5F97;&#x6388;&#x6743;&#xFF0C;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x80FD;&#x5426;&#x5F97;&#x5230;&#x67D0;&#x4E00;&#x9879;&#x6388;&#x6743;&#x662F;&#x6709;&#x7279;&#x5B9A;&#x7684;&#x89C4;&#x5B9A;&#x7684;&#x3002;&#x4E3E;&#x4F8B;&#x6765;&#x8BF4;&#xFF0C;&#x5F53; get-task-allow &#x88AB;&#x8BBE;&#x5B9A;&#x4E3A; ture &#x65F6;&#xFF0C;&#x5E94;&#x7528;&#x53EA;&#x80FD;&#x5728;&#x7528;&#x4E8E;&#x5F00;&#x53D1;&#x7684;&#x8BC1;&#x4E66;&#x7B7E;&#x540D;&#x4E0B;&#x8FD0;&#x884C;&#x3002;&#x4F60;&#x88AB;&#x5141;&#x8BB8;&#x4F7F;&#x7528;&#x7684;&#x63A8;&#x9001;&#x73AF;&#x5883; (aps-environment) &#x4E5F;&#x5B58;&#x5728;&#x7C7B;&#x4F3C;&#x7684;&#x9650;&#x5236;&#x3002;</p>
<p>&#x6839;&#x636E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7248;&#x672C;&#x7684;&#x4E0D;&#x540C;&#x6211;&#x4EEC;&#x53EF;&#x9009;&#x7684;&#x6388;&#x6743;&#x9879;&#x76EE;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5F88;&#x96BE;&#x6709;&#x4E00;&#x4EFD;&#x5217;&#x8868;&#x53EF;&#x4EE5;&#x8BE6;&#x5C3D;&#x5730;&#x5217;&#x51FA;&#x6240;&#x6709;&#x6761;&#x76EE;&#x3002;&#x81F3;&#x5C11;&#x5728;&#x6587;&#x6863; Adding Capabilities &#x4E2D;&#x63D0;&#x5230;&#x7684;&#x6240;&#x6709;&#x529F;&#x80FD;&#x90FD;&#x662F;&#x9700;&#x8981;&#x7ECF;&#x8FC7;&#x6388;&#x6743;&#x7684;&#x3002;</p>
<p>&#x6388;&#x6743;&#x4FE1;&#x606F;&#x4F1A;&#x88AB;&#x5305;&#x542B;&#x5728;&#x5E94;&#x7528;&#x7684;&#x7B7E;&#x540D;&#x4FE1;&#x606F;&#x4E2D;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5728;&#x8FD9;&#x65B9;&#x9762;&#x9047;&#x5230;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x67E5;&#x770B;&#x7B7E;&#x540D;&#x4FE1;&#x606F;&#x4E2D;&#x5177;&#x4F53;&#x5305;&#x542B;&#x4E86;&#x4EC0;&#x4E48;&#x6388;&#x6743;&#x4FE1;&#x606F;&#xFF1A;$ codesign -d &#x2013;entitlements - Example.app &#x4F1A;&#x5217;&#x51FA;&#x4E00;&#x4E2A;&#x548C;&#x524D;&#x9762;&#x7684;&#x5F88;&#x50CF;&#x7684; XML &#x683C;&#x5F0F;&#x7684;&#x5C5E;&#x6027;&#x5217;&#x8868;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x5185;&#x5BB9;&#x6DFB;&#x52A0;&#x8FDB;&#x4E00;&#x4E2A;&#x811A;&#x672C;&#xFF0C;&#x6BCF;&#x6B21;&#x6784;&#x5EFA;&#x5E94;&#x7528;&#x65F6;&#x7528;&#x811A;&#x672C;&#x68C0;&#x67E5;&#x662F;&#x5426;&#x5305;&#x542B;&#x4E86;&#x63A8;&#x9001;&#x670D;&#x52A1;&#x7684;&#x6388;&#x6743;&#x4FE1;&#x606F;&#xFF0C;&#x4EE5;&#x6B64;&#x786E;&#x4FDD;&#x63A8;&#x9001;&#x670D;&#x52A1;&#x5DE5;&#x4F5C;&#x6B63;&#x5E38;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#x63A8;&#x9001;&#x670D;&#x52A1;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x4F60;&#x4F7F;&#x7528;&#x7684;&#x670D;&#x52A1;&#x8D8A;&#x591A;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x6DFB;&#x52A0;&#x63A8;&#x9001;&#x901A;&#x77E5;&#x7684;&#x6388;&#x6743;&#xFF0C;&#x4EE5;&#x4FDD;&#x8BC1;&#x53EF;&#x4EE5;&#x6CE8;&#x518C;&#x63A8;&#x9001;&#x901A;&#x77E5;&#x3002;&#x5728;&#x65B0;&#x7248;&#x672C;&#x7684; Xcode 6 &#x4E4B;&#x540E;&#xFF0C;&#x6388;&#x6743;&#x4FE1;&#x606F;&#x5217;&#x8868;&#x4F1A;&#x4EE5; Example.app.xcent &#x8FD9;&#x6837;&#x7684;&#x540D;&#x5B57;&#x7684;&#x6587;&#x4EF6;&#x5F62;&#x5F0F;&#x5305;&#x542B;&#x5728;&#x5E94;&#x7528;&#x5305;&#x4E2D;&#x3002;&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x8FD9;&#x4E48;&#x505A;&#x662F;&#x4E3A;&#x4E86;&#x5728;&#x51FA;&#x73B0;&#x914D;&#x7F6E;&#x9519;&#x8BEF;&#x65F6;&#x63D0;&#x4F9B;&#x66F4;&#x52A0;&#x6709;&#x7528;&#x7684;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x3002;</p>
<h2 id="&#x914D;&#x7F6E;&#x6587;&#x4EF6;"><a href="#&#x914D;&#x7F6E;&#x6587;&#x4EF6;" class="headerlink" title="&#x914D;&#x7F6E;&#x6587;&#x4EF6;"></a>&#x914D;&#x7F6E;&#x6587;&#x4EF6;</h2><p>&#x5728;&#x6574;&#x4E2A;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x548C;&#x6C99;&#x76D2;&#x673A;&#x5236;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x5C06;&#x7B7E;&#x540D;&#xFF0C;&#x6388;&#x6743;&#x548C;&#x6C99;&#x76D2;&#x8054;&#x7CFB;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x914D;&#x7F6E;&#x6587;&#x4EF6; (provisioning profiles)&#x3002;</p>
<p>&#x6BCF;&#x4E00;&#x4E2A; iOS &#x5F00;&#x53D1;&#x8005;&#x53EF;&#x80FD;&#x90FD;&#x82B1;&#x8D39;&#x8FC7;&#x76F8;&#x5F53;&#x7684;&#x65F6;&#x95F4;&#x7814;&#x7A76;&#x5982;&#x4F55;&#x8BBE;&#x7F6E;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x8FD9;&#x4E2A;&#x73AF;&#x8282;&#x4E5F;&#x6B63;&#x662F;&#x4F1A;&#x7ECF;&#x5E38;&#x51FA;&#x95EE;&#x9898;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x5B58;&#x653E;&#x4E86;&#x7CFB;&#x7EDF;&#x7528;&#x4E8E;&#x5224;&#x65AD;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x662F;&#x5426;&#x5141;&#x8BB8;&#x8FD0;&#x884C;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#x5982;&#x679C;&#x4F60;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x4FEE;&#x590D;&#x8D77;&#x6765;&#x4F1A;&#x76F8;&#x5F53;&#x70E6;&#x4EBA;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x662F;&#x4E00;&#x7EC4;&#x4FE1;&#x606F;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x8FD9;&#x7EC4;&#x4FE1;&#x606F;&#x51B3;&#x5B9A;&#x4E86;&#x67D0;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x662F;&#x5426;&#x80FD;&#x591F;&#x5728;&#x67D0;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x8BBE;&#x5907;&#x4E0A;&#x8FD0;&#x884C;&#x3002;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x8BA9;&#x5E94;&#x7528;&#x5728;&#x4F60;&#x7684;&#x5F00;&#x53D1;&#x8BBE;&#x5907;&#x4E0A;&#x53EF;&#x4EE5;&#x88AB;&#x8FD0;&#x884C;&#x548C;&#x8C03;&#x8BD5;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5185;&#x90E8;&#x6D4B;&#x8BD5; (ad-hoc) &#x6216;&#x8005;&#x4F01;&#x4E1A;&#x7EA7;&#x5E94;&#x7528;&#x7684;&#x53D1;&#x5E03;&#x3002;Xcode &#x4F1A;&#x5C06;&#x4F60;&#x5728; project setting &#x4E2D;&#x9009;&#x62E9;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x6253;&#x5305;&#x8FDB;&#x5E94;&#x7528;&#x3002;&#x524D;&#x9762;&#x63D0;&#x5230;&#x4E86;&#xFF0C;&#x9009;&#x62E9;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x662F; Xcode 6 &#x624D;&#x63D0;&#x4F9B;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x5728; Xcode 5 &#x6216;&#x66F4;&#x65E9;&#x7248;&#x672C;&#x4E2D;&#xFF0C;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x662F; Xcode &#x6839;&#x636E;&#x4F60;&#x9009;&#x62E9;&#x7684;&#x7B7E;&#x540D;&#x8BC1;&#x4E66;&#x6765;&#x9009;&#x62E9;&#x7684;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#x540C;&#x4E00;&#x4E2A;&#x8BC1;&#x4E66;&#x53EF;&#x4EE5;&#x62E5;&#x6709;&#x591A;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x56E0;&#x6B64;&#x8BA9; Xcode &#x81EA;&#x884C;&#x9009;&#x62E9;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#xFF0C;&#x6700;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x4F60;&#x81EA;&#x4E3B;&#x53BB;&#x9009;&#x62E9;&#xFF0C;&#x5728; Xcode 6 &#x4E2D;&#x7EC8;&#x4E8E;&#x63D0;&#x4F9B;&#x4E86;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x3002;</p>
<p><img src="/2016/11/06/&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x63A2;&#x6790;/4.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x4E0B;&#x9762;&#x6765;&#x4ED4;&#x7EC6;&#x7814;&#x7A76;&#x4E00;&#x4E0B;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8981;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x673A;&#x5668;&#x4E0A;&#x627E;&#x5230;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x4E0B; ~/Library/MobileDevice/Provisioning Profiles&#x3002;Xcode &#x5C06;&#x4ECE;&#x5F00;&#x53D1;&#x8005;&#x4E2D;&#x5FC3;&#x4E0B;&#x8F7D;&#x7684;&#x5168;&#x90E8;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x90FD;&#x653E;&#x5728;&#x4E86;&#x8FD9;&#x91CC;&#x3002;</p>
<p>&#x4E0D;&#x8981;&#x60CA;&#x8BB6;&#xFF0C;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A; plist &#x6587;&#x4EF6;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x6839;&#x636E;&#x5BC6;&#x7801;&#x8BAF;&#x606F;&#x8BED;&#x6CD5; (Cryptographic Message Syntax) &#x52A0;&#x5BC6;&#x7684;&#x6587;&#x4EF6;&#xFF08;&#x4E0B;&#x6587;&#x4E2D;&#x4F1A;&#x7B80;&#x79F0; CMS&#xFF0C;&#x4F46;&#x4E0D;&#x8981;&#x7528;&#x8FD9;&#x4E2A;&#x7B80;&#x5199; Google&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x5173;&#x952E;&#x5B57;&#xFF09;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5904;&#x7406;&#x8FC7; S/MIME &#x90AE;&#x4EF6;&#x6216;&#x8005;&#x8BC1;&#x4E66;&#x4F60;&#x4F1A;&#x5BF9;&#x8FD9;&#x79CD;&#x52A0;&#x5BC6;&#x6BD4;&#x8F83;&#x719F;&#x6089;&#xFF0C;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x4E92;&#x8054;&#x7F51;&#x5DE5;&#x7A0B;&#x4EFB;&#x52A1;&#x7EC4; (IETF) &#x5236;&#x5B9A;&#x7684; RFC 3852&#x3002;</p>
<p>&#x91C7;&#x7528; CMS &#x683C;&#x5F0F;&#x8FDB;&#x884C;&#x52A0;&#x5BC6;&#x4F7F;&#x5F97;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x53EF;&#x4EE5;&#x88AB;&#x8BBE;&#x7F6E;&#x7B7E;&#x540D;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x82F9;&#x679C;&#x7ED9;&#x4F60;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x4E4B;&#x540E;&#x6587;&#x4EF6;&#x5C31;&#x4E0D;&#x80FD;&#x88AB;&#x6539;&#x53D8;&#x4E86;&#x3002;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7684;&#x7B7E;&#x540D;&#x548C;&#x5E94;&#x7528;&#x7684;&#x7B7E;&#x540D;&#x4E0D;&#x662F;&#x4E00;&#x56DE;&#x4E8B;&#xFF0C;&#x5B83;&#x662F;&#x7531;&#x82F9;&#x679C;&#x76F4;&#x63A5;&#x5728;&#x5F00;&#x53D1;&#x8005;&#x4E2D;&#x5FC3; (developer portal) &#x4E2D;&#x8BBE;&#x7F6E;&#x597D;&#x4E86;&#x7684;&#x3002;</p>
<p>&#x67D0;&#x4E9B;&#x7248;&#x672C;&#x7684; OpenSSL &#x53EF;&#x4EE5;&#x8BFB;&#x53D6;&#x8FD9;&#x79CD;&#x683C;&#x5F0F;&#xFF0C;&#x4F46;&#x662F; OS X &#x81EA;&#x5E26;&#x90A3;&#x4E2A;&#x7248;&#x672C;&#x5E76;&#x4E0D;&#x884C;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177; security &#x4E5F;&#x53EF;&#x4EE5;&#x89E3;&#x7801;&#x8FD9;&#x4E2A; CMS &#x683C;&#x5F0F;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5C31;&#x7528; security &#x6765;&#x770B;&#x770B;&#x4E00;&#x4E2A; .mobileprovision &#x6587;&#x4EF6;&#x5185;&#x90E8;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">security cms -D -i example.mobileprovision</div></pre></td></tr></table></figure>
<p>&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x4F1A;&#x8F93;&#x51FA;&#x7B7E;&#x540D;&#x4FE1;&#x606F;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4EB2;&#x81EA;&#x8BD5;&#x4E00;&#x4E0B;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x4F60;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A; XML &#x683C;&#x5F0F;&#x7684; plist &#x6587;&#x4EF6;&#x5185;&#x5BB9;&#x8F93;&#x51FA;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x5217;&#x8868;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x662F; iOS &#x7528;&#x4E8E;&#x5224;&#x65AD;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x662F;&#x5426;&#x80FD;&#x8FD0;&#x884C;&#x5728;&#x67D0;&#x4E2A;&#x8BBE;&#x5907;&#x4E0A;&#x771F;&#x6B63;&#x9700;&#x8981;&#x7684;&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x90FD;&#x6709;&#x5B83;&#x81EA;&#x5DF1;&#x7684; UUID &#x3002;Xcode &#x4F1A;&#x7528;&#x8FD9;&#x4E2A; UUID &#x6765;&#x4F5C;&#x4E3A;&#x6807;&#x8BC6;&#xFF0C;&#x8BB0;&#x5F55;&#x4F60;&#x5728; build settings &#x4E2D;&#x9009;&#x62E9;&#x4E86;&#x54EA;&#x4E00;&#x4E2A;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3002;</p>
<p>&#x9996;&#x5148;&#x6765;&#x770B; DeveloperCertificates &#x8FD9;&#x9879;&#xFF0C;&#x8FD9;&#x4E00;&#x9879;&#x662F;&#x4E00;&#x4E2A;&#x5217;&#x8868;&#xFF0C;&#x5305;&#x542B;&#x4E86;&#x53EF;&#x4EE5;&#x4E3A;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7684;&#x5E94;&#x7528;&#x7B7E;&#x540D;&#x7684;&#x6240;&#x6709;&#x8BC1;&#x4E66;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x4E0D;&#x5728;&#x8FD9;&#x4E2A;&#x5217;&#x8868;&#x4E2D;&#x7684;&#x8BC1;&#x4E66;&#x8FDB;&#x884C;&#x7B7E;&#x540D;&#xFF0C;&#x65E0;&#x8BBA;&#x8FD9;&#x4E2A;&#x8BC1;&#x4E66;&#x662F;&#x5426;&#x6709;&#x6548;&#xFF0C;&#x8FD9;&#x4E2A;&#x5E94;&#x7528;&#x90FD;&#x65E0;&#x6CD5;&#x8FD0;&#x884C;&#x3002;&#x6240;&#x6709;&#x7684;&#x8BC1;&#x4E66;&#x90FD;&#x662F;&#x57FA;&#x4E8E; Base64 &#x7F16;&#x7801;&#x7B26;&#x5408; PEM (Privacy Enhanced Mail, RFC 1848) &#x683C;&#x5F0F;&#x7684;&#x3002;&#x8981;&#x67E5;&#x770B;&#x4E00;&#x4E2A;&#x8BC1;&#x4E66;&#x7684;&#x8BE6;&#x7EC6;&#x5185;&#x5BB9;&#xFF0C;&#x5C06;&#x7F16;&#x7801;&#x8FC7;&#x7684;&#x6587;&#x4EF6;&#x5185;&#x5BB9;&#x590D;&#x5236;&#x7C98;&#x8D34;&#x5230;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x4E2D;&#x53BB;&#xFF0C;&#x50CF;&#x4E0B;&#x9762;&#x8FD9;&#x6837;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div></pre></td><td class="code"><pre><div class="line"></div><div class="line">-----BEGIN CERTIFICATE-----</div><div class="line">MIIFnjCCBIagAwIBAgIIE/IgVItTuH4wDQYJKoZIhvcNAQEFBQAwgZYxCzA&#x2026;</div><div class="line">-----END CERTIFICATE-----</div><div class="line"></div></pre></td></tr></table></figure>
<p>&#x7136;&#x540E;&#x8BA9; OpenSSL &#x6765;&#x5904;&#x7406; openssl x509 -text -in file.pem&#x3002;</p>
<p>&#x56DE;&#x5230;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x7EE7;&#x7EED;&#x5F80;&#x4E0B;&#x770B;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#x5728; Entitlements &#x4E00;&#x9879;&#x4E2D;&#x5305;&#x542B;&#x4E86;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7684;&#x6240;&#x6709;&#x6388;&#x6743;&#x4FE1;&#x606F;&#xFF0C;&#x952E;&#x503C;&#x5C31;&#x548C;&#x4E4B;&#x524D;&#x5728;&#x6388;&#x6743;&#x90A3;&#x8282;&#x770B;&#x5230;&#x7684;&#x4E00;&#x6A21;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x6388;&#x6743;&#x4FE1;&#x606F;&#x662F;&#x4F60;&#x5728;&#x5F00;&#x53D1;&#x8005;&#x4E2D;&#x5FC3;&#x4E0B;&#x8F7D;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x65F6;&#x5728; App ID &#x4E2D;&#x8BBE;&#x7F6E;&#x7684;&#xFF0C;&#x7406;&#x60F3;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x5E94;&#x8BE5;&#x548C; Xcode &#x4E3A;&#x5E94;&#x7528;&#x8BBE;&#x7F6E;&#x7B7E;&#x540D;&#x65F6;&#x4F7F;&#x7528;&#x7684;&#x90A3;&#x4E00;&#x4E2A;&#x540C;&#x6B65;&#xFF0C;&#x4F46;&#x8FD9;&#x79CD;&#x540C;&#x6B65;&#x5E76;&#x4E0D;&#x80FD;&#x5F97;&#x5230;&#x4FDD;&#x8BC1;&#x3002;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x4E0D;&#x4E00;&#x81F4;&#x662F;&#x6BD4;&#x8F83;&#x96BE;&#x53D1;&#x73B0;&#x7684;&#x95EE;&#x9898;&#x4E4B;&#x4E00;&#x3002;</p>
<p>&#x4E3E;&#x4F8B;&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5728; Xcode &#x4E2D;&#x6DFB;&#x52A0;&#x4E86; iCloud &#x952E;&#x503C;&#x5BF9;&#x5B58;&#x50A8;&#x6388;&#x6743; (com.apple.developer.ubiquity-kvstore-identifier)&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x66F4;&#x65B0;&#xFF0C;&#x91CD;&#x65B0;&#x8BBE;&#x7F6E;&#x5E76;&#x4E0B;&#x8F7D;&#x65B0;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x65E7;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x89C4;&#x5B9A;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x5E76;&#x6CA1;&#x6709;&#x8FD9;&#x4E00;&#x9879;&#x6388;&#x6743;&#x3002;&#x90A3;&#x4E48;&#x5982;&#x679C;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x4F7F;&#x7528;&#x4E86;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;iOS &#x5C31;&#x4F1A;&#x62D2;&#x7EDD;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x8FD0;&#x884C;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x5F53;&#x4F60;&#x5728;&#x5F00;&#x53D1;&#x8005;&#x4E2D;&#x5FC3;&#x7F16;&#x8F91;&#x4E86;&#x5E94;&#x7528;&#x7684;&#x6388;&#x6743;&#xFF0C;&#x5BF9;&#x5E94;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4F1A;&#x88AB;&#x6807;&#x8BB0;&#x4E3A;&#x65E0;&#x6548;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x6253;&#x5F00;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x5F00;&#x53D1;&#x6D4B;&#x8BD5;&#x7684;&#x8BC1;&#x4E66;&#xFF0C;&#x4F60;&#x4F1A;&#x770B;&#x5230;&#x4E00;&#x9879; ProvisionedDevices&#xFF0C;&#x5728;&#x8FD9;&#x4E00;&#x9879;&#x91CC;&#x5305;&#x542B;&#x4E86;&#x6240;&#x6709;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x6D4B;&#x8BD5;&#x7684;&#x8BBE;&#x5907;&#x5217;&#x8868;&#x3002;&#x56E0;&#x4E3A;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x9700;&#x8981;&#x88AB;&#x82F9;&#x679C;&#x7B7E;&#x540D;&#xFF0C;&#x6240;&#x4EE5;&#x6BCF;&#x6B21;&#x4F60;&#x6DFB;&#x52A0;&#x4E86;&#x65B0;&#x7684;&#x8BBE;&#x5907;&#x8FDB;&#x53BB;&#x5C31;&#x8981;&#x91CD;&#x65B0;&#x4E0B;&#x8F7D;&#x65B0;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3002;</p>
<h2 id="&#x5C0F;&#x7ED3;"><a href="#&#x5C0F;&#x7ED3;" class="headerlink" title="&#x5C0F;&#x7ED3;"></a>&#x5C0F;&#x7ED3;</h2><p>&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x548C;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x8FD9;&#x4E00;&#x5957;&#x5927;&#x6982;&#x662F;&#x4E00;&#x4E2A; iOS &#x5F00;&#x53D1;&#x8005;&#x5FC5;&#x987B;&#x5904;&#x7406;&#x7684;&#x4EC5;&#x6B21;&#x4E8E;&#x7F16;&#x7801;&#x7684;&#x6700;&#x590D;&#x6742;&#x7684;&#x95EE;&#x9898;&#x4E4B;&#x4E00;&#x3002;&#x4E0E;&#x5728; Mac &#x6216; PC &#x4E0A;&#x76F4;&#x63A5;&#x7684;&#x7F16;&#x8BD1;&#x8FD0;&#x884C;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x4E0D;&#x540C;&#xFF0C;&#x5904;&#x7406;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x4F1A;&#x662F;&#x975E;&#x5E38;&#x4E0D;&#x540C;&#x7684;&#x7ECF;&#x5386;&#x3002;</p>
<p>&#x867D;&#x7136;&#x4E86;&#x89E3;&#x6BCF;&#x4E00;&#x4E2A;&#x90E8;&#x5206;&#x662F;&#x600E;&#x4E48;&#x8FD0;&#x4F5C;&#x7684;&#x5F88;&#x6709;&#x5E2E;&#x52A9;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x63A7;&#x5236;&#x597D;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x8BBE;&#x7F6E;&#x548C;&#x5DE5;&#x5177;&#x5176;&#x5B9E;&#x662F;&#x4E00;&#x4EF6;&#x5F88;&#x6D88;&#x8017;&#x65F6;&#x95F4;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x4E2D;&#xFF0C;&#x5230;&#x5904;&#x53D1;&#x9001;&#x8BC1;&#x4E66;&#x548C;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x663E;&#x7136;&#x5F88;&#x4E0D;&#x65B9;&#x4FBF;&#x3002;&#x867D;&#x7136;&#x82F9;&#x679C;&#x5728;&#x6700;&#x8FD1;&#x51E0;&#x6B21;&#x53D1;&#x5E03;&#x7684; Xcode &#x4E2D;&#x90FD;&#x5C1D;&#x8BD5;&#x6539;&#x5584;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4E0D;&#x662F;&#x5F88;&#x786E;&#x5B9A;&#x6BCF;&#x4E00;&#x9879;&#x6539;&#x52A8;&#x90FD;&#x8D77;&#x5230;&#x4E86;&#x597D;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x5904;&#x7406;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x662F;&#x6BCF;&#x4E2A;&#x5F00;&#x53D1;&#x8005;&#x5FC5;&#x8FC7;&#x7684;&#x5927;&#x5751;&#x3002;</p>
<p>&#x867D;&#x7136;&#x5904;&#x7406;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x5BF9;&#x4E8E;&#x5F00;&#x53D1;&#x8005;&#x6765;&#x8BF4;&#x975E;&#x5E38;&#x7E41;&#x7410;&#xFF0C;&#x4F46;&#x4E0D;&#x53EF;&#x5426;&#x8BA4;&#x6B63;&#x662F;&#x5B83;&#x4F7F;&#x5F97; iOS &#x5BF9;&#x4E8E;&#x7528;&#x6237;&#x6765;&#x8BF4;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5B89;&#x5168;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6CE8;&#x610F;&#x5B89;&#x5168;&#x76F8;&#x5173;&#x7684;&#x65B0;&#x95FB;&#xFF0C;&#x6BCF;&#x4E00;&#x6B21;&#x51FA;&#x73B0;&#x53F7;&#x79F0;&#x80FD;&#x5728; iOS &#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x6728;&#x9A6C;&#x6216;&#x8005;&#x6076;&#x610F;&#x8F6F;&#x4EF6;&#xFF0C;&#x4F8B;&#x5982;&#x4E0D;&#x600E;&#x4E48;&#x51FA;&#x540D;&#x7684; FinFisher&#xFF0C;&#x4ED4;&#x7EC6;&#x770B;&#x770B;&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#xFF0C;&#x90FD;&#x4F1A;&#x5199;&#x660E; &#x201C;&#x9700;&#x8981;&#x8D8A;&#x72F1;&#x201D;&#x3002;&#x8BF4;&#x5B9E;&#x8BDD;&#x6211;&#x8FD8;&#x6CA1;&#x89C1;&#x8FC7;&#x9762;&#x5411; iOS &#x7684;&#x4E0D;&#x9700;&#x8981;&#x8D8A;&#x72F1;&#x7684;&#x75C5;&#x6BD2;&#x6216;&#x8005;&#x6728;&#x9A6C;&#x3002;<br>&#x6240;&#x4EE5;&#x4E3A;&#x4EE3;&#x7801;&#x7B7E;&#x540D;&#x548C;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x8FDB;&#x884C;&#x7684;&#x8FD9;&#x4E9B;&#x9EBB;&#x70E6;&#x8BBE;&#x7F6E;&#x5E76;&#x4E0D;&#x662F;&#x5F92;&#x52B3;&#x65E0;&#x529F;&#x3002;</p>
<p>&#x611F;&#x8C22;</p>
<p><a href="https://www.objc.io/issues/17-security/inside-code-signing/" target="_blank" rel="external">https://www.objc.io/issues/17-security/inside-code-signing/</a></p>

      
    </div><!-- .entry-content -->

    <footer class="entry-meta">
    <a href="/2016/11/06/代码签名探析/">
    <time datetime="2016-11-06T03:11:53.000Z" class="entry-date">
        2016-11-06
    </time>
</a>
    
  <span class="article-delim">&#8226;</span>
  <div class="article-category">
  <a class="article-category-link" href="/categories/iOS/">iOS</a>
  </div>

    
    </footer>
</article>


    
<nav class="nav-single">
    <h3 class="assistive-text">文章导航</h3>
    
        <span class="nav-previous"><a href="/2016/11/06/iOS非越狱微信自动抢红包/" rel="prev"><span class="meta-nav">←</span> iOS非越狱微信自动抢红包</a></span>
    
    
        <span class="nav-next"><a href="/2016/11/06/AES-Base64数据混合加密与解密/" rel="next">AES+Base64数据混合加密与解密 <span class="meta-nav">→</span></a></span>
    
</nav><!-- .nav-single -->







</div></div>
        <div id="secondary" class="widget-area" role="complementary">
  
    <aside id="search" class="widget widget_search"><form role="search" method="get" accept-charset="utf-8" id="searchform" class="searchform" action="//google.com/search">
    <div>
        <input type="text" value="" name="s" id="s" />
        <input type="submit" id="searchsubmit" value="搜索" />
    </div>
</form></aside>
  
    
  
    
  <aside class="widget">
    <h3 class="widget-title">Categories</h3>
    <div class="widget-content">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/LIFE/">LIFE</a><span class="category-list-count">3</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/MAC/">MAC</a><span class="category-list-count">3</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/iOS/">iOS</a><span class="category-list-count">20</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/御宅文化/">御宅文化</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/编程/">编程</a><span class="category-list-count">52</span></li></ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Recents</h3>
    <div class="widget-content">
      <ul>
        
          <li>
            <a href="/2016/11/18/如何使用VIM/">如何使用Vim</a>
          </li>
        
          <li>
            <a href="/2016/11/18/从零开始学习Linux-13/">从零开始学习Linux-13</a>
          </li>
        
          <li>
            <a href="/2016/11/18/从零开始学习Linux-12/">从零开始学习Linux-12</a>
          </li>
        
          <li>
            <a href="/2016/11/18/cmatrix的安装/">cmatrix的安装</a>
          </li>
        
          <li>
            <a href="/2016/11/18/从零开始学习Linux-11/">从零开始学习Linux-11</a>
          </li>
        
      </ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Tags</h3>
    <div class="widget-content">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/Cocoapods/">Cocoapods</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/HTML/">HTML</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Linux/">Linux</a><span class="tag-list-count">15</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Matlab/">Matlab</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIColor/">UIColor</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView/">UIView</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView-圆角/">UIView-圆角</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Vim/">Vim</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/bug/">bug</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/hexo/">hexo</a><span class="tag-list-count">4</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/指针/">指针</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/数据结构/">数据结构</a><span class="tag-list-count">20</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/算法/">算法</a><span class="tag-list-count">8</span></li></ul>
    </div>
  </aside>

  
    
<div class="widget tag">
<h3 class="title">blogroll</h3>
<ul class="entry">


<li><a href="https://github.com/" target="_blank">github</a></li>


<li><a href="http://www.jianshu.com/users/41cd7711ed44/latest_articles" target="_blank">我的简书主页</a></li>

</ul>
</div>

  
</div>
      </div>
      <footer id="colophon" role="contentinfo">
    <p>&copy; 2016 SaberDa
    All rights reserved.</p>
    <p>Powered by <a href="http://hexo.io/" target="_blank">Hexo</a></p>
</footer>
    <script>window._bd_share_config={"common":{"bdSnsKey":{},"bdText":"","bdMini":"1","bdMiniList":false,"bdPic":"","bdStyle":"2","bdSize":"16"},"share":{}};with(document)0[(getElementsByTagName('head')[0]||body).appendChild(createElement('script')).src='http://bdimg.share.baidu.com/static/api/js/share.js?v=89860593.js?cdnversion='+~(-new Date()/36e5)];</script>

<script src="/js/jquery-2.0.3.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

<script src="/js/navigation.js"></script>

<div id="bg"></div>

  </div>
</body>
</html>