<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  
  <meta name="description" content="阿尔托利亚是我老婆~" />
  

  
  
  
  
  
  
  <title>从零开始学习Linux-12 | SaberDa的幻想乡</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="Linux&amp;#x4E2D;&amp;#x4E5F;&amp;#x96BE;&amp;#x514D;&amp;#x9047;&amp;#x5230;&amp;#x67D0;&amp;#x4E2A;&amp;#x7A0B;&amp;#x5E8F;&amp;#x65E0;&amp;#x54CD;&amp;#x5E94;&amp;#x7684;&amp;#x60C5;&amp;#x51B5;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x901A;&amp;#x8FC7;&amp;#x4E00;&amp;#x4E9B;&amp;#x547D;&amp;#x">
<meta property="og:type" content="article">
<meta property="og:title" content="从零开始学习Linux-12">
<meta property="og:url" content="https://saberda.github.io/2016/11/18/从零开始学习Linux-12/index.html">
<meta property="og:site_name" content="SaberDa的幻想乡">
<meta property="og:description" content="Linux&amp;#x4E2D;&amp;#x4E5F;&amp;#x96BE;&amp;#x514D;&amp;#x9047;&amp;#x5230;&amp;#x67D0;&amp;#x4E2A;&amp;#x7A0B;&amp;#x5E8F;&amp;#x65E0;&amp;#x54CD;&amp;#x5E94;&amp;#x7684;&amp;#x60C5;&amp;#x51B5;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x901A;&amp;#x8FC7;&amp;#x4E00;&amp;#x4E9B;&amp;#x547D;&amp;#x">
<meta property="og:image" content="https://saberda.github.io/2016/11/18/从零开始学习Linux-12/1.png">
<meta property="og:image" content="https://saberda.github.io/2016/11/18/从零开始学习Linux-12/2.png">
<meta property="og:updated_time" content="2016-11-18T12:25:28.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="从零开始学习Linux-12">
<meta name="twitter:description" content="Linux&amp;#x4E2D;&amp;#x4E5F;&amp;#x96BE;&amp;#x514D;&amp;#x9047;&amp;#x5230;&amp;#x67D0;&amp;#x4E2A;&amp;#x7A0B;&amp;#x5E8F;&amp;#x65E0;&amp;#x54CD;&amp;#x5E94;&amp;#x7684;&amp;#x60C5;&amp;#x51B5;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x901A;&amp;#x8FC7;&amp;#x4E00;&amp;#x4E9B;&amp;#x547D;&amp;#x">
<meta name="twitter:image" content="https://saberda.github.io/2016/11/18/从零开始学习Linux-12/1.png">
  
  
    <link rel="icon" href="/css/images/favicon.ico">
  
  <link rel="stylesheet" href="/css/style.css">
  

  
  <!-- baidu webmaster push -->
  <script src='//push.zhanzhang.baidu.com/push.js'></script>
</head>
<body class="home blog custom-background custom-font-enabled single-author">
  <div id="page" class="hfeed site">
      <header id="masthead" class="site-header" role="banner">
    <hgroup>
      <h1 class="site-title">
        <a href="/" title="SaberDa的幻想乡" rel="home">SaberDa的幻想乡</a>
      </h1>
      
        <h2 class="site-description">
          <a href="/" id="subtitle">　　iOS　　|　　二次元　　|　　630991493@qq.com　　|　　我生而坚强 只要不死 就能笑的猖狂</a>
        </h2>
      
    </hgroup>

    <nav id="site-navigation" class="main-navigation" role="navigation">
            <button class="menu-toggle">菜单</button>
            <a class="assistive-text" href="/#content" title="跳至内容">跳至内容</a><!--TODO-->
            <div class="menu-main-container">
                <ul id="menu-main" class="nav-menu">
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/archives">所有文章</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/">主页</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/编程/">编程</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/iOS/">iOS</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/ML/">ML</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/PGM/">PGM</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/MAC/">MAC</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/御宅文化/">御宅文化</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/LIFE/">LIFE</a></li>
                
                </ul>
            </div>
    </nav>
</header>
      <div id="main" class="wrapper">
        <div id="primary" class="site-content"><div id="content" role="main"><article id="post-从零开始学习Linux-12" class="post-从零开始学习Linux-12 post type-post status-publish format-standard hentry">
    <!---->

      <header class="entry-header">
        
        
  
    <h1 class="entry-title article-title">
      从零开始学习Linux-12
    </h1>
  

        
        <div class="comments-link">
            
            <a href="javascript:void(0);" data-url="https://saberda.github.io/2016/11/18/从零开始学习Linux-12/" data-id="cj06ewcla003lw2b3xhzlocej" class="leave-reply bdsharebuttonbox" data-cmd="more">Share</a>
        </div><!-- .comments-link -->
      </header><!-- .entry-header -->

    <div class="entry-content">
      
        <pre><code>Linux&#x4E2D;&#x4E5F;&#x96BE;&#x514D;&#x9047;&#x5230;&#x67D0;&#x4E2A;&#x7A0B;&#x5E8F;&#x65E0;&#x54CD;&#x5E94;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x547D;&#x4EE4;&#x6765;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x8BA9;&#x7CFB;&#x7EDF;&#x80FD;&#x591F;&#x66F4;&#x6D41;&#x7545;&#x7684;&#x8FD0;&#x884C;&#xFF0C;&#x800C;&#x5728;&#x6B64;&#x4E4B;&#x524D;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5BF9;&#x8FDB;&#x7A0B;&#x7684;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x4E86;&#x89E3;&#xFF0C;&#x624D;&#x80FD;&#x66F4;&#x597D;&#x66F4;&#x6709;&#x6548;&#x7387;&#x7684;&#x4F7F;&#x7528;Linux&#x63D0;&#x4F9B;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x5E76;&#x5C06;&#x638C;&#x63E1;&#x4E00;&#x4E9B; Linux &#x6240;&#x63D0;&#x4F9B;&#x7684;&#x5DE5;&#x5177;&#x6765;&#x8FDB;&#x884C;&#x8FDB;&#x7A0B;&#x7684;&#x67E5;&#x770B;&#x4E0E;&#x63A7;&#x5236;&#xFF0C;&#x638C;&#x63E1;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x8BA9;&#x6211;&#x4EEC;&#x80FD;&#x5728;&#x67D0;&#x4E9B;&#x8FDB;&#x7A0B;&#x51FA;&#x5F02;&#x5E38;&#x7684;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x80FD;&#x53CA;&#x65F6;&#x7684;&#x89E3;&#x51B3;&#x4E0E;&#x67E5;&#x770B;
</code></pre><h2 id="&#x8FDB;&#x7A0B;&#x4E0E;&#x7A0B;&#x5E8F;&#x6982;&#x5FF5;&#x7684;&#x7406;&#x89E3;"><a href="#&#x8FDB;&#x7A0B;&#x4E0E;&#x7A0B;&#x5E8F;&#x6982;&#x5FF5;&#x7684;&#x7406;&#x89E3;" class="headerlink" title="&#x8FDB;&#x7A0B;&#x4E0E;&#x7A0B;&#x5E8F;&#x6982;&#x5FF5;&#x7684;&#x7406;&#x89E3;"></a>&#x8FDB;&#x7A0B;&#x4E0E;&#x7A0B;&#x5E8F;&#x6982;&#x5FF5;&#x7684;&#x7406;&#x89E3;</h2><p>&#x9996;&#x5148;&#x7A0B;&#x5E8F;&#x4E0E;&#x8FDB;&#x7A0B;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x7A0B;&#x5E8F;&#x4E0E;&#x8FDB;&#x7A0B;&#x53C8;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#xFF1F;</p>
<p><strong>&#x7A0B;&#x5E8F;</strong>&#xFF08;procedure&#xFF09;&#x4E0D;&#x592A;&#x7CBE;&#x786E;&#x5730;&#x8BF4;&#xFF0C;&#x7A0B;&#x5E8F;&#x5C31;&#x662F;&#x6267;&#x884C;&#x4E00;&#x7CFB;&#x5217;&#x6709;&#x903B;&#x8F91;&#xFF0C;&#x6709;&#x987A;&#x5E8F;&#x7ED3;&#x6784;&#x7684;&#x6307;&#x4EE4;&#xFF0C;&#x4E3A;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x6240;&#x9700;&#x8981;&#x7684;&#x670D;&#x52A1;&#x3002;&#x5C31;&#x5982;&#x6211;&#x4EEC;&#x53BB;&#x9910;&#x9986;&#xFF0C;&#x7ED9;&#x670D;&#x52A1;&#x5458;&#x8BF4;&#x6211;&#x8981;&#x725B;&#x8089;&#x76D6;&#x6D47;&#x996D;&#xFF0C;&#x5979;&#x6267;&#x884C;&#x4E86;&#x505A;&#x725B;&#x8089;&#x76D6;&#x6D47;&#x996D;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x6700;&#x540E;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x4E86;&#x8FD9;&#x4E48;&#x4E00;&#x76D8;&#x725B;&#x8089;&#x76D6;&#x6D47;&#x996D;&#x3002;&#x5B83;&#x9700;&#x8981;&#x53BB;&#x6267;&#x884C;&#xFF0C;&#x4E0D;&#x7136;&#x5B83;&#x5C31;&#x50CF;&#x4E00;&#x672C;&#x6B66;&#x529F;&#x79D8;&#x7C4D;&#xFF0C;&#x653E;&#x5728;&#x90A3;&#x91CC;&#x3002;</p>
<a id="more"></a>
<p><strong>&#x8FDB;&#x7A0B;</strong>&#xFF08;process&#xFF09;&#x8FDB;&#x7A0B;&#x662F;&#x7A0B;&#x5E8F;&#x5728;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x5408;&#x4E0A;&#x7684;&#x4E00;&#x6B21;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#xFF0C;&#x5728;&#x65E9;&#x671F;&#x7684;UNIX&#xFF0C;Linux 2.4&#x53CA;&#x66F4;&#x65E9;&#x7684;&#x7248;&#x672C;&#x4E2D;&#xFF0C;&#x5B83;&#x662F;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x8D44;&#x6E90;&#x5206;&#x914D;&#x548C;&#x8C03;&#x5EA6;&#x7684;&#x72EC;&#x7ACB;&#x57FA;&#x672C;&#x5355;&#x4F4D;&#x3002;&#x540C;&#x4E0A;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5C31;&#x5982;&#x6211;&#x4EEC;&#x53BB;&#x4E86;&#x9910;&#x9986;&#xFF0C;&#x7ED9;&#x670D;&#x52A1;&#x5458;&#x8BF4;&#x6211;&#x8981;&#x725B;&#x8089;&#x76D6;&#x6D47;&#x996D;&#xFF0C;&#x5979;&#x6267;&#x884C;&#x4E86;&#x505A;&#x725B;&#x8089;&#x76D6;&#x6D47;&#x996D;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x800C;&#x91CC;&#x9762;&#x505A;&#x996D;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF0C;&#x8D85;&#x725B;&#x8089;&#x6C64;&#x6C41;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF0C;&#x628A;&#x725B;&#x8089;&#x6C64;&#x6C41;&#x4E0E;&#x996D;&#x6DF7;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF0C;&#x628A;&#x996D;&#x7AEF;&#x4E0A;&#x684C;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x3002;&#x5B83;&#x5C31;&#x50CF;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x770B;&#x6B66;&#x529F;&#x79D8;&#x7C4D;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x7136;&#x540E;&#x4E00;&#x4E2A;&#x7BC7;&#x7AE0;&#x4E00;&#x4E2A;&#x7BC7;&#x7AE0;&#x7684;&#x53BB;&#x7EC3;</p>
<p>&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x7A0B;&#x5E8F;&#x662F;&#x4E3A;&#x4E86;&#x5B8C;&#x6210;&#x67D0;&#x79CD;&#x4EFB;&#x52A1;&#x800C;&#x8BBE;&#x8BA1;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x6BD4;&#x5982;vim&#x662F;&#x7A0B;&#x5E8F;&#x3002;&#x4EC0;&#x4E48;&#x662F;&#x8FDB;&#x7A0B;&#x5462;&#xFF1F;&#x8FDB;&#x7A0B;&#x5C31;&#x662F;&#x8FD0;&#x884C;&#x4E2D;&#x7684;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x7A0B;&#x5E8F;&#x53EA;&#x662F;&#x4E00;&#x4E9B;&#x5217;&#x6307;&#x4EE4;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x9759;&#x6B62;&#x7684;&#x5B9E;&#x4F53;&#xFF0C;&#x800C;&#x8FDB;&#x7A0B;&#x4E0D;&#x540C;&#xFF0C;&#x8FDB;&#x7A0B;&#x6709;&#x4E00;&#x4E0B;&#x7684;&#x7279;&#x6027;</p>
<ul>
<li>&#x52A8;&#x6001;&#x6027;&#xFF1A;&#x8FDB;&#x7A0B;&#x7684;&#x5B9E;&#x8D28;&#x662F;&#x8FDB;&#x7A0B;&#x5B9E;&#x4F53;&#x7684;&#x4E00;&#x6B21;&#x6267;&#x884C;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x6709;&#x521B;&#x5EFA;&#xFF0C;&#x64A4;&#x9500;&#x7B49;&#x72B6;&#x6001;&#x7684;&#x53D8;&#x5316;&#x3002;&#x800C;&#x7A0B;&#x5E8F;&#x662F;&#x4E00;&#x4E2A;&#x9759;&#x6001;&#x7684;&#x5B9E;&#x4F53;</li>
<li>&#x5E76;&#x53D1;&#x6027;&#xFF1A;&#x8FDB;&#x7A0B;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x5728;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6BB5;&#x5185;&#xFF0C;&#x6709;&#x591A;&#x4E2A;&#x7A0B;&#x5E8F;&#x5728;&#x8FD0;&#x884C;&#x4E2D;&#x3002;&#x7A0B;&#x5E8F;&#x53EA;&#x662F;&#x9759;&#x6001;&#x7684;&#x5B9E;&#x4F53;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x5B58;&#x5728;&#x5E76;&#x53D1;&#x884C;</li>
<li>&#x72EC;&#x7ACB;&#x6027;&#xFF1A;&#x8FDB;&#x7A0B;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x5206;&#x914D;&#x8D44;&#x6E90;&#xFF0C;&#x72EC;&#x7ACB;&#x63A5;&#x53D7;&#x8C03;&#x5EA6;&#xFF0C;&#x72EC;&#x7ACB;&#x7684;&#x8FD0;&#x884C;&#x3002;</li>
<li>&#x5F02;&#x6B65;&#x6027;&#xFF1A;&#x8FDB;&#x7A0B;&#x4EE5;&#x4E0D;&#x53EF;&#x9884;&#x77E5;&#x7684;&#x901F;&#x5EA6;&#x5411;&#x524D;&#x63A8;&#x8FDB;&#x3002;</li>
<li>&#x7ED3;&#x6784;&#x6027;&#xFF1A;&#x8FDB;&#x7A0B;&#x62E5;&#x6709;&#x4EE3;&#x7801;&#x6BB5;&#x3001;&#x6570;&#x636E;&#x6BB5;&#x3001;PCB&#xFF08;&#x8FDB;&#x7A0B;&#x63A7;&#x5236;&#x5757;&#xFF0C;&#x8FDB;&#x7A0B;&#x5B58;&#x5728;&#x7684;&#x552F;&#x4E00;&#x6807;&#x5FD7;&#xFF09;&#x3002;&#x4E5F;&#x8FD9;&#x662F;&#x8FDB;&#x7A0B;&#x7684;&#x7ED3;&#x6784;&#x6027;&#x624D;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x72EC;&#x7ACB;&#x7684;&#x8FD0;&#x884C;</li>
</ul>
<p><strong>&#x5E76;&#x53D1;</strong>&#x5728;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6BB5;&#x5185;&#xFF0C;&#x5B8F;&#x89C2;&#x6765;&#x770B;&#x6709;&#x591A;&#x4E2A;&#x7A0B;&#x5E8F;&#x90FD;&#x5728;&#x6D3B;&#x52A8;&#xFF0C;&#x6709;&#x6761;&#x4E0D;&#x7D0A;&#x7684;&#x6267;&#x884C;<br><strong>&#x5E76;&#x884C;</strong>&#x5728;&#x6BCF;&#x4E00;&#x4E2A;&#x77AC;&#x95F4;&#xFF0C;&#x90FD;&#x6709;&#x591A;&#x4E2A;&#x7A0B;&#x5E8F;&#x90FD;&#x5728;&#x540C;&#x65F6;&#x6267;&#x884C;&#xFF0C;&#x8FD9;&#x4E2A;&#x5FC5;&#x987B;&#x6709;&#x591A;&#x4E2A; CPU &#x624D;&#x884C;</p>
<p>&#x5F15;&#x5165;&#x8FDB;&#x7A0B;&#x662F;&#x56E0;&#x4E3A;&#x4F20;&#x7EDF;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x7A0B;&#x5E8F;&#x5DF2;&#x7ECF;&#x4E0D;&#x8DB3;&#x4EE5;&#x63CF;&#x8FF0; OS &#x4E2D;&#x5404;&#x79CD;&#x6D3B;&#x52A8;&#x4E4B;&#x95F4;&#x7684;&#x52A8;&#x6001;&#x6027;&#x3001;&#x5E76;&#x53D1;&#x884C;&#x3001;&#x72EC;&#x7ACB;&#x6027;&#x8FD8;&#x6709;&#x76F8;&#x4E92;&#x5236;&#x7EA6;&#x6027;&#x3002;&#x5C31;&#x6BD4;&#x5982;&#x7A0B;&#x5E8F;&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x516C;&#x53F8;&#xFF0C;&#x53EA;&#x662F;&#x4E00;&#x4E9B;&#x8BC1;&#x4E66;&#xFF0C;&#x6587;&#x4EF6;&#x7684;&#x5806;&#x79EF;&#xFF08;&#x9759;&#x6001;&#x5B9E;&#x4F53;&#xFF09;&#x3002;&#x800C;&#x5F53;&#x516C;&#x53F8;&#x8FD0;&#x4F5C;&#x8D77;&#x6765;&#x5C31;&#x6709;&#x5404;&#x4E2A;&#x90E8;&#x95E8;&#x7684;&#x533A;&#x5206;&#xFF0C;&#x8D22;&#x52A1;&#x90E8;&#xFF0C;&#x6280;&#x672F;&#x90E8;&#xFF0C;&#x9500;&#x552E;&#x90E8;&#x7B49;&#x7B49;&#xFF0C;&#x5C31;&#x50CF;&#x5404;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF0C;&#x5404;&#x4E2A;&#x90E8;&#x95E8;&#x4E4B;&#x95F4;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x8FD0;&#x505A;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6709;&#x4EA4;&#x4E92;&#xFF08;&#x72EC;&#x7ACB;&#x6027;&#x3001;&#x5E76;&#x53D1;&#x6027;&#xFF09;</p>
<p>&#x800C;&#x968F;&#x7740;&#x7A0B;&#x5E8F;&#x7684;&#x53D1;&#x5C55;&#x8D8A;&#x505A;&#x8D8A;&#x5927;&#xFF0C;&#x53C8;&#x4F1A;&#x7EE7;&#x7EED;&#x7EC6;&#x5206;&#xFF0C;&#x4ECE;&#x800C;&#x5F15;&#x5165;&#x4E86;&#x7EBF;&#x7A0B;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5F53;&#x4EE3;&#x591A;&#x6570;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3001;Linux 2.6&#x53CA;&#x66F4;&#x65B0;&#x7684;&#x7248;&#x672C;&#x4E2D;&#xFF0C;&#x8FDB;&#x7A0B;&#x672C;&#x8EAB;&#x4E0D;&#x662F;&#x57FA;&#x672C;&#x8FD0;&#x884C;&#x5355;&#x4F4D;&#xFF0C;&#x800C;&#x662F;&#x7EBF;&#x7A0B;&#x7684;&#x5BB9;&#x5668;&#x3002;&#x5C31;&#x50CF;&#x4E0A;&#x8FF0;&#x6240;&#x8BF4;&#x7684;&#xFF0C;&#x6BCF;&#x4E2A;&#x90E8;&#x95E8;&#x53C8;&#x4F1A;&#x7EC6;&#x5206;&#x4E3A;&#x5404;&#x4E2A;&#x5DE5;&#x4F5C;&#x5C0F;&#x7EC4;&#xFF08;&#x7EBF;&#x7A0B;&#xFF09;&#xFF0C;&#x800C;&#x5DE5;&#x4F5C;&#x5C0F;&#x7EC4;&#x9700;&#x8981;&#x7684;&#x8D44;&#x6E90;&#x9700;&#x8981;&#x5411;&#x4E0A;&#x7EA7;&#xFF08;&#x8FDB;&#x7A0B;&#xFF09;&#x7533;&#x8BF7;&#x3002;</p>
<p><strong>&#x7EBF;&#x7A0B;</strong>&#xFF08;thread&#xFF09;&#x662F;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x80FD;&#x591F;&#x8FDB;&#x884C;&#x8FD0;&#x7B97;&#x8C03;&#x5EA6;&#x7684;&#x6700;&#x5C0F;&#x5355;&#x4F4D;&#x3002;&#x5B83;&#x88AB;&#x5305;&#x542B;&#x5728;&#x8FDB;&#x7A0B;&#x4E4B;&#x4E2D;&#xFF0C;&#x662F;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x5B9E;&#x9645;&#x8FD0;&#x4F5C;&#x5355;&#x4F4D;&#x3002;&#x4E00;&#x6761;&#x7EBF;&#x7A0B;&#x6307;&#x7684;&#x662F;&#x8FDB;&#x7A0B;&#x4E2D;&#x4E00;&#x4E2A;&#x5355;&#x4E00;&#x987A;&#x5E8F;&#x7684;&#x63A7;&#x5236;&#x6D41;&#xFF0C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x53EF;&#x4EE5;&#x5E76;&#x53D1;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x6BCF;&#x6761;&#x7EBF;&#x7A0B;&#x5E76;&#x884C;&#x6267;&#x884C;&#x4E0D;&#x540C;&#x7684;&#x4EFB;&#x52A1;&#x3002;&#x56E0;&#x4E3A;&#x7EBF;&#x7A0B;&#x4E2D;&#x51E0;&#x4E4E;&#x4E0D;&#x5305;&#x542B;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#xFF0C;&#x6240;&#x4EE5;&#x6267;&#x884C;&#x66F4;&#x5FEB;&#x3001;&#x66F4;&#x6709;&#x6548;&#x7387;</p>
<p>&#x7B80;&#x800C;&#x8A00;&#x4E4B;,&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x81F3;&#x5C11;&#x6709;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;,&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x81F3;&#x5C11;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x3002;&#x7EBF;&#x7A0B;&#x7684;&#x5212;&#x5206;&#x5C3A;&#x5EA6;&#x5C0F;&#x4E8E;&#x8FDB;&#x7A0B;&#xFF0C;&#x4F7F;&#x5F97;&#x591A;&#x7EBF;&#x7A0B;&#x7A0B;&#x5E8F;&#x7684;&#x5E76;&#x53D1;&#x6027;&#x9AD8;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x8FDB;&#x7A0B;&#x5728;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x62E5;&#x6709;&#x72EC;&#x7ACB;&#x7684;&#x5185;&#x5B58;&#x5355;&#x5143;&#xFF0C;&#x800C;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#xFF0C;&#x4ECE;&#x800C;&#x6781;&#x5927;&#x5730;&#x63D0;&#x9AD8;&#x4E86;&#x7A0B;&#x5E8F;&#x7684;&#x8FD0;&#x884C;&#x6548;&#x7387;&#x3002;</p>
<h2 id="&#x8FDB;&#x7A0B;&#x7684;&#x5206;&#x7C7B;"><a href="#&#x8FDB;&#x7A0B;&#x7684;&#x5206;&#x7C7B;" class="headerlink" title="&#x8FDB;&#x7A0B;&#x7684;&#x5206;&#x7C7B;"></a>&#x8FDB;&#x7A0B;&#x7684;&#x5206;&#x7C7B;</h2><p>&#x5927;&#x6982;&#x660E;&#x767D;&#x8FDB;&#x7A0B;&#x662F;&#x4E2A;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x8FDB;&#x4E00;&#x6B65;&#x5BF9;&#x4E8E;&#x8FDB;&#x7A0B;&#x7684;&#x4E00;&#x4E2A;&#x4E86;&#x89E3;&#x5C31;&#x662F;&#x8FDB;&#x7A0B;&#x5206;&#x7C7B;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4ECE;&#x4E24;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x5206;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x89D2;&#x5EA6;&#x4EE5;&#x8FDB;&#x7A0B;&#x7684;&#x529F;&#x80FD;&#x4E0E;&#x670D;&#x52A1;&#x7684;&#x5BF9;&#x8C61;&#x6765;&#x5206;&#xFF1B;&#x7B2C;&#x4E8C;&#x4E2A;&#x89D2;&#x5EA6;&#x4EE5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x670D;&#x52A1;&#x7C7B;&#x578B;&#x6765;&#x5206;</p>
<p>&#x7B2C;&#x4E00;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x7528;&#x6237;&#x8FDB;&#x7A0B;&#x4E0E;&#x7CFB;&#x7EDF;&#x8FDB;&#x7A0B;</p>
<ul>
<li>&#x7528;&#x6237;&#x8FDB;&#x7A0B;&#xFF1A;&#x901A;&#x8FC7;&#x6267;&#x884C;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x3001;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6216;&#x79F0;&#x4E4B;&#x4E3A;&#x5185;&#x6838;&#x4E4B;&#x5916;&#x7684;&#x7CFB;&#x7EDF;&#x7A0B;&#x5E8F;&#x800C;&#x4EA7;&#x751F;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x6B64;&#x7C7B;&#x8FDB;&#x7A0B;&#x53EF;&#x4EE5;&#x5728;&#x7528;&#x6237;&#x7684;&#x63A7;&#x5236;&#x4E0B;&#x8FD0;&#x884C;&#x6216;&#x5173;&#x95ED;</li>
<li>&#x7CFB;&#x7EDF;&#x8FDB;&#x7A0B;&#xFF1A;&#x901A;&#x8FC7;&#x6267;&#x884C;&#x7CFB;&#x7EDF;&#x5185;&#x6838;&#x7A0B;&#x5E8F;&#x800C;&#x4EA7;&#x751F;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x6BD4;&#x5982;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x5185;&#x5B58;&#x8D44;&#x6E90;&#x5206;&#x914D;&#x548C;&#x8FDB;&#x7A0B;&#x5207;&#x6362;&#x7B49;&#x76F8;&#x5BF9;&#x5E95;&#x5C42;&#x7684;&#x5DE5;&#x4F5C;&#xFF1B;&#x800C;&#x4E14;&#xFF0C;&#x8BE5;&#x8FDB;&#x7A0B;&#x7684;&#x8FD0;&#x884C;&#x4E0D;&#x53D7;&#x7528;&#x6237;&#x7684;&#x5E72;&#x9884;&#xFF0C;&#x5373;&#x4F7F;&#x662F;root&#x7528;&#x6237;&#x4E5F;&#x4E0D;&#x80FD;&#x5E72;&#x9884;&#x7CFB;&#x7EDF;&#x8FDB;&#x7A0B;&#x7684;&#x8FD0;&#x884C;</li>
</ul>
<p>&#x7B2C;&#x4E8C;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x8FDB;&#x7A0B;&#x5206;&#x4E3A;&#x4EA4;&#x4E92;&#x8FDB;&#x7A0B;&#x3001;&#x6279;&#x5904;&#x7406;&#x8FDB;&#x7A0B;&#x3001;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;</p>
<ul>
<li>&#x4EA4;&#x4E92;&#x8FDB;&#x7A0B;&#xFF1A;&#x7531;&#x4E00;&#x4E2A; shell &#x7EC8;&#x7AEF;&#x542F;&#x52A8;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x5728;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x9700;&#x8981;&#x4E0E;&#x7528;&#x6237;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#x64CD;&#x4F5C;&#xFF0C;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x4E8E;&#x524D;&#x53F0;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x5728;&#x540E;&#x53F0;</li>
<li>&#x6279;&#x5904;&#x7406;&#x8FDB;&#x7A0B;&#xFF1A;&#x8BE5;&#x8FDB;&#x7A0B;&#x662F;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x96C6;&#x5408;&#xFF0C;&#x8D1F;&#x8D23;&#x6309;&#x987A;&#x5E8F;&#x542F;&#x52A8;&#x5176;&#x4ED6;&#x7684;&#x8FDB;&#x7A0B;</li>
<li>&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#xFF1A;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x662F;&#x4E00;&#x76F4;&#x8FD0;&#x884C;&#x7684;&#x4E00;&#x79CD;&#x8FDB;&#x7A0B;&#xFF0C;&#x7ECF;&#x5E38;&#x5728; Linux &#x7CFB;&#x7EDF;&#x542F;&#x52A8;&#x65F6;&#x542F;&#x52A8;&#xFF0C;&#x5728;&#x7CFB;&#x7EDF;&#x5173;&#x95ED;&#x65F6;&#x7EC8;&#x6B62;&#x3002;&#x5B83;&#x4EEC;&#x72EC;&#x7ACB;&#x4E8E;&#x63A7;&#x5236;&#x7EC8;&#x7AEF;&#x5E76;&#x4E14;&#x5468;&#x671F;&#x6027;&#x7684;&#x6267;&#x884C;&#x67D0;&#x79CD;&#x4EFB;&#x52A1;&#x6216;&#x7B49;&#x5F85;&#x5904;&#x7406;&#x67D0;&#x4E9B;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x4EF6;&#x3002;&#x4F8B;&#x5982;httpd&#x8FDB;&#x7A0B;&#xFF0C;&#x4E00;&#x76F4;&#x5904;&#x4E8E;&#x8FD0;&#x884C;&#x72B6;&#x6001;&#xFF0C;&#x7B49;&#x5F85;&#x7528;&#x6237;&#x7684;&#x8BBF;&#x95EE;&#x3002;&#x8FD8;&#x6709;&#x7ECF;&#x5E38;&#x7528;&#x7684; cron&#xFF08;&#x5728; centOS &#x7CFB;&#x5217;&#x4E3A; crond&#xFF09; &#x8FDB;&#x7A0B;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E3A; crontab &#x7684;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#xFF0C;&#x53EF;&#x4EE5;&#x5468;&#x671F;&#x6027;&#x7684;&#x6267;&#x884C;&#x7528;&#x6237;&#x8BBE;&#x5B9A;&#x7684;&#x67D0;&#x4E9B;&#x4EFB;&#x52A1;</li>
</ul>
<h2 id="&#x8FDB;&#x7A0B;&#x7684;&#x884D;&#x751F;"><a href="#&#x8FDB;&#x7A0B;&#x7684;&#x884D;&#x751F;" class="headerlink" title="&#x8FDB;&#x7A0B;&#x7684;&#x884D;&#x751F;"></a>&#x8FDB;&#x7A0B;&#x7684;&#x884D;&#x751F;</h2><p><a href="https://www.win.tue.nl/~aeb/linux/lk/lk-10.html" target="_blank" rel="external">https://www.win.tue.nl/~aeb/linux/lk/lk-10.html</a></p>
<p>&#x8FDB;&#x7A0B;&#x6709;&#x8FD9;&#x4E48;&#x591A;&#x7684;&#x79CD;&#x7C7B;&#xFF0C;&#x90A3;&#x4E48;&#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x5B9A;&#x662F;&#x6709;&#x76F8;&#x5173;&#x6027;&#x7684;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x6709;&#x5173;&#x8054;&#x6027;&#x7684;&#x8FDB;&#x7A0B;&#x53C8;&#x662F;&#x5982;&#x4F55;&#x4EA7;&#x751F;&#x7684;&#xFF0C;&#x5982;&#x4F55;&#x884D;&#x751F;&#x7684;&#xFF1F;</p>
<p>&#x5C31;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x542F;&#x52A8;&#x4E86;&#x7EC8;&#x7AEF;&#xFF0C;&#x5C31;&#x662F;&#x542F;&#x52A8;&#x4E86;&#x4E00;&#x4E2A; bash &#x8FDB;&#x7A0B;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728; bash &#x4E2D;&#x518D;&#x8F93;&#x5165; bash &#x5219;&#x4F1A;&#x518D;&#x542F;&#x52A8;&#x4E00;&#x4E2A; bash &#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x6B64;&#x65F6;&#x7B2C;&#x4E8C;&#x4E2A; bash &#x8FDB;&#x7A0B;&#x5C31;&#x662F;&#x7531;&#x7B2C;&#x4E00;&#x4E2A; bash &#x8FDB;&#x7A0B;&#x521B;&#x5EFA;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x4ED6;&#x4EEC;&#x76F4;&#x63A5;&#x53C8;&#x662F;&#x4E2A;&#x4EC0;&#x4E48;&#x5173;&#x7CFB;&#xFF1F;</p>
<p>&#x6211;&#x4EEC;&#x4E00;&#x822C;&#x79F0;&#x547C;&#x7B2C;&#x4E00;&#x4E2A; bash &#x8FDB;&#x7A0B;&#x662F;&#x7B2C;&#x4E8C; bash &#x8FDB;&#x7A0B;&#x7684;&#x7236;&#x8FDB;&#x7A0B;&#xFF0C;&#x7B2C;&#x4E8C; bash &#x8FDB;&#x7A0B;&#x662F;&#x7B2C;&#x4E00;&#x4E2A; bash &#x8FDB;&#x7A0B;&#x7684;&#x5B50;&#x8FDB;&#x7A0B;&#xFF0C;&#x8FD9;&#x5C42;&#x5173;&#x7CFB;&#x662F;&#x5982;&#x4F55;&#x5F97;&#x6765;&#x7684;&#x5462;&#xFF1F;</p>
<p>&#x5173;&#x4E8E;&#x7236;&#x8FDB;&#x7A0B;&#x4E0E;&#x5B50;&#x8FDB;&#x7A0B;&#x4FBF;&#x4F1A;&#x63D0;&#x53CA;&#x8FD9;&#x4E24;&#x4E2A;&#x7CFB;&#x7EDF;&#x8C03;&#x7528; fork() &#x4E0E; exec()</p>
<p><strong>fork-exec</strong>&#x662F;&#x7531; Dennis M. Ritchie &#x521B;&#x9020;&#x7684;<br><strong>fork()</strong> &#x662F;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#xFF08;system call&#xFF09;&#xFF0C;&#x5B83;&#x7684;&#x4E3B;&#x8981;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x4E3A;&#x5F53;&#x524D;&#x7684;&#x8FDB;&#x7A0B;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B0;&#x7684;&#x8FDB;&#x7A0B;&#x5C31;&#x662F;&#x5B83;&#x7684;&#x5B50;&#x8FDB;&#x7A0B;&#xFF0C;&#x8FD9;&#x4E2A;&#x5B50;&#x8FDB;&#x7A0B;&#x9664;&#x4E86;&#x7236;&#x8FDB;&#x7A0B;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x548C; PID &#x4EE5;&#x5916;&#x5176;&#x4ED6;&#x7684;&#x90FD;&#x4E00;&#x6A21;&#x4E00;&#x6837;&#xFF0C;&#x5982;&#x8FDB;&#x7A0B;&#x7684;&#x6267;&#x884C;&#x4EE3;&#x7801;&#x6BB5;&#xFF0C;&#x5185;&#x5B58;&#x4FE1;&#x606F;&#xFF0C;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#xFF0C;&#x5BC4;&#x5B58;&#x5668;&#x72B6;&#x6001;&#x7B49;&#x7B49;<br><strong>exec()</strong> &#x4E5F;&#x662F;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#xFF0C;&#x4F5C;&#x7528;&#x662F;&#x5207;&#x6362;&#x5B50;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x4E5F;&#x5C31;&#x662F;&#x66FF;&#x6362;&#x5176;&#x4ECE;&#x7236;&#x8FDB;&#x7A0B;&#x590D;&#x5236;&#x8FC7;&#x6765;&#x7684;&#x4EE3;&#x7801;&#x6BB5;&#x4E0E;&#x6570;&#x636E;&#x6BB5;</p>
<p>&#x5B50;&#x8FDB;&#x7A0B;&#x5C31;&#x662F;&#x7236;&#x8FDB;&#x7A0B;&#x901A;&#x8FC7;&#x7CFB;&#x7EDF;&#x8C03;&#x7528; fork() &#x800C;&#x4EA7;&#x751F;&#x7684;&#x590D;&#x5236;&#x54C1;&#xFF0C;fork() &#x5C31;&#x662F;&#x628A;&#x7236;&#x8FDB;&#x7A0B;&#x7684; PCB &#x7B49;&#x8FDB;&#x7A0B;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4FE1;&#x606F;&#x76F4;&#x63A5;&#x590D;&#x5236;&#x8FC7;&#x6765;&#xFF0C;&#x53EA;&#x662F;&#x4FEE;&#x6539;&#x4E86; PID&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x6A21;&#x4E00;&#x6837;&#xFF0C;&#x6307;&#x6325;&#x5728;&#x6267;&#x884C; exec() &#x4E4B;&#x540E;&#x624D;&#x4F1A;&#x4E0D;&#x540C;&#xFF0C;&#x800C;&#x65E9;&#x5148;&#x7684; fork() &#x6BD4;&#x8F83;&#x6D88;&#x8017;&#x8D44;&#x6E90;&#x540E;&#x6765;&#x8FDB;&#x5316;&#x6210; vfork(),&#x6548;&#x7387;&#x9AD8;&#x4E86;&#x4E0D;&#x5C11;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x5B50;&#x8FDB;&#x7A0B;&#x4EA7;&#x751F;&#x7684;&#x7531;&#x6765;&#x3002;&#x7B80;&#x5355;&#x7684;&#x903B;&#x8F91;&#x5C31;&#x5982;&#x4E0B;&#x65B9;&#x6240;&#x793A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div></pre></td><td class="code"><pre><div class="line">pid_t p;</div><div class="line"></div><div class="line">p = fork();</div><div class="line">if (p == (pid_t) -1)</div><div class="line">        /* ERROR */</div><div class="line">else if (p == 0)</div><div class="line">        /* CHILD */</div><div class="line">else</div><div class="line">        /* PARENT */</div></pre></td></tr></table></figure>
<p>&#x65E2;&#x7136;&#x5B50;&#x8FDB;&#x7A0B;&#x662F;&#x901A;&#x8FC7;&#x7236;&#x8FDB;&#x7A0B;&#x800C;&#x884D;&#x751F;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x5B50;&#x8FDB;&#x7A0B;&#x7684;&#x9000;&#x51FA;&#x4E0E;&#x8D44;&#x6E90;&#x7684;&#x56DE;&#x6536;&#x5B9A;&#x7136;&#x4E0E;&#x7236;&#x8FDB;&#x7A0B;&#x6709;&#x5F88;&#x5927;&#x7684;&#x76F8;&#x5173;&#x6027;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x5B50;&#x8FDB;&#x7A0B;&#x8981;&#x6B63;&#x5E38;&#x7684;&#x7EC8;&#x6B62;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x6216;&#x8005;&#x8BE5;&#x8FDB;&#x7A0B;&#x7ED3;&#x675F;&#x65F6;&#x5B83;&#x7684;&#x4E3B;&#x51FD;&#x6570; main() &#x4F1A;&#x6267;&#x884C; exit(n); &#x6216;&#x8005; return n&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x8FD4;&#x56DE;&#x503C; n &#x662F;&#x4E00;&#x4E2A;&#x4FE1;&#x53F7;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x628A;&#x8FD9;&#x4E2A; SIGCHLD &#x4FE1;&#x53F7;&#x4F20;&#x7ED9;&#x5176;&#x7236;&#x8FDB;&#x7A0B;&#xFF0C;&#x5F53;&#x7136;&#x82E5;&#x662F;&#x5F02;&#x5E38;&#x7EC8;&#x6B62;&#x4E5F;&#x5F80;&#x5F80;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x4FE1;&#x53F7;&#x3002;</p>
<p>&#x800C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x7684;&#x5B50;&#x8FDB;&#x7A0B;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x90E8;&#x5206;&#x5176;&#x5B9E;&#x5DF2;&#x7ECF;&#x7ED3;&#x675F;&#x6267;&#x884C;&#x4E86;&#xFF0C;&#x7CFB;&#x7EDF;&#x7684;&#x8D44;&#x6E90;&#x4E5F;&#x8FDB;&#x672C;&#x5F52;&#x8FD8;&#x7ED9;&#x7CFB;&#x7EDF;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x5176;&#x8FDB;&#x7A0B;&#x7684;&#x8FDB;&#x7A0B;&#x63A7;&#x5236;&#x5757;&#xFF08;PCB&#xFF09;&#x4ECD;&#x9A7B;&#x7559;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x800C;&#x5B83;&#x7684; PCB &#x8FD8;&#x5728;&#xFF0C;&#x4EE3;&#x8868;&#x8FD9;&#x4E2A;&#x8FDB;&#x7A0B;&#x8FD8;&#x5B58;&#x5728;&#xFF08;&#x56E0;&#x4E3A; PCB &#x5C31;&#x662F;&#x8FDB;&#x7A0B;&#x5B58;&#x5728;&#x7684;&#x552F;&#x4E00;&#x6807;&#x5FD7;&#xFF0C;&#x91CC;&#x9762;&#x6709; PID &#x7B49;&#x6D88;&#x606F;&#xFF09;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x6D88;&#x4EA1;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x8FDB;&#x7A0B;&#x79F0;&#x4E4B;&#x4E3A;&#x50F5;&#x5C38;&#x8FDB;&#x7A0B;&#xFF08;Zombie&#xFF09;</p>
<p>&#x6B63;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7236;&#x8FDB;&#x7A0B;&#x4F1A;&#x6536;&#x5230;&#x4E24;&#x4E2A;&#x8FD4;&#x56DE;&#x503C;&#x4E00;&#x4E2A;&#x662F; exit code &#x4E5F;&#x662F; SIGCHLD &#x4FE1;&#x53F7;&#x4E0E; reason for termination &#x4E4B;&#x540E;&#xFF0C;&#x7236;&#x8FDB;&#x7A0B;&#x4F1A;&#x4F7F;&#x7528; wait(&amp;status) &#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x4EE5;&#x83B7;&#x53D6;&#x5B50;&#x8FDB;&#x7A0B;&#x7684;&#x9000;&#x51FA;&#x72B6;&#x6001;&#xFF0C;&#x7136;&#x540E;&#x5185;&#x6838;&#x5C31;&#x53EF;&#x4EE5;&#x4ECE;&#x5185;&#x5B58;&#x4E2D;&#x91CA;&#x653E;&#x5DF2;&#x7ED3;&#x675F;&#x7684;&#x5B50;&#x8FDB;&#x7A0B;&#x7684; PCB&#xFF1B;&#x800C;&#x5982;&#x82E5;&#x7236;&#x8FDB;&#x7A0B;&#x6CA1;&#x6709;&#x8FD9;&#x4E48;&#x505A;&#x7684;&#x8BDD;&#xFF0C;&#x5B50;&#x8FDB;&#x7A0B;&#x7684; PCB &#x5C31;&#x4F1A;&#x4E00;&#x76F4;&#x9A7B;&#x7559;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x4E00;&#x76F4;&#x7559;&#x5728;&#x7CFB;&#x7EDF;&#x4E2D;&#x505A;&#x4E3A;&#x50F5;&#x5C38;&#x8FDB;&#x7A0B;&#xFF08;Zombie&#xFF09;&#x3002;</p>
<p>&#x867D;&#x7136;&#x50F5;&#x5C38;&#x8FDB;&#x7A0B;&#x662F;&#x5DF2;&#x7ECF;&#x653E;&#x5F03;&#x4E86;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x53EF;&#x6267;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x88AB;&#x8C03;&#x5EA6;&#xFF0C;&#x5728;&#x8FDB;&#x7A0B;&#x5217;&#x8868;&#x4E2D;&#x4FDD;&#x7559;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF0C;&#x8BB0;&#x8F7D;&#x8BE5;&#x8FDB;&#x7A0B;&#x7684;&#x9000;&#x51FA;&#x72B6;&#x6001;&#x7B49;&#x4FE1;&#x606F;&#x4F9B;&#x5176;&#x7236;&#x8FDB;&#x7A0B;&#x6536;&#x96C6;&#xFF0C;&#x4ECE;&#x800C;&#x91CA;&#x653E;&#x5B83;&#x3002;&#x4F46;&#x662F; Linux &#x7CFB;&#x7EDF;&#x4E2D;&#x80FD;&#x4F7F;&#x7528;&#x7684; PID &#x662F;&#x6709;&#x9650;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x4E2D;&#x5B58;&#x5728;&#x6709;&#x5927;&#x91CF;&#x7684;&#x50F5;&#x5C38;&#x8FDB;&#x7A0B;&#xFF0C;&#x7CFB;&#x7EDF;&#x5C06;&#x4F1A;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x53EF;&#x7528;&#x7684; PID &#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x4E0D;&#x80FD;&#x4EA7;&#x751F;&#x65B0;&#x7684;&#x8FDB;&#x7A0B;&#x3002;</p>
<p>&#x800C;&#x53E6;&#x5916;&#x5982;&#x679C;&#x7236;&#x8FDB;&#x7A0B;&#x7ED3;&#x675F;&#xFF08;&#x975E;&#x6B63;&#x5E38;&#x7684;&#x7ED3;&#x675F;&#xFF09;&#xFF0C;&#x672A;&#x80FD;&#x5373;&#x4F7F;&#x6536;&#x56DE;&#x5B50;&#x8FDB;&#x7A0B;&#xFF0C;&#x5B50;&#x8FDB;&#x7A0B;&#x4ECD;&#x5728;&#x8FD0;&#x884C;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x5B50;&#x8FDB;&#x7A0B;&#x79F0;&#x4E4B;&#x4E3A;&#x5B64;&#x513F;&#x8FDB;&#x7A0B;&#x3002;&#x5728; Linux &#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5B64;&#x513F;&#x8FDB;&#x7A0B;&#x4E00;&#x822C;&#x4F1A;&#x88AB; init &#x8FDB;&#x7A0B;&#x6240;&#x201C;&#x6536;&#x517B;&#x201D;&#xFF0C;&#x6210;&#x4E3A; init &#x7684;&#x5B50;&#x8FDB;&#x7A0B;&#x3002;&#x7531; init &#x6765;&#x505A;&#x5584;&#x540E;&#x5904;&#x7406;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x5E76;&#x4E0D;&#x81F3;&#x4E8E;&#x50CF;&#x50F5;&#x5C38;&#x8FDB;&#x7A0B;&#x90A3;&#x6837;&#x65E0;&#x4EBA;&#x95EE;&#x6D25;&#xFF0C;&#x4E0D;&#x7BA1;&#x4E0D;&#x987E;&#xFF0C;&#x5927;&#x91CF;&#x5B58;&#x5728;&#x4F1A;&#x6709;&#x5371;&#x5BB3;&#x3002;</p>
<p>&#x8FDB;&#x7A0B; 0 &#x662F;&#x7CFB;&#x7EDF;&#x5F15;&#x5BFC;&#x65F6;&#x521B;&#x5EFA;&#x7684;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x8FDB;&#x7A0B;&#xFF0C;&#x4E5F;&#x79F0;&#x4E4B;&#x4E3A;&#x5185;&#x6838;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5176;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x52A8;&#x4F5C;&#x5C31;&#x662F;&#x8C03;&#x7528; fork() &#x521B;&#x5EFA;&#x51FA;&#x4E00;&#x4E2A;&#x5B50;&#x8FDB;&#x7A0B;&#x8FD0;&#x884C; /sbin/init &#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;,&#x800C;&#x8BE5;&#x8FDB;&#x7A0B;&#x5C31;&#x662F; PID=1 &#x7684;&#x8FDB;&#x7A0B;1&#xFF0C;&#x4E5F;&#x5C31;&#x662F; init &#x8FDB;&#x7A0B;&#xFF0C;&#x800C;&#x8FDB;&#x7A0B; 0 &#x5C31;&#x8F6C;&#x4E3A;&#x4EA4;&#x6362;&#x8FDB;&#x7A0B;&#xFF08;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x7A7A;&#x95F2;&#x8FDB;&#x7A0B;&#xFF09;&#xFF0C;&#x800C;&#x8FDB;&#x7A0B; 1 &#xFF08;init &#x8FDB;&#x7A0B;&#xFF09;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7528;&#x6237;&#x6001;&#x7684;&#x8FDB;&#x7A0B;,&#x518D;&#x7531;&#x5B83;&#x4E0D;&#x65AD;&#x8C03;&#x7528; fork() &#x6765;&#x521B;&#x5EFA;&#x7CFB;&#x7EDF;&#x91CC;&#x5176;&#x4ED6;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x662F;&#x6240;&#x6709;&#x8FDB;&#x7A0B;&#x7684;&#x7236;&#x8FDB;&#x7A0B;&#x6216;&#x8005;&#x7956;&#x5148;&#x8FDB;&#x7A0B;&#x3002;&#x540C;&#x65F6;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x5B88;&#x62A4;&#x7A0B;&#x5E8F;&#xFF0C;&#x76F4;&#x5230;&#x8BA1;&#x7B97;&#x673A;&#x5173;&#x673A;&#x624D;&#x4F1A;&#x505C;&#x6B62;&#x3002;</p>
<p><img src="/2016/11/18/&#x4ECE;&#x96F6;&#x5F00;&#x59CB;&#x5B66;&#x4E60;Linux-12/1.png" alt=""></p>
<p>&#x901A;&#x8FC7;&#x4EE5;&#x4E0A;&#x7684;&#x663E;&#x793A;&#x7ED3;&#x679C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x7684;&#x5F88;&#x6E05;&#x695A;&#xFF0C;init &#x4E3A;&#x6240;&#x6709;&#x8FDB;&#x7A0B;&#x7684;&#x7236;&#x8FDB;&#x7A0B;&#x6216;&#x8005;&#x8BF4;&#x662F;&#x7956;&#x5148;&#x8FDB;&#x7A0B;</p>
<p>&#x6211;&#x4EEC;&#x8FD8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#x6765;&#x770B;&#xFF0C;&#x5176;&#x4E2D; pid &#x5C31;&#x662F;&#x8BE5;&#x8FDB;&#x7A0B;&#x7684;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x7F16;&#x53F7;&#xFF0C;ppid &#x5C31;&#x662F;&#x8BE5;&#x8FDB;&#x7A0B;&#x7684;&#x7236;&#x8FDB;&#x7A0B;&#x7684; pid&#xFF0C;command &#x5C31;&#x662F;&#x8BE5;&#x8FDB;&#x7A0B;&#x662F;&#x6267;&#x884C;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x7A0B;&#x5E8F;&#x6216;&#x8005;&#x811A;&#x672C;&#x800C;&#x4EA7;&#x751F;&#x7684;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">ps &#xFF0D;fxo user,ppid,pid,pgid,command</div></pre></td></tr></table></figure>
<p>&#x53EF;&#x4EE5;&#x5728;&#x56FE;&#x4E2D;&#x770B;&#x89C1;&#x6211;&#x4EEC;&#x6267;&#x884C;&#x7684; ps &#x5C31;&#x662F;&#x7531; zsh &#x901A;&#x8FC7; fork-exec &#x521B;&#x5EFA;&#x7684;&#x5B50;&#x8FDB;&#x7A0B;&#x800C;&#x6267;&#x884C;&#x7684;</p>
<p>&#x4F7F;&#x7528;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#x6211;&#x4EEC;&#x4E5F;&#x80FD;&#x6E05;&#x695A;&#x7684;&#x770B;&#x89C1; init &#x5982;&#x4E0A;&#x6587;&#x6240;&#x8BF4;&#x662F;&#x7531;&#x8FDB;&#x7A0B;0&#x8FD9;&#x4E2A;&#x521D;&#x59CB;&#x5316;&#x8FDB;&#x7A0B;&#x6765;&#x521B;&#x5EFA;&#x800C;&#x51FA;&#x7684;&#x5B50;&#x8FDB;&#x7A0B;,&#x800C;&#x5176;&#x4ED6;&#x7684;&#x8FDB;&#x7A0B;&#x57FA;&#x672C;&#x662F;&#x7531; init &#x521B;&#x5EFA;&#x7684;&#x5B50;&#x8FDB;&#x7A0B;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x7531;&#x5B83;&#x7684;&#x5B50;&#x8FDB;&#x7A0B;&#x521B;&#x5EFA;&#x51FA;&#x6765;&#x7684;&#x5B50;&#x8FDB;&#x7A0B;&#x3002;&#x6240;&#x4EE5; init &#x662F;&#x7528;&#x6237;&#x8FDB;&#x7A0B;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E5F;&#x662F;&#x6240;&#x6709;&#x7528;&#x6237;&#x8FDB;&#x7A0B;&#x7684;&#x7236;&#x8FDB;&#x7A0B;&#x6216;&#x8005;&#x7956;&#x5148;&#x8FDB;&#x7A0B;&#x3002;</p>
<p>&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x6811;&#x72B6;&#x56FE;&#xFF0C;&#x800C; init &#x8FDB;&#x7A0B;&#x5C31;&#x662F;&#x8FD9;&#x68F5;&#x6811;&#x7684;&#x6839;&#xFF0C;&#x5176;&#x4ED6;&#x8FDB;&#x7A0B;&#x7531;&#x6839;&#x4E0D;&#x65AD;&#x7684;&#x53D1;&#x6563;&#xFF0C;&#x5F00;&#x679D;&#x6563;&#x53F6;</p>
<h2 id="&#x8FDB;&#x7A0B;&#x7EC4;&#x4E0E;-Sessions"><a href="#&#x8FDB;&#x7A0B;&#x7EC4;&#x4E0E;-Sessions" class="headerlink" title="&#x8FDB;&#x7A0B;&#x7EC4;&#x4E0E; Sessions"></a>&#x8FDB;&#x7A0B;&#x7EC4;&#x4E0E; Sessions</h2><p>&#x6BCF;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x90FD;&#x4F1A;&#x662F;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x7EC4;&#x7684;&#x6210;&#x5458;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x4E2A;&#x8FDB;&#x7A0B;&#x7EC4;&#x662F;&#x552F;&#x4E00;&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x4ED6;&#x4EEC;&#x662F;&#x4F9D;&#x9760; PGID&#xFF08;process group ID&#xFF09;&#x6765;&#x533A;&#x522B;&#x7684;&#xFF0C;&#x800C;&#x6BCF;&#x5F53;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x88AB;&#x521B;&#x5EFA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x4FBF;&#x4F1A;&#x6210;&#x4E3A;&#x5176;&#x7236;&#x8FDB;&#x7A0B;&#x6240;&#x5728;&#x7EC4;&#x4E2D;&#x7684;&#x4E00;&#x5458;&#x3002;</p>
<p>&#x4E00;&#x822C;&#x60C5;&#x51B5;&#xFF0C;&#x8FDB;&#x7A0B;&#x7EC4;&#x7684; PGID &#x7B49;&#x540C;&#x4E8E;&#x8FDB;&#x7A0B;&#x7EC4;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x6210;&#x5458;&#x7684; PID&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x6837;&#x7684;&#x8FDB;&#x7A0B;&#x79F0;&#x4E3A;&#x8BE5;&#x8FDB;&#x7A0B;&#x7EC4;&#x7684;&#x9886;&#x5BFC;&#x8005;,&#x4E5F;&#x5C31;&#x662F;&#x9886;&#x5BFC;&#x8FDB;&#x7A0B;&#xFF0C;&#x8FDB;&#x7A0B;&#x4E00;&#x822C;&#x901A;&#x8FC7;&#x4F7F;&#x7528; getpgrp() &#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x6765;&#x5BFB;&#x627E;&#x5176;&#x6240;&#x5728;&#x7EC4;&#x7684; PGID&#xFF0C;&#x9886;&#x5BFC;&#x8FDB;&#x7A0B;&#x53EF;&#x4EE5;&#x5148;&#x7EC8;&#x7ED3;&#xFF0C;&#x6B64;&#x65F6;&#x8FDB;&#x7A0B;&#x7EC4;&#x4F9D;&#x7136;&#x5B58;&#x5728;&#xFF0C;&#x5E76;&#x6301;&#x6709;&#x76F8;&#x540C;&#x7684;PGID&#xFF0C;&#x76F4;&#x5230;&#x8FDB;&#x7A0B;&#x7EC4;&#x4E2D;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x7EC8;&#x7ED3;&#x3002;</p>
<p>&#x4E0E;&#x8FDB;&#x7A0B;&#x7EC4;&#x7C7B;&#x4F3C;&#xFF0C;&#x6BCF;&#x5F53;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x88AB;&#x521B;&#x5EFA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x4FBF;&#x4F1A;&#x6210;&#x4E3A;&#x5176;&#x7236;&#x8FDB;&#x7A0B;&#x6240;&#x5728; Session &#x4E2D;&#x7684;&#x4E00;&#x5458;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x7EC4;&#x90FD;&#x4F1A;&#x5728;&#x4E00;&#x4E2A; Session &#x4E2D;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x4E2A; Session &#x662F;&#x552F;&#x4E00;&#x5B58;&#x5728;&#x7684;</p>
<p>Session &#x4E3B;&#x8981;&#x662F;&#x9488;&#x5BF9;&#x4E00;&#x4E2A; tty &#x5EFA;&#x7ACB;&#xFF0C;Session &#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x90FD;&#x79F0;&#x4E3A;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;(job)&#x3002;&#x6BCF;&#x4E2A;&#x4F1A;&#x8BDD;&#x53EF;&#x4EE5;&#x8FDE;&#x63A5;&#x4E00;&#x4E2A;&#x7EC8;&#x7AEF;(control terminal)&#x3002;&#x5F53;&#x63A7;&#x5236;&#x7EC8;&#x7AEF;&#x6709;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x65F6;&#xFF0C;&#x90FD;&#x4F20;&#x9012;&#x7ED9;&#x8BE5;&#x4F1A;&#x8BDD;&#x7684;&#x524D;&#x53F0;&#x8FDB;&#x7A0B;&#x7EC4;&#x3002;Session &#x610F;&#x4E49;&#x5728;&#x4E8E;&#x5C06;&#x591A;&#x4E2A;jobs&#x56CA;&#x62EC;&#x5728;&#x4E00;&#x4E2A;&#x7EC8;&#x7AEF;&#xFF0C;&#x5E76;&#x53D6;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E2A; job &#x4F5C;&#x4E3A;&#x524D;&#x53F0;&#xFF0C;&#x6765;&#x76F4;&#x63A5;&#x63A5;&#x6536;&#x8BE5;&#x7EC8;&#x7AEF;&#x7684;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x4EE5;&#x53CA;&#x7EC8;&#x7AEF;&#x4FE1;&#x53F7;&#x3002; &#x5176;&#x4ED6;jobs&#x5728;&#x540E;&#x53F0;&#x8FD0;&#x884C;</p>
<p><strong>&#x524D;&#x53F0;</strong>&#xFF08;foreground&#xFF09;&#x5C31;&#x662F;&#x5728;&#x7EC8;&#x7AEF;&#x4E2D;&#x8FD0;&#x884C;&#xFF0C;&#x4E0E;&#x4F60;&#x80FD;&#x6709;&#x4EA4;&#x4E92;&#x7684;<br><strong>&#x540E;&#x53F0;</strong>&#xFF08;background&#xFF09;&#x5C31;&#x662F;&#x5728;&#x7EC8;&#x7AEF;&#x4E2D;&#x8FD0;&#x884C;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x5E76;&#x4E0D;&#x80FD;&#x4E0E;&#x5176;&#x4EFB;&#x4F55;&#x7684;&#x4EA4;&#x4E92;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x663E;&#x793A;&#x5176;&#x6267;&#x884C;&#x7684;&#x8FC7;&#x7A0B;</p>
<h2 id="&#x5DE5;&#x4F5C;&#x7BA1;&#x7406;"><a href="#&#x5DE5;&#x4F5C;&#x7BA1;&#x7406;" class="headerlink" title="&#x5DE5;&#x4F5C;&#x7BA1;&#x7406;"></a>&#x5DE5;&#x4F5C;&#x7BA1;&#x7406;</h2><p>bash(Bourne-Again shell)&#x652F;&#x6301;&#x5DE5;&#x4F5C;&#x63A7;&#x5236;(job control),&#x800C;sh(Bourne shell)&#x5E76;&#x4E0D;&#x652F;&#x6301;&#x3002;</p>
<p>&#x5E76;&#x4E14;&#x6BCF;&#x4E2A;&#x7EC8;&#x7AEF;&#x6216;&#x8005;&#x8BF4; bash &#x53EA;&#x80FD;&#x7BA1;&#x7406;&#x5F53;&#x524D;&#x7EC8;&#x7AEF;&#x7684;&#x4E2D;&#x7684; job&#xFF0C;&#x4E0D;&#x80FD;&#x7BA1;&#x7406;&#x5176;&#x4ED6;&#x7EC8;&#x7AEF;&#x4E2D;&#x7684; job&#x3002;&#x6BD4;&#x5982;&#x6211;&#x5F53;&#x524D;&#x5B58;&#x5728;&#x4E24;&#x4E2A; bash &#x5206;&#x522B;&#x4E3A; bash1&#x3001;bash2&#xFF0C;bash1 &#x53EA;&#x80FD;&#x7BA1;&#x7406;&#x5176;&#x81EA;&#x5DF1;&#x91CC;&#x9762;&#x7684; job &#x5E76;&#x4E0D;&#x80FD;&#x7BA1;&#x7406; bash2 &#x91CC;&#x9762;&#x7684; job</p>
<p>&#x6211;&#x4EEC;&#x90FD;&#x77E5;&#x9053;&#x5F53;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x5728;&#x524D;&#x53F0;&#x8FD0;&#x4F5C;&#x65F6;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528; ctrl + c &#x6765;&#x7EC8;&#x6B62;&#x5B83;&#xFF0C;&#x4F46;&#x662F;&#x82E5;&#x662F;&#x5728;&#x540E;&#x53F0;&#x7684;&#x8BDD;&#x5C31;&#x4E0D;&#x884C;&#x4E86;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x4E00;&#x4E2A;&#x7EC8;&#x7AEF; bash &#x4E2D;&#x53EA;&#x80FD;&#x7BA1;&#x7406;&#x5F53;&#x524D; bash &#x91CC;&#x7684; job.</p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; &amp; &#x8FD9;&#x4E2A;&#x7B26;&#x53F7;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x7684;&#x547D;&#x4EE4;&#x5728;&#x540E;&#x53F0;&#x4E2D;&#x8FD0;&#x884C;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">ls &amp;</div></pre></td></tr></table></figure>
<p>&#x6211;&#x4EEC;&#x8FD8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; ctrl + z &#x4F7F;&#x6211;&#x4EEC;&#x7684;&#x5F53;&#x524D;&#x5DE5;&#x4F5C;&#x505C;&#x6B62;&#x5E76;&#x4E22;&#x5230;&#x540E;&#x53F0;&#x4E2D;&#x53BB;</p>
<p>&#x88AB;&#x505C;&#x6B62;&#x5E76;&#x653E;&#x7F6E;&#x5728;&#x540E;&#x53F0;&#x7684;&#x5DE5;&#x4F5C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x6765;&#x67E5;&#x770B;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">jobs</div></pre></td></tr></table></figure>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#x5C06;&#x540E;&#x53F0;&#x7684;&#x5DE5;&#x4F5C;&#x62FF;&#x5230;&#x524D;&#x53F0;&#x6765;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div></pre></td><td class="code"><pre><div class="line">//&#x540E;&#x9762;&#x4E0D;&#x52A0;&#x53C2;&#x6570;&#x63D0;&#x53D6;&#x9884;&#x8BBE;&#x5DE5;&#x4F5C;&#xFF0C;&#x52A0;&#x53C2;&#x6570;&#x63D0;&#x53D6;&#x6307;&#x5B9A;&#x5DE5;&#x4F5C;&#x7684;&#x7F16;&#x53F7;</div><div class="line">fg [%jobnumber]</div></pre></td></tr></table></figure>
<p>&#x4E4B;&#x524D;&#x6211;&#x4EEC;&#x901A;&#x8FC7; ctrl + z &#x4F7F;&#x5F97;&#x5DE5;&#x4F5C;&#x505C;&#x6B62;&#x653E;&#x7F6E;&#x5728;&#x540E;&#x53F0;&#xFF0C;&#x82E5;&#x662F;&#x6211;&#x4EEC;&#x60F3;&#x8BA9;&#x5176;&#x5728;&#x540E;&#x53F0;&#x8FD0;&#x4F5C;&#x6211;&#x4EEC;&#x5C31;&#x4F7F;&#x7528;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div></pre></td><td class="code"><pre><div class="line">//&#x4E0E;fg&#x7C7B;&#x4F3C;&#xFF0C;&#x52A0;&#x53C2;&#x5219;&#x6307;&#x5B9A;&#xFF0C;&#x4E0D;&#x52A0;&#x53C2;&#x5219;&#x53D6;&#x9884;&#x8BBE;</div><div class="line">bg [%jobnumber]</div></pre></td></tr></table></figure>
<p>&#x65E2;&#x7136;&#x6709;&#x65B9;&#x6CD5;&#x5C06;&#x88AB;&#x653E;&#x7F6E;&#x5728;&#x540E;&#x53F0;&#x7684;&#x5DE5;&#x4F5C;&#x63D0;&#x81F3;&#x524D;&#x53F0;&#x6216;&#x8005;&#x8BA9;&#x5B83;&#x4ECE;&#x505C;&#x6B62;&#x5230;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#x5728;&#x540E;&#x53F0;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x6709;&#x65B9;&#x6CD5;&#x5220;&#x9664;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;&#xFF0C;&#x6216;&#x8005;&#x91CD;&#x542F;&#x7B49;&#x7B49;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div></pre></td><td class="code"><pre><div class="line">//kill&#x7684;&#x4F7F;&#x7528;&#x683C;&#x5F0F;&#x5982;&#x4E0B;</div><div class="line">kill -signal %jobnumber</div><div class="line"></div><div class="line">//signal&#x4ECE;1-64&#x4E2A;&#x4FE1;&#x53F7;&#x503C;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#xFF0C;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x67E5;&#x770B;</div><div class="line">//&#x5728; bash &#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x66F4;&#x5168;&#x9762;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x8FDB;&#x5165;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x8F93;&#x5165; bash </div><div class="line">kill &#xFF0D;l</div></pre></td></tr></table></figure>
<p>&#x5176;&#x4E2D;&#x5E38;&#x7528;&#x7684;&#x6709;&#x8FD9;&#x4E9B;&#x4FE1;&#x53F7;&#x503C;:</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div></pre></td><td class="code"><pre><div class="line"> -1 : &#x91CD;&#x65B0;&#x8BFB;&#x53D6;&#x53C2;&#x6570;&#x8FD0;&#x884C;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E0E;restart</div><div class="line"> -2 : &#x5982;&#x540C; ctrl+c &#x7684;&#x64CD;&#x4F5C;&#x9000;&#x51FA;</div><div class="line"> -9 : &#x5F3A;&#x5236;&#x7EC8;&#x6B62;&#x8BE5;&#x4EFB;&#x52A1;</div><div class="line">-15 : &#x6B63;&#x5E38;&#x7684;&#x65B9;&#x5F0F;&#x7EC8;&#x6B62;&#x8BE5;&#x4EFB;&#x52A1; </div></pre></td></tr></table></figure>
<p>&#x6CE8;&#x610F;:<br>&#x82E5;&#x662F;&#x5728;&#x4F7F;&#x7528;kill&#xFF0B;&#x4FE1;&#x53F7;&#x503C;&#x7136;&#x540E;&#x76F4;&#x63A5;&#x52A0;&#x6570;&#x5B57;&#x7684;&#x8BDD;&#xFF0C;&#x8FD9;&#x4E2A;&#x6570;&#x5B57;&#x4EE3;&#x8868;&#x7684;&#x662F; pid&#xFF0C;&#x4F60;&#x5C06;&#x4F1A;&#x5BF9; pid &#x5BF9;&#x5E94;&#x7684;&#x8FDB;&#x7A0B;&#x505A;&#x64CD;&#x4F5C;;<br>&#x82E5;&#x662F;&#x5728;&#x4F7F;&#x7528;kill+&#x4FE1;&#x53F7;&#x503C;&#x7136;&#x540E;&#xFF05;jobnumber&#xFF0C;&#x8FD9;&#x65F6;&#x6240;&#x64CD;&#x4F5C;&#x7684;&#x5BF9;&#x8C61;&#x624D;&#x662F; job&#xFF0C;&#x8FD9;&#x4E2A;&#x6570;&#x5B57;&#x5C31;&#x662F;&#x5C31;&#x5F53;&#x524D; bash &#x4E2D;&#x540E;&#x53F0;&#x7684;&#x8FD0;&#x884C;&#x7684; job &#x7684; ID</p>
<h2 id="&#x8FDB;&#x7A0B;&#x7684;&#x67E5;&#x770B;"><a href="#&#x8FDB;&#x7A0B;&#x7684;&#x67E5;&#x770B;" class="headerlink" title="&#x8FDB;&#x7A0B;&#x7684;&#x67E5;&#x770B;"></a>&#x8FDB;&#x7A0B;&#x7684;&#x67E5;&#x770B;</h2><p>&#x4E0D;&#x7BA1;&#x5728;&#x6D4B;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#x8FD8;&#x662F;&#x5728;&#x5B9E;&#x9645;&#x7684;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E2D;&#x6216;&#x8005;&#x81EA;&#x5DF1;&#x7684;&#x4F7F;&#x7528;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x96BE;&#x514D;&#x9047;&#x5230;&#x8FDB;&#x7A0B;&#x7684;&#x4E00;&#x4E9B;&#x5F02;&#x5E38;&#xFF0C;&#x6240;&#x4EE5; Linux &#x4E3A;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x5DE5;&#x5177;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x8FDB;&#x7A0B;&#x7684;&#x4E00;&#x4E9B;&#x72B6;&#x6001;&#x4FE1;&#x606F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; top &#x52A8;&#x6001;&#x5B9E;&#x65F6;&#x7684;&#x67E5;&#x770B;&#x8FDB;&#x7A0B;&#x7684;&#x72B6;&#x6001;&#x7684;&#x5DF2;&#x7ECF;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;&#x5982; CPU&#x3001;&#x5185;&#x5B58;&#x4FE1;&#x606F;&#x7B49;&#x7B49;&#xFF0C;&#x6211;&#x4EEC;&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; ps &#x6765;&#x9759;&#x6001;&#x67E5;&#x770B;&#x5F53;&#x524D;&#x7684;&#x8FDB;&#x7A0B;&#x4FE1;&#x606F;&#xFF0C;&#x540C;&#x65F6;&#x6211;&#x4EEC;&#x8FD8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; pstree &#x6765;&#x67E5;&#x770B;&#x5F53;&#x524D;&#x6D3B;&#x8DC3;&#x8FDB;&#x7A0B;&#x7684;&#x6811;&#x5F62;&#x7ED3;&#x6784;</p>
<h2 id="top-&#x5DE5;&#x5177;&#x7684;&#x4F7F;&#x7528;"><a href="#top-&#x5DE5;&#x5177;&#x7684;&#x4F7F;&#x7528;" class="headerlink" title="top &#x5DE5;&#x5177;&#x7684;&#x4F7F;&#x7528;"></a>top &#x5DE5;&#x5177;&#x7684;&#x4F7F;&#x7528;</h2><p>top &#x5DE5;&#x5177;&#x662F;&#x6211;&#x4EEC;&#x5E38;&#x7528;&#x7684;&#x4E00;&#x4E2A;&#x67E5;&#x770B;&#x5DE5;&#x5177;&#xFF0C;&#x4ED6;&#x80FD;&#x5B9E;&#x65F6;&#x7684;&#x67E5;&#x770B;&#x6211;&#x4EEC;&#x7CFB;&#x7EDF;&#x7684;&#x5173;&#x952E;&#x4E00;&#x4E9B;&#x5173;&#x952E;&#x4FE1;&#x606F;&#x7684;&#x53D8;&#x5316;&#x5DF2;&#x7ECF;&#x8FDB;&#x7A0B;&#x5728;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x5B9E;&#x65F6;&#x53D8;&#x5316;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">top</div></pre></td></tr></table></figure>
<p><img src="/2016/11/18/&#x4ECE;&#x96F6;&#x5F00;&#x59CB;&#x5B66;&#x4E60;Linux-12/2.png" alt=""></p>
<p>top &#x662F;&#x4E00;&#x4E2A;&#x5728;&#x524D;&#x53F0;&#x6267;&#x884C;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x6240;&#x4EE5;&#x6267;&#x884C;&#x77E5;&#x9053;&#x4FBF;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x4EA4;&#x4E92;&#x754C;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x6307;&#x4EE4;&#x6765;&#x505A;&#x4E00;&#x4E9B;&#x64CD;&#x4F5C;&#xFF0C;&#x7B5B;&#x9009;&#x3002;</p>
<p><strong>Load Avg</strong> &#x5728; wikipedia &#x4E2D;&#x7684;&#x89E3;&#x91CA;&#x662F; the system load is a measure of the amount of work that a computer system is doing &#x4E5F;&#x5C31;&#x662F;&#x5BF9;&#x5F53;&#x524D; CPU &#x5DE5;&#x4F5C;&#x91CF;&#x7684;&#x5EA6;&#x91CF;&#xFF0C;&#x5177;&#x4F53;&#x6765;&#x8BF4;&#x4E5F;&#x5C31;&#x662F;&#x6307;&#x8FD0;&#x884C;&#x961F;&#x5217;&#x7684;&#x5E73;&#x5747;&#x957F;&#x5EA6;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x7B49;&#x5F85;CPU&#x7684;&#x5E73;&#x5747;&#x8FDB;&#x7A0B;&#x6570;&#x76F8;&#x5173;&#x7684;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#x503C;&#x3002;</p>
<p><strong>CPU usage</strong>&#xFF0C;&#x662F;&#x5BF9;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6BB5;&#x5185; CPU &#x4F7F;&#x7528;&#x72B6;&#x51B5;&#x7684;&#x7EDF;&#x8BA1;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x6307;&#x6807;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x5728;&#x67D0;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6BB5;&#x5185; CPU &#x88AB;&#x5360;&#x7528;&#x7684;&#x60C5;&#x51B5;&#xFF0C;Load Average &#x662F; CPU &#x7684; Load&#xFF0C;&#x5B83;&#x6240;&#x5305;&#x542B;&#x7684;&#x4FE1;&#x606F;&#x4E0D;&#x662F; CPU &#x7684;&#x4F7F;&#x7528;&#x7387;&#x72B6;&#x51B5;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185; CPU &#x6B63;&#x5728;&#x5904;&#x7406;&#x4EE5;&#x53CA;&#x7B49;&#x5F85; CPU &#x5904;&#x7406;&#x7684;&#x8FDB;&#x7A0B;&#x6570;&#x60C5;&#x51B5;&#x7EDF;&#x8BA1;&#x4FE1;&#x606F;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x6307;&#x6807;&#x5E76;&#x4E0D;&#x4E00;&#x6837;</p>
<h2 id="ps-&#x5DE5;&#x5177;&#x7684;&#x4F7F;&#x7528;"><a href="#ps-&#x5DE5;&#x5177;&#x7684;&#x4F7F;&#x7528;" class="headerlink" title="ps &#x5DE5;&#x5177;&#x7684;&#x4F7F;&#x7528;"></a>ps &#x5DE5;&#x5177;&#x7684;&#x4F7F;&#x7528;</h2><p>ps &#x4E5F;&#x662F;&#x6211;&#x4EEC;&#x6700;&#x5E38;&#x7528;&#x7684;&#x67E5;&#x770B;&#x8FDB;&#x7A0B;&#x7684;&#x5DE5;&#x5177;&#x4E4B;&#x4E00;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#x6765;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;&#xFF0C;&#x4ED6;&#x80FD;&#x7ED9;&#x6211;&#x5E26;&#x6765;&#x54EA;&#x4E9B;&#x6D88;&#x606F;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div></pre></td><td class="code"><pre><div class="line">ps aux</div><div class="line">ps axjf</div></pre></td></tr></table></figure>
<p>&#x6211;&#x4EEC;&#x6765;&#x603B;&#x4F53;&#x4E86;&#x89E3;&#x4E0B;&#x4F1A;&#x51FA;&#x73B0;&#x54EA;&#x4E9B;&#x4FE1;&#x606F;&#x7ED9;&#x6211;&#x4EEC;&#xFF0C;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x53C8;&#x4EE3;&#x8868;&#x7740;&#x4EC0;&#x4E48;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div><div class="line">17</div></pre></td><td class="code"><pre><div class="line">F : &#x8FDB;&#x7A0B;&#x7684;&#x6807;&#x5FD7; &#x70BA; 4 &#x8868;&#x793A;&#x6B64;&#x7A0B;&#x5E8F;&#x7684;&#x6B0A;&#x9650;&#x70BA; root&#xFF0C;&#x82E5;&#x70BA; 1 &#x5247;&#x8868;&#x793A;&#x6B64;&#x5B50;&#x7A0B;&#x5E8F;&#x50C5;&#x9032;&#x884C;&#x8907;&#x88FD;(fork)&#x800C;&#x6C92;&#x6709;&#x5BE6;&#x969B;&#x57F7;&#x884C;(exec)</div><div class="line">USER : &#x8FDB;&#x7A0B;&#x7684;&#x5C5E;&#x4E3B;</div><div class="line">PID : &#x8FDB;&#x7A0B;&#x7684;ID</div><div class="line">PPID : &#x5176;&#x7236;&#x8FDB;&#x7A0B;&#x7684;PID</div><div class="line">SID : session&#x7684;ID</div><div class="line">TGPID : &#x524D;&#x53F0;&#x8FDB;&#x7A0B;&#x7EC4;&#x7684;ID</div><div class="line">%CPU : &#x8FDB;&#x7A0B;&#x5360;&#x7528;&#x7684;CPU&#x767E;&#x5206;&#x6BD4;</div><div class="line">%MEM : &#x5360;&#x7528;&#x5185;&#x5B58;&#x7684;&#x767E;&#x5206;&#x6BD4;</div><div class="line">NI : &#x8FDB;&#x7A0B;&#x7684;NICE&#x503C;</div><div class="line">VSZ : &#x8FDB;&#x7A0B;&#x4F7F;&#x7528;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x5927;&#x5C0F;</div><div class="line">RSS : &#x9A7B;&#x7559;&#x5185;&#x5B58;&#x4E2D;&#x9875;&#x7684;&#x5927;&#x5C0F;</div><div class="line">TTD : &#x7EC8;&#x7AEF;ID</div><div class="line">S or STAT : &#x8FDB;&#x7A0B;&#x72B6;&#x6001;</div><div class="line">WCHAN : &#x6B63;&#x5728;&#x7B49;&#x5F85;&#x7684;&#x8FDB;&#x7A0B;&#x8D44;&#x6E90;</div><div class="line">START : &#x542F;&#x52A8;&#x8FDB;&#x7A0B;&#x7684;&#x65F6;&#x95F4;</div><div class="line">TIME : &#x8FDB;&#x7A0B;&#x6D88;&#x8017;CPU&#x7684;&#x65F6;&#x95F4;</div><div class="line">COMMAND : &#x547D;&#x4EE4;&#x7684;&#x540D;&#x79F0;&#x548C;&#x53C2;&#x6570;</div></pre></td></tr></table></figure>
<p><strong>TPGID</strong>&#x680F;&#x5199;&#x7740;-1&#x7684;&#x90FD;&#x662F;&#x6CA1;&#x6709;&#x63A7;&#x5236;&#x7EC8;&#x7AEF;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;</p>
<p><strong>STAT</strong>&#x8868;&#x793A;&#x8FDB;&#x7A0B;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x800C;&#x8FDB;&#x7A0B;&#x7684;&#x72B6;&#x6001;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x5982;&#x4E0B;&#x8868;&#x6240;&#x793A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div></pre></td><td class="code"><pre><div class="line">R : Running.&#x8FD0;&#x884C;&#x4E2D;</div><div class="line">S : Interruptible Sleep.&#x7B49;&#x5F85;&#x8C03;&#x7528;</div><div class="line">D : Uninterruptible Sleep.&#x4E0D;&#x53EF;&#x7EC8;&#x7AEF;&#x7761;&#x7720;</div><div class="line">T : Stoped.&#x6682;&#x505C;&#x6216;&#x8005;&#x8DDF;&#x8E2A;&#x72B6;&#x6001;</div><div class="line">X : Dead.&#x5373;&#x5C06;&#x88AB;&#x64A4;&#x9500;</div><div class="line">Z : Zombie.&#x50F5;&#x5C38;&#x8FDB;&#x7A0B;</div><div class="line">W : Paging.&#x5185;&#x5B58;&#x4EA4;&#x6362;</div><div class="line">N : &#x4F18;&#x5148;&#x7EA7;&#x4F4E;&#x7684;&#x8FDB;&#x7A0B;</div><div class="line">&lt; : &#x4F18;&#x5148;&#x7EA7;&#x9AD8;&#x7684;&#x8FDB;&#x7A0B;</div><div class="line">s : &#x8FDB;&#x7A0B;&#x7684;&#x9886;&#x5BFC;&#x8005;</div><div class="line">L : &#x9501;&#x5B9A;&#x72B6;&#x6001;</div><div class="line">| : &#x591A;&#x7EBF;&#x7A0B;&#x72B6;&#x6001;</div><div class="line">+ : &#x524D;&#x53F0;&#x8FDB;&#x7A0B;</div></pre></td></tr></table></figure>
<p>&#x5176;&#x4E2D;&#x7684; D &#x4E0D;&#x53EF;&#x7EC8;&#x7AEF;&#x7761;&#x7720;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x5904;&#x5728;&#x8FD9;&#x79CD;&#x72B6;&#x6001;&#x7684;&#x8FDB;&#x7A0B;&#x4E0D;&#x63A5;&#x53D7;&#x5916;&#x6765;&#x7684;&#x4EFB;&#x4F55;signal&#xFF0C;&#x6240;&#x4EE5;&#x65E0;&#x6CD5;&#x4F7F;&#x7528; kill &#x547D;&#x4EE4;&#x6740;&#x6389;&#x5904;&#x4E8E;D&#x72B6;&#x6001;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x65E0;&#x8BBA;&#x662F; kill&#xFF0C;kill -9 &#x8FD8;&#x662F; kill -15&#xFF0C;&#x4E00;&#x822C;&#x5904;&#x4E8E;&#x8FD9;&#x79CD;&#x72B6;&#x6001;&#x53EF;&#x80FD;&#x662F;&#x8FDB;&#x7A0B; IO &#x7684;&#x65F6;&#x5019;&#x51FA;&#x95EE;&#x9898;&#x4E86;&#x3002;</p>
<p>ps &#x5DE5;&#x5177;&#x6709;&#x8BB8;&#x591A;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x4E0B;&#x9762;&#x7ED9;&#x5927;&#x5BB6;&#x89E3;&#x91CA;&#x90E8;&#x5206;&#x5E38;&#x7528;&#x7684;&#x53C2;&#x6570;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div></pre></td><td class="code"><pre><div class="line">-l : &#x53EF;&#x4EE5;&#x663E;&#x793A;&#x81EA;&#x5DF1;&#x8FD9;&#x6B21;&#x767B;&#x9646;&#x7684; bash &#x76F8;&#x5173;&#x7684;&#x8FDB;&#x7A0B;&#x4FE1;&#x606F;&#x7F57;&#x5217;&#x51FA;&#x6765;</div><div class="line">aux : &#x5C06;&#x4F1A;&#x7F57;&#x5217;&#x51FA;&#x6240;&#x6709;&#x7684;&#x8FDB;&#x7A0B;&#x4FE1;&#x606F;</div><div class="line">aux | grep zsh : &#x67E5;&#x627E;&#x5176;&#x4E2D;&#x7684;&#x67D0;&#x4E2A;&#x8FDB;&#x7A0B;</div><div class="line">axjf : &#x67E5;&#x770B;&#x65F6;&#xFF0C;&#x5C06;&#x8FDE;&#x540C;&#x90E8;&#x5206;&#x7684;&#x8FDB;&#x7A0B;&#x5448;&#x6811;&#x72B6;&#x663E;&#x793A;&#x51FA;&#x6765;</div><div class="line">&#xFF0D;afxo user,ppid,pid,pgid,command : &#x6765;&#x81EA;&#x5B9A;&#x4E49;&#x6211;&#x4EEC;&#x6240;&#x9700;&#x8981;&#x7684;&#x53C2;&#x6570;&#x663E;&#x793A;</div></pre></td></tr></table></figure>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x800C;&#x53C8;&#x5B9E;&#x7528;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x60F3;&#x8981;&#x66F4;&#x7075;&#x6D3B;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x60F3;&#x8981;&#x77E5;&#x9053;&#x66F4;&#x591A;&#x7684;&#x53C2;&#x6570;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; man &#x6765;&#x83B7;&#x53D6;&#x66F4;&#x591A;&#x76F8;&#x5173;&#x7684;&#x4FE1;&#x606F;</p>
<h2 id="pstree-&#x5DE5;&#x5177;&#x7684;&#x4F7F;&#x7528;"><a href="#pstree-&#x5DE5;&#x5177;&#x7684;&#x4F7F;&#x7528;" class="headerlink" title="pstree &#x5DE5;&#x5177;&#x7684;&#x4F7F;&#x7528;"></a>pstree &#x5DE5;&#x5177;&#x7684;&#x4F7F;&#x7528;</h2><p>&#x901A;&#x8FC7; pstree &#x53EF;&#x4EE5;&#x5F88;&#x76F4;&#x63A5;&#x7684;&#x770B;&#x5230;&#x76F8;&#x540C;&#x7684;&#x8FDB;&#x7A0B;&#x6570;&#x91CF;&#xFF0C;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x8FD8;&#x662F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6240;&#x6709;&#x8FDB;&#x7A0B;&#x7684;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x5173;&#x6027;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div></pre></td><td class="code"><pre><div class="line">pstree -up</div><div class="line"></div><div class="line">//&#x53C2;&#x6570;&#x9009;&#x62E9;&#xFF1A;</div><div class="line">//-A &#xFF1A;&#x5404;&#x7A0B;&#x5E8F;&#x6811;&#x4E4B;&#x95F4;&#x4EE5; ASCII &#x5B57;&#x5143;&#x4F86;&#x9023;&#x63A5;&#xFF1B;</div><div class="line">//-p &#xFF1A;&#x540C;&#x65F6;&#x5217;&#x51FA;&#x6BCF;&#x4E2A; process &#x7684; PID&#xFF1B;</div><div class="line">//-u &#xFF1A;&#x540C;&#x65F6;&#x5217;&#x51FA;&#x6BCF;&#x4E2A; process &#x7684;&#x6240;&#x5C6C;&#x8D26;&#x6237;&#x540D;&#x79F0;&#x3002;</div></pre></td></tr></table></figure>
<h2 id="kill&#x547D;&#x4EE4;&#x7684;&#x638C;&#x63E1;"><a href="#kill&#x547D;&#x4EE4;&#x7684;&#x638C;&#x63E1;" class="headerlink" title="kill&#x547D;&#x4EE4;&#x7684;&#x638C;&#x63E1;"></a>kill&#x547D;&#x4EE4;&#x7684;&#x638C;&#x63E1;</h2><p>&#x4E0A;&#x9762;&#x8BB2;&#x8BC9;&#x4E86;&#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x662F;&#x5982;&#x4F55;&#x884D;&#x751F;&#xFF0C;&#x4E4B;&#x95F4;&#x53C8;&#x6709;&#x4EC0;&#x4E48;&#x76F8;&#x5173;&#x6027;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x56DE;&#x987E;&#x4E00;&#x4E0B;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x7ED3;&#x675F;&#x7684;&#x65F6;&#x5019;&#x6216;&#x8005;&#x8981;&#x5F02;&#x5E38;&#x7ED3;&#x675F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x5411;&#x5176;&#x7236;&#x8FDB;&#x7A0B;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x6216;&#x8005;&#x63A5;&#x6536;&#x4E00;&#x4E2A; SIGHUP &#x4FE1;&#x53F7;&#x800C;&#x505A;&#x51FA;&#x7684;&#x7ED3;&#x675F;&#x8FDB;&#x7A0B;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x4E2A; SIGHUP &#x4FE1;&#x53F7;&#x4E0D;&#x4EC5;&#x53EF;&#x4EE5;&#x7531;&#x7CFB;&#x7EDF;&#x53D1;&#x9001;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; kill &#x6765;&#x53D1;&#x9001;&#x8FD9;&#x4E2A;&#x4FE1;&#x53F7;&#x6765;&#x64CD;&#x4F5C;&#x8FDB;&#x7A0B;&#x7684;&#x7ED3;&#x675F;&#x6216;&#x8005;&#x91CD;&#x542F;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4F7F;&#x7528; kill &#x547D;&#x4EE4;&#x6765;&#x7BA1;&#x7406;&#x6211;&#x4EEC;&#x7684;&#x4E00;&#x4E9B; job&#xFF0C;&#x73B0;&#x5728;&#x5C06;&#x5C1D;&#x8BD5;&#x7528; kill &#x6765;&#x64CD;&#x4F5C;&#x4E0B;&#x4E00;&#x4E9B;&#x4E0D;&#x5C5E;&#x4E8E; job &#x8303;&#x7574;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x76F4;&#x63A5;&#x5BF9; pid &#x4E0B;&#x624B;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div></pre></td><td class="code"><pre><div class="line">//&#x9996;&#x5148;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x56FE;&#x5F62;&#x754C;&#x9762;&#x6253;&#x5F00;&#x4E86; gedit&#x3001;gvim&#xFF0C;&#x7528; ps &#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x5230;</div><div class="line">ps aux</div><div class="line"></div><div class="line">//&#x4F7F;&#x7528;9&#x8FD9;&#x4E2A;&#x4FE1;&#x53F7;&#x5F3A;&#x5236;&#x7ED3;&#x675F; gedit &#x8FDB;&#x7A0B;</div><div class="line">kill -9 1608</div><div class="line"></div><div class="line">//&#x6211;&#x4EEC;&#x5728;&#x67E5;&#x627E;&#x8FD9;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x627E;&#x4E0D;&#x5230;&#x4E86;</div><div class="line">ps aux | grep gedit</div></pre></td></tr></table></figure>
<h2 id="&#x8FDB;&#x7A0B;&#x7684;&#x6267;&#x884C;&#x987A;&#x5E8F;"><a href="#&#x8FDB;&#x7A0B;&#x7684;&#x6267;&#x884C;&#x987A;&#x5E8F;" class="headerlink" title="&#x8FDB;&#x7A0B;&#x7684;&#x6267;&#x884C;&#x987A;&#x5E8F;"></a>&#x8FDB;&#x7A0B;&#x7684;&#x6267;&#x884C;&#x987A;&#x5E8F;</h2><p>&#x6211;&#x4EEC;&#x5728;&#x662F;&#x4F7F;&#x7528; ps &#x547D;&#x4EE4;&#x7684;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5927;&#x90E8;&#x5206;&#x7684;&#x8FDB;&#x7A0B;&#x90FD;&#x662F;&#x5904;&#x4E8E;&#x4F11;&#x7720;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E9B;&#x8FDB;&#x7A0B;&#x90FD;&#x88AB;&#x5524;&#x9192;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x8C01;&#x6700;&#x5148;&#x4EAB;&#x53D7; CPU &#x7684;&#x670D;&#x52A1;&#xFF0C;&#x540E;&#x9762;&#x7684;&#x8FDB;&#x7A0B;&#x53C8;&#x8BE5;&#x662F;&#x4E00;&#x4E2A;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x987A;&#x5E8F;&#x5462;&#xFF1F;&#x8FDB;&#x7A0B;&#x8C03;&#x5EA6;&#x7684;&#x961F;&#x5217;&#x53C8;&#x8BE5;&#x5982;&#x4F55;&#x53BB;&#x6392;&#x5217;&#x5462;&#xFF1F;</p>
<p>&#x5F53;&#x7136;&#x5C31;&#x662F;&#x9760;&#x8BE5;&#x8FDB;&#x7A0B;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x503C;&#x6765;&#x5224;&#x5B9A;&#x8FDB;&#x7A0B;&#x8C03;&#x5EA6;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x800C;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x503C;&#x5C31;&#x662F;&#x4E0A;&#x6587;&#x6240;&#x63D0;&#x5230;&#x7684; PR &#x4E0E; nice &#x6765;&#x63A7;&#x5236;&#x4E0E;&#x4F53;&#x73B0;&#x4E86;</p>
<p>&#x800C; nice &#x7684;&#x503C;&#x6211;&#x4EEC;&#x662F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; nice &#x547D;&#x4EE4;&#x6765;&#x4FEE;&#x6539;&#x7684;&#xFF0C;&#x800C;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F; nice &#x503C;&#x53EF;&#x4EE5;&#x8C03;&#x6574;&#x7684;&#x8303;&#x56F4;&#x662F; -20 ~ 19&#xFF0C;&#x5176;&#x4E2D; root &#x6709;&#x7740;&#x81F3;&#x9AD8;&#x65E0;&#x4E0A;&#x7684;&#x6743;&#x529B;&#xFF0C;&#x65E2;&#x53EF;&#x4EE5;&#x8C03;&#x6574;&#x81EA;&#x5DF1;&#x7684;&#x8FDB;&#x7A0B;&#x4E5F;&#x53EF;&#x4EE5;&#x8C03;&#x6574;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x5E76;&#x4E14;&#x662F;&#x6240;&#x6709;&#x7684;&#x503C;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#xFF0C;&#x800C;&#x666E;&#x901A;&#x7528;&#x6237;&#x53EA;&#x53EF;&#x4EE5;&#x8C03;&#x5236;&#x5C5E;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x5E76;&#x4E14;&#x5176;&#x4F7F;&#x7528;&#x7684;&#x8303;&#x56F4;&#x53EA;&#x80FD;&#x662F; 0 ~ 19&#xFF0C;&#x56E0;&#x4E3A;&#x7CFB;&#x7EDF;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x4E00;&#x822C;&#x7528;&#x6237;&#x62A2;&#x5360;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x800C;&#x8BBE;&#x7F6E;&#x7684;&#x4E00;&#x4E2A;&#x9650;&#x5236;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div></pre></td><td class="code"><pre><div class="line">//&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x653E;&#x5728;&#x540E;&#x53F0;&#xFF0C;&#x6216;&#x8005;&#x7528;&#x56FE;&#x5F62;&#x754C;&#x9762;&#x6253;&#x5F00;</div><div class="line">nice -n -5 vim &amp;</div><div class="line"></div><div class="line">//&#x7528; ps &#x67E5;&#x770B;&#x5176;&#x4F18;&#x5148;&#x7EA7;</div><div class="line">ps -afxo user,ppid,pid,stat,pri,ni,time,command | grep vim</div></pre></td></tr></table></figure>
<p>&#x6211;&#x4EEC;&#x8FD8;&#x53EF;&#x4EE5;&#x7528; renice &#x6765;&#x4FEE;&#x6539;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x7684;&#x8FDB;&#x7A0B;&#x7684;&#x4F18;&#x5148;&#x7EA7;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">renice -5 pid</div></pre></td></tr></table></figure>

      
    </div><!-- .entry-content -->

    <footer class="entry-meta">
    <a href="/2016/11/18/从零开始学习Linux-12/">
    <time datetime="2016-11-18T11:33:15.000Z" class="entry-date">
        2016-11-18
    </time>
</a>
    
  <span class="article-delim">&#8226;</span>
  <div class="article-category">
  <a class="article-category-link" href="/categories/编程/">编程</a>
  </div>

    
  <span class="article-delim">&#8226;</span>
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/Linux/">Linux</a></li></ul>

    </footer>
</article>


    
<nav class="nav-single">
    <h3 class="assistive-text">文章导航</h3>
    
        <span class="nav-previous"><a href="/2016/11/18/从零开始学习Linux-13/" rel="prev"><span class="meta-nav">←</span> 从零开始学习Linux-13</a></span>
    
    
        <span class="nav-next"><a href="/2016/11/18/cmatrix的安装/" rel="next">cmatrix的安装 <span class="meta-nav">→</span></a></span>
    
</nav><!-- .nav-single -->







</div></div>
        <div id="secondary" class="widget-area" role="complementary">
  
    <aside id="search" class="widget widget_search"><form role="search" method="get" accept-charset="utf-8" id="searchform" class="searchform" action="//google.com/search">
    <div>
        <input type="text" value="" name="s" id="s" />
        <input type="submit" id="searchsubmit" value="搜索" />
    </div>
</form></aside>
  
    
  
    
  <aside class="widget">
    <h3 class="widget-title">Categories</h3>
    <div class="widget-content">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/LIFE/">LIFE</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/MAC/">MAC</a><span class="category-list-count">3</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/ML/">ML</a><span class="category-list-count">11</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/PGM/">PGM</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/iOS/">iOS</a><span class="category-list-count">22</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/御宅文化/">御宅文化</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/编程/">编程</a><span class="category-list-count">55</span></li></ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Recents</h3>
    <div class="widget-content">
      <ul>
        
          <li>
            <a href="/2017/03/12/决策树/">决策树</a>
          </li>
        
          <li>
            <a href="/2017/03/07/k-means算法的实现/">K-Means算法的实现</a>
          </li>
        
          <li>
            <a href="/2017/02/20/iPad-splitView-popover/">iPad开发之--splitView和popover</a>
          </li>
        
          <li>
            <a href="/2017/02/13/iOS-protocol/">iOS-Protocol</a>
          </li>
        
          <li>
            <a href="/2017/01/29/PGM-1/">PGM(一)--Introduction and Overview</a>
          </li>
        
      </ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Tags</h3>
    <div class="widget-content">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/Cocoapods/">Cocoapods</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/HTML/">HTML</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Linux/">Linux</a><span class="tag-list-count">15</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Machine-Learning/">Machine Learning</a><span class="tag-list-count">11</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Matlab/">Matlab</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/MySQL/">MySQL</a><span class="tag-list-count">3</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Probabilistic-Graphical-Models/">Probabilistic Graphical Models</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIColor/">UIColor</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView/">UIView</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView-圆角/">UIView-圆角</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Vim/">Vim</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/bug/">bug</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/hexo/">hexo</a><span class="tag-list-count">4</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/指针/">指针</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/数据结构/">数据结构</a><span class="tag-list-count">20</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/算法/">算法</a><span class="tag-list-count">8</span></li></ul>
    </div>
  </aside>

  
    
<div class="widget tag">
<h3 class="title">blogroll</h3>
<ul class="entry">


<li><a href="https://github.com/" target="_blank">github</a></li>


<li><a href="http://www.jianshu.com/users/41cd7711ed44/latest_articles" target="_blank">我的简书主页</a></li>

</ul>
</div>

  
</div>
      </div>
      <footer id="colophon" role="contentinfo">
    <p>&copy; 2017 SaberDa
    All rights reserved.</p>
    <p>Powered by <a href="http://hexo.io/" target="_blank">Hexo</a></p>
</footer>
    <script>window._bd_share_config={"common":{"bdSnsKey":{},"bdText":"","bdMini":"1","bdMiniList":false,"bdPic":"","bdStyle":"2","bdSize":"16"},"share":{}};with(document)0[(getElementsByTagName('head')[0]||body).appendChild(createElement('script')).src='http://bdimg.share.baidu.com/static/api/js/share.js?v=89860593.js?cdnversion='+~(-new Date()/36e5)];</script>

<script src="/js/jquery-2.0.3.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

<script src="/js/navigation.js"></script>

<div id="bg"></div>

  </div>
</body>
</html>