<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  
  <meta name="description" content="阿尔托利亚是我老婆~" />
  

  
  
  
  
  
  
  <title>从零开始学习Linux-0 | SaberDa的幻想乡</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x8FD9;&amp;#x4E2A;&amp;#x7CFB;&amp;#x5217;&amp;#x7684;&amp;#x6587;&amp;#x7AE0;&amp;#x76F8;&amp;#x5F53;&amp;#x4E8E;&amp;#x6211;&amp;#x8FD9;&amp;#x6BB5;&amp;#x5B66;&amp;#x4E60;Linux&amp;#x7684;&amp;#x5B66;&amp;#x4E60;&amp;#x7B14;&amp;#x8BB0;&amp;#x7F62;&amp;#x4E86;&amp;#xFF0C;&amp;#x5E76;&amp;#x">
<meta property="og:type" content="article">
<meta property="og:title" content="从零开始学习Linux-0">
<meta property="og:url" content="https://saberda.github.io/2016/10/29/从零开始学习Linux-0/index.html">
<meta property="og:site_name" content="SaberDa的幻想乡">
<meta property="og:description" content="&amp;#x8FD9;&amp;#x4E2A;&amp;#x7CFB;&amp;#x5217;&amp;#x7684;&amp;#x6587;&amp;#x7AE0;&amp;#x76F8;&amp;#x5F53;&amp;#x4E8E;&amp;#x6211;&amp;#x8FD9;&amp;#x6BB5;&amp;#x5B66;&amp;#x4E60;Linux&amp;#x7684;&amp;#x5B66;&amp;#x4E60;&amp;#x7B14;&amp;#x8BB0;&amp;#x7F62;&amp;#x4E86;&amp;#xFF0C;&amp;#x5E76;&amp;#x">
<meta property="og:image" content="https://saberda.github.io/2016/10/29/从零开始学习Linux-0/1.png">
<meta property="og:image" content="https://saberda.github.io/2016/10/29/从零开始学习Linux-0/2.png">
<meta property="og:image" content="https://saberda.github.io/2016/10/29/从零开始学习Linux-0/3.png">
<meta property="og:updated_time" content="2016-11-05T17:00:09.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="从零开始学习Linux-0">
<meta name="twitter:description" content="&amp;#x8FD9;&amp;#x4E2A;&amp;#x7CFB;&amp;#x5217;&amp;#x7684;&amp;#x6587;&amp;#x7AE0;&amp;#x76F8;&amp;#x5F53;&amp;#x4E8E;&amp;#x6211;&amp;#x8FD9;&amp;#x6BB5;&amp;#x5B66;&amp;#x4E60;Linux&amp;#x7684;&amp;#x5B66;&amp;#x4E60;&amp;#x7B14;&amp;#x8BB0;&amp;#x7F62;&amp;#x4E86;&amp;#xFF0C;&amp;#x5E76;&amp;#x">
<meta name="twitter:image" content="https://saberda.github.io/2016/10/29/从零开始学习Linux-0/1.png">
  
  
    <link rel="icon" href="/css/images/favicon.ico">
  
  <link rel="stylesheet" href="/css/style.css">
  

  
  <!-- baidu webmaster push -->
  <script src='//push.zhanzhang.baidu.com/push.js'></script>
</head>
<body class="home blog custom-background custom-font-enabled single-author">
  <div id="page" class="hfeed site">
      <header id="masthead" class="site-header" role="banner">
    <hgroup>
      <h1 class="site-title">
        <a href="/" title="SaberDa的幻想乡" rel="home">SaberDa的幻想乡</a>
      </h1>
      
        <h2 class="site-description">
          <a href="/" id="subtitle">　　iOS/ ML　　|　　二次元　　|　　saberda@qq.com　　|　　虽则如云，匪我思存</a>
        </h2>
      
    </hgroup>

    <nav id="site-navigation" class="main-navigation" role="navigation">
            <button class="menu-toggle">菜单</button>
            <a class="assistive-text" href="/#content" title="跳至内容">跳至内容</a><!--TODO-->
            <div class="menu-main-container">
                <ul id="menu-main" class="nav-menu">
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/archives">所有文章</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/">主页</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/编程/">编程</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/iOS/">iOS</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/ML/">ML</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/PGM/">PGM</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/MAC/">MAC</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/御宅文化/">御宅文化</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/LIFE/">LIFE</a></li>
                
                </ul>
            </div>
    </nav>
</header>
      <div id="main" class="wrapper">
        <div id="primary" class="site-content"><div id="content" role="main"><article id="post-从零开始学习Linux-0" class="post-从零开始学习Linux-0 post type-post status-publish format-standard hentry">
    <!---->

      <header class="entry-header">
        
        
  
    <h1 class="entry-title article-title">
      从零开始学习Linux-0
    </h1>
  

        
        <div class="comments-link">
            
            <a href="javascript:void(0);" data-url="https://saberda.github.io/2016/10/29/从零开始学习Linux-0/" data-id="cj8onfzmo0040fib3isa4nfss" class="leave-reply bdsharebuttonbox" data-cmd="more">Share</a>
        </div><!-- .comments-link -->
      </header><!-- .entry-header -->

    <div class="entry-content">
      
        <pre><code>&#x8FD9;&#x4E2A;&#x7CFB;&#x5217;&#x7684;&#x6587;&#x7AE0;&#x76F8;&#x5F53;&#x4E8E;&#x6211;&#x8FD9;&#x6BB5;&#x5B66;&#x4E60;Linux&#x7684;&#x5B66;&#x4E60;&#x7B14;&#x8BB0;&#x7F62;&#x4E86;&#xFF0C;&#x5E76;&#x65E0;&#x5176;&#x4ED6;&#x7528;&#x5904;
</code></pre><h2 id="Linux&#x7EC8;&#x7AEF;&#x7684;&#x64CD;&#x4F5C;"><a href="#Linux&#x7EC8;&#x7AEF;&#x7684;&#x64CD;&#x4F5C;" class="headerlink" title="Linux&#x7EC8;&#x7AEF;&#x7684;&#x64CD;&#x4F5C;"></a>Linux&#x7EC8;&#x7AEF;&#x7684;&#x64CD;&#x4F5C;</h2><pre><code>1.Terminal&#x7EC8;&#x7AEF;
</code></pre><p>&#x901A;&#x5E38;&#x5728;&#x6211;&#x4EEC;&#x4F7F;&#x7528; Linux &#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x4E0E;&#x7CFB;&#x7EDF;&#x6253;&#x4EA4;&#x9053;&#xFF0C;&#x800C;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x53EB;&#x505A; Shell &#x7684;&#x4E2D;&#x95F4;&#x7A0B;&#x5E8F;&#x6765;&#x5B8C;&#x6210;&#x7684;&#xFF0C;&#x5728;&#x56FE;&#x5F62;&#x754C;&#x9762;&#x4E0B;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x8BA9;&#x6211;&#x4EEC;&#x5728;&#x4E00;&#x4E2A;&#x7A97;&#x53E3;&#x4E2D;&#x5B8C;&#x6210;&#x63A5;&#x53D7;&#x7528;&#x6237;&#x8F93;&#x5165;&#x548C;&#x663E;&#x793A;&#x8F93;&#x51FA;&#xFF0C;Linux &#x7CFB;&#x7EDF;&#x8FD8;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x53EB;&#x505A;&#x7EC8;&#x7AEF;&#x6A21;&#x62DF;&#x5668;&#x7684;&#x7A0B;&#x5E8F;&#xFF08;Terminal&#xFF09;&#xFF0C;&#x4E0B;&#x9762;&#x51E0;&#x4E2A;&#x6BD4;&#x8F83;&#x5E38;&#x89C1;&#x7684;&#x7EC8;&#x7AEF;&#x6A21;&#x62DF;&#x5668;&#xFF0C;&#x4F8B;&#x5982; gnome-terminal&#xFF0C;kconsole&#xFF0C;xterm&#xFF0C;rxvt&#xFF0C;kvt&#xFF0C;nxterm &#x548C; eterm</p>
<a id="more"></a>
<p>&#x4E0D;&#x8FC7;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x8FD9;&#x91CC;&#x6240;&#x8BF4;&#x7684;&#x7EC8;&#x7AEF;&#xFF08;Terminal&#xFF09;&#x548C;&#x63A7;&#x5236;&#x53F0;&#xFF08;Console&#xFF09;&#x662F;&#x6709;&#x533A;&#x522B;&#x7684;</p>
<p>&#x7EC8;&#x7AEF;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x5BF9;&#x5E94;&#x7740; Linux &#x4E0A;&#x7684; /dev/tty &#x8BBE;&#x5907;&#xFF0C;Linux &#x7684;&#x591A;&#x7528;&#x6237;&#x767B;&#x9646;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x4E0D;&#x540C;&#x7684; /dev/tty &#x8BBE;&#x5907;&#x5B8C;&#x6210;&#x7684;&#xFF0C;Linux &#x9ED8;&#x8BA4;&#x63D0;&#x4F9B;&#x4E86; 6 &#x4E2A;&#x7EAF;&#x547D;&#x4EE4;&#x884C;&#x754C;&#x9762;&#x7684; &#x201C;terminal&#x201D;&#xFF08;&#x51C6;&#x786E;&#x7684;&#x8BF4;&#x8FD9;&#x91CC;&#x5E94;&#x8BE5;&#x662F; 6 &#x4E2A; virtual consoles&#xFF09;&#x6765;&#x8BA9;&#x7528;&#x6237;&#x767B;&#x5F55;&#xFF0C;&#x5728;&#x7269;&#x7406;&#x673A;&#x7CFB;&#x7EDF;&#x4E0A;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F7F;&#x7528;[Ctrl]+[Alt]+[F1]&#xFF5E;[F6]&#x8FDB;&#x884C;&#x5207;&#x6362;&#xFF0C;&#x4E0D;&#x8FC7;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x5728;&#x7EBF;&#x5B9E;&#x9A8C;&#x73AF;&#x5883;&#x4E2D;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x5207;&#x6362;&#xFF0C;&#x56E0;&#x4E3A;&#x7279;&#x6B8A;&#x529F;&#x80FD;&#x6309;&#x952E;&#x4F1A;&#x88AB;&#x4F60;&#x4E3B;&#x673A;&#x7CFB;&#x7EDF;&#x52AB;&#x6301;&#x3002;&#x5F53;&#x4F60;&#x5207;&#x6362;&#x5230;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x7EC8;&#x7AEF;&#x540E;&#x60F3;&#x8981;&#x5207;&#x6362;&#x56DE;&#x56FE;&#x5F62;&#x754C;&#x9762;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6309;&#x4E0B;[Ctrl]+[Alt]+[F7]&#x6765;&#x5B8C;&#x6210;</p>
<pre><code>2.Shell
</code></pre><p>&#x901A;&#x5E38;&#x5728;&#x56FE;&#x5F62;&#x754C;&#x9762;&#x4E2D;&#x5BF9;&#x5B9E;&#x9645;&#x4F53;&#x9A8C;&#x5E26;&#x6765;&#x5DEE;&#x5F02;&#x7684;&#x4E0D;&#x662F;&#x4E0A;&#x8FF0;&#x7684;&#x4E0D;&#x540C;&#x53D1;&#x884C;&#x7248;&#x7684;&#x5404;&#x79CD;&#x7EC8;&#x7AEF;&#x6A21;&#x62DF;&#x5668;&#xFF0C;&#x800C;&#x5927;&#x90FD;&#x662F;&#x8FD9;&#x4E2A; Shell&#xFF08;&#x58F3;&#xFF09;&#xFF0C;&#x6709;&#x58F3;&#x5C31;&#x6709;&#x6838;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x6838;&#x5C31;&#x662F;&#x6307;&#x7684; UNIX/Linux &#x5185;&#x6838;&#xFF0C;Shell &#x662F;&#x6307;&#x201C;&#x63D0;&#x4F9B;&#x7ED9;&#x4F7F;&#x7528;&#x8005;&#x4F7F;&#x7528;&#x754C;&#x9762;&#x201D;&#x7684;&#x8F6F;&#x4EF6;&#xFF08;&#x547D;&#x4EE4;&#x89E3;&#x6790;&#x5668;&#xFF09;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E; DOS &#x4E0B;&#x7684; command&#xFF08;&#x547D;&#x4EE4;&#x884C;&#xFF09;&#x548C;&#x540E;&#x6765;&#x7684; cmd.exe&#x3002;&#x666E;&#x901A;&#x610F;&#x4E49;&#x4E0A;&#x7684; Shell &#x5C31;&#x662F;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x7528;&#x6237;&#x8F93;&#x5165;&#x547D;&#x4EE4;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x5B83;&#x4E4B;&#x6240;&#x4EE5;&#x88AB;&#x79F0;&#x4F5C; Shell &#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x9690;&#x85CF;&#x4E86;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5E95;&#x5C42;&#x7684;&#x7EC6;&#x8282;&#x3002;&#x540C;&#x6837;&#x7684; Unix/Linux &#x4E0B;&#x7684;&#x56FE;&#x5F62;&#x7528;&#x6237;&#x754C;&#x9762; GNOME &#x548C; KDE&#xFF0C;&#x6709;&#x65F6;&#x4E5F;&#x88AB;&#x53EB;&#x505A;&#x201C;&#x865A;&#x62DF; shell&#x201D;&#x6216;&#x201C;&#x56FE;&#x5F62; shell&#x201D;</p>
<p>Unix/Linux &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0B;&#x7684; Shell &#x65E2;&#x662F;&#x7528;&#x6237;&#x4EA4;&#x4E92;&#x7684;&#x754C;&#x9762;&#xFF0C;&#x4E5F;&#x662F;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#x7684;&#x811A;&#x672C;&#x8BED;&#x8A00;&#x3002;&#x5F53;&#x7136;&#x5728;&#x8FD9;&#x70B9;&#x4E5F;&#x6709;&#x522B;&#x4E8E; Windows &#x4E0B;&#x7684;&#x547D;&#x4EE4;&#x884C;&#xFF0C;&#x867D;&#x7136;&#x4E5F;&#x63D0;&#x4F9B;&#x4E86;&#x5F88;&#x7B80;&#x5355;&#x7684;&#x63A7;&#x5236;&#x8BED;&#x53E5;&#x3002;&#x5728;Windows &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0B;&#xFF0C;&#x53EF;&#x80FD;&#x6709;&#x4E9B;&#x7528;&#x6237;&#x4ECE;&#x6765;&#x90FD;&#x4E0D;&#x4F1A;&#x76F4;&#x63A5;&#x7684;&#x4F7F;&#x7528; Shell&#xFF0C;&#x7136;&#x800C;&#x5728; UNIX &#x7CFB;&#x5217;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0B;&#xFF0C;Shell &#x4ECD;&#x7136;&#x662F;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#x542F;&#x52A8;&#x3001;X11 &#x542F;&#x52A8;&#x548C;&#x5F88;&#x591A;&#x5176;&#x4ED6;&#x5B9E;&#x7528;&#x5DE5;&#x5177;&#x7684;&#x811A;&#x672C;&#x89E3;&#x91CA;&#x7A0B;&#x5E8F;</p>
<p>&#x5728; UNIX/Linux &#x4E2D;&#x6BD4;&#x8F83;&#x6D41;&#x884C;&#x7684;&#x5E38;&#x89C1;&#x7684; Shell &#x6709; bash&#xFF0C;zsh&#xFF0C;ksh&#xFF0C;csh &#x7B49;&#x7B49;&#xFF0C;Ubuntu &#x7EC8;&#x7AEF;&#x9ED8;&#x8BA4;&#x4F7F;&#x7528;&#x7684;&#x662F; bash&#xFF0C;&#x9ED8;&#x8BA4;&#x7684;&#x684C;&#x9762;&#x73AF;&#x5883;&#x662F; GNOME &#x6216;&#x8005; Unity&#xFF08;&#x57FA;&#x4E8E; GNOME&#xFF09;</p>
<pre><code>3.&#x547D;&#x4EE4;&#x884C;&#x64CD;&#x4F5C;&#x4F53;&#x9A8C;
</code></pre><ul>
<li>&#x91CD;&#x8981;&#x5FEB;&#x6377;&#x952E;</li>
</ul>
<p>&#x771F;&#x6B63;&#x5B66;&#x4E60;&#x547D;&#x4EE4;&#x884C;&#x4E4B;&#x524D;&#xFF0C;&#x4F60;&#x5148;&#x8981;&#x638C;&#x63E1;&#x51E0;&#x4E2A;&#x5341;&#x5206;&#x6709;&#x7528;&#xFF0C;&#x5FC5;&#x9700;&#x638C;&#x63E1;&#x7684;&#x5C0F;&#x6280;&#x5DE7;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">[Tab]</div></pre></td></tr></table></figure>
<p>&#x4F7F;&#x7528;Tab&#x952E;&#x6765;&#x8FDB;&#x884C;&#x547D;&#x4EE4;&#x8865;&#x5168;&#xFF0C;Tab&#x952E;&#x4E00;&#x822C;&#x952E;&#x76D8;&#x662F;&#x5728;&#x5B57;&#x6BCD;Q&#x65C1;&#x8FB9;&#xFF0C;&#x8FD9;&#x4E2A;&#x6280;&#x5DE7;&#x7ED9;&#x4F60;&#x5E26;&#x6765;&#x7684;&#x6700;&#x5927;&#x7684;&#x597D;&#x5904;&#x5C31;&#x662F;&#x5F53;&#x4F60;&#x5FD8;&#x8BB0;&#x67D0;&#x4E2A;&#x547D;&#x4EE4;&#x7684;&#x5168;&#x79F0;&#x65F6;&#x4F60;&#x53EF;&#x4EE5;&#x53EA;&#x8F93;&#x5165;&#x5B83;&#x7684;&#x5F00;&#x5934;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x7136;&#x540E;&#x6309;&#x4E0B;Tab&#x952E;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x63D0;&#x793A;&#x6216;&#x8005;&#x5E2E;&#x52A9;&#x5B8C;&#x6210;</p>
<p>&#x5F53;&#x7136;&#x4E0D;&#x6B62;&#x8865;&#x5168;&#x547D;&#x4EE4;&#xFF0C;&#x8865;&#x5168;&#x76EE;&#x5F55;&#xFF0C;&#x8865;&#x5168;&#x547D;&#x4EE4;&#x53C2;&#x6570;&#x90FD;&#x662F;&#x6CA1;&#x95EE;&#x9898;&#x7684;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">[Ctrl+c]</div></pre></td></tr></table></figure>
<p>&#x60F3;&#x60F3;&#x4F60;&#x6709;&#x6CA1;&#x6709;&#x9047;&#x5230;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5F53;&#x4F60;&#x5728; Linux &#x547D;&#x4EE4;&#x884C;&#x4E2D;&#x65E0;&#x610F;&#x8F93;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x4E0D;&#x77E5;&#x9053;&#x7684;&#x547D;&#x4EE4;&#xFF0C;&#x6216;&#x8005;&#x9519;&#x8BEF;&#x7684;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#xFF0C;&#x5BFC;&#x81F4;&#x5728;&#x7EC8;&#x7AEF;&#x91CC;&#x51FA;&#x73B0;&#x4E86;&#x4F60;&#x65E0;&#x6CD5;&#x9884;&#x6599;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x53EA;&#x6709;&#x5149;&#x6807;&#x5728;&#x95EA;&#x70C1;&#x65E0;&#x6CD5;&#x7EE7;&#x7EED;&#x8F93;&#x5165;&#x547D;&#x4EE4;&#xFF0C;&#x6216;&#x8005;&#x4E0D;&#x505C;&#x5730;&#x5728;&#x8F93;&#x51FA;&#x4E00;&#x5927;&#x5806;&#x4F60;&#x4E0D;&#x60F3;&#x8981;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x4F60;&#x60F3;&#x8981;&#x7ACB;&#x5373;&#x505C;&#x6B62;&#x5E76;&#x6062;&#x590D;&#x5230;&#x4F60;&#x53EF;&#x63A7;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x90A3;&#x8BE5;&#x600E;&#x4E48;&#x529E;&#x5462;&#x3002;&#x8FD9;&#x65F6;&#x5019;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;Ctrl+c&#x952E;&#x6765;&#x5F3A;&#x884C;&#x7EC8;&#x6B62;&#x5F53;&#x524D;&#x7A0B;&#x5E8F;&#xFF08;&#x4F60;&#x53EF;&#x4EE5;&#x653E;&#x5FC3;&#x5B83;&#x5E76;&#x4E0D;&#x4F1A;&#x4F7F;&#x7EC8;&#x7AEF;&#x9000;&#x51FA;&#xFF09;</p>
<p>&#x5C1D;&#x8BD5;&#x8F93;&#x5165;&#x4EE5;&#x4E0B;&#x547D;&#x4EE4;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">tail</div></pre></td></tr></table></figure>
<p>&#x7136;&#x540E;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x4F60;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x8F93;&#x5165;&#x90FD;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x53CD;&#x5E94;&#x4E86;&#xFF0C;&#x53EA;&#x662F;&#x5C06;&#x4F60;&#x8F93;&#x5165;&#x7684;&#x4E1C;&#x897F;&#x663E;&#x793A;&#x51FA;&#x6765;&#xFF0C;&#x73B0;&#x5728;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;Ctrl+c&#xFF0C;&#x6765;&#x4E2D;&#x65AD;&#x8FD9;&#x4E2A;&#x4F60;&#x76EE;&#x524D;&#x53EF;&#x80FD;&#x8FD8;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x4EC0;&#x4E48;&#x7684;&#x7A0B;&#x5E8F;&#x4E86;&#x3002;&#xFF08;&#x5728;&#x540E;&#x7EED;&#x6587;&#x7AE0;&#x4E2D;&#x6211;&#x4F1A;&#x5177;&#x4F53;&#x89E3;&#x91CA;&#x8FD9;&#x4E2A;tail&#x547D;&#x4EE4;&#x662F;&#x4EC0;&#x4E48;&#xFF09;</p>
<p>&#x867D;&#x7136;&#x8FD9;&#x4E2A;&#x6309;&#x7740;&#x5F88;&#x65B9;&#x4FBF;&#xFF0C;&#x4F46;&#x4E0D;&#x8981;&#x968F;&#x4FBF;&#x6309;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x65F6;&#x5019;&#x5F53;&#x4F60;&#x770B;&#x5230;&#x7EC8;&#x7AEF;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x53CD;&#x5E94;&#x6216;&#x63D0;&#x793A;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x63A5;&#x53D7;&#x4F60;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x53EF;&#x80FD;&#x53EA;&#x662F;&#x8FD0;&#x884C;&#x7684;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x4F60;&#x8010;&#x5FC3;&#x7684;&#x7B49;&#x4E00;&#x4E0B;&#xFF0C;&#x4F60;&#x5C31;&#x4E0D;&#x8981;&#x6025;&#x7740;Ctrl+c&#x4E86;</p>
<p><img src="/2016/10/29/&#x4ECE;&#x96F6;&#x5F00;&#x59CB;&#x5B66;&#x4E60;Linux-0/1.png" alt=""></p>
<ul>
<li>&#x5B66;&#x4F1A;&#x5229;&#x7528;&#x5386;&#x53F2;&#x8F93;&#x5165;&#x547D;&#x4EE4;</li>
</ul>
<p>&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x952E;&#x76D8;&#x4E0A;&#x7684;&#x65B9;&#x5411;&#x4E0A;&#x952E;&#xFF0C;&#x6062;&#x590D;&#x4F60;&#x4E4B;&#x524D;&#x8F93;&#x5165;&#x8FC7;&#x7684;&#x547D;&#x4EE4;&#xFF0C;&#x4F60;&#x4E00;&#x8BD5;&#x4FBF;&#x77E5;&#x3002;</p>
<ul>
<li>&#x5B66;&#x4F1A;&#x4F7F;&#x7528;&#x901A;&#x914D;&#x7B26;</li>
</ul>
<p>&#x901A;&#x914D;&#x7B26;&#x662F;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x8BED;&#x53E5;&#xFF0C;&#x4E3B;&#x8981;&#x6709;&#x661F;&#x53F7;&#xFF08;*&#xFF09;&#x548C;&#x95EE;&#x53F7;&#xFF08;?&#xFF09;&#xFF0C;&#x7528;&#x6765;&#x5BF9;&#x5BF9;&#x5B57;&#x7B26;&#x4E32;&#x8FDB;&#x884C;&#x6A21;&#x7CCA;&#x5339;&#x914D;&#xFF08;&#x6BD4;&#x5982;&#x6587;&#x4EF6;&#x540D;&#xFF0C;&#x53C2;&#x6570;&#x540D;&#xFF09;&#x3002;&#x5F53;&#x67E5;&#x627E;&#x6587;&#x4EF6;&#x5939;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B83;&#x6765;&#x4EE3;&#x66FF;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x771F;&#x6B63;&#x5B57;&#x7B26;&#xFF1B;&#x5F53;&#x4E0D;&#x77E5;&#x9053;&#x771F;&#x6B63;&#x5B57;&#x7B26;&#x6216;&#x8005;&#x61D2;&#x5F97;&#x8F93;&#x5165;&#x5B8C;&#x6574;&#x540D;&#x5B57;&#x65F6;&#xFF0C;&#x5E38;&#x5E38;&#x4F7F;&#x7528;&#x901A;&#x914D;&#x7B26;&#x4EE3;&#x66FF;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x771F;&#x6B63;&#x7684;&#x5B57;&#x7B26;</p>
<p>&#x7EC8;&#x7AEF;&#x91CC;&#x9762;&#x8F93;&#x5165;&#x7684;&#x901A;&#x914D;&#x7B26;&#x662F;&#x7531; Shell &#x5904;&#x7406;&#x7684;&#xFF0C;&#x4E0D;&#x662F;&#x7531;&#x6240;&#x6D89;&#x53CA;&#x5230;&#x547D;&#x4EE4;&#x8BED;&#x53E5;&#x5904;&#x7406;&#x7684;&#xFF0C;&#x5B83;&#x53EA;&#x4F1A;&#x51FA;&#x73B0;&#x5728;&#x547D;&#x4EE4;&#x7684;&#x201C;&#x53C2;&#x6570;&#x503C;&#x201D;&#x91CC;&#xFF08;&#x5B83;&#x4E0D;&#x7528;&#x5728; &#x547D;&#x4EE4;&#x540D;&#x79F0;&#x91CC;&#xFF0C; &#x547D;&#x4EE4;&#x4E0D;&#x8BB0;&#x5F97;&#xFF0C;&#x90A3;&#x5C31;&#x7528;Tab&#x8865;&#x5168;&#xFF09;&#x3002;&#x5F53; Shell &#x5728;&#x201C;&#x53C2;&#x6570;&#x503C;&#x201D;&#x4E2D;&#x9047;&#x5230;&#x4E86;&#x901A;&#x914D;&#x7B26;&#x65F6;&#xFF0C;Shell &#x4F1A;&#x5C06;&#x5176;&#x5F53;&#x4F5C;&#x8DEF;&#x5F84;&#x6216;&#x6587;&#x4EF6;&#x540D;&#x53BB;&#x5728;&#x78C1;&#x76D8;&#x4E0A;&#x641C;&#x5BFB;&#x53EF;&#x80FD;&#x7684;&#x5339;&#x914D;&#xFF1A;&#x82E5;&#x7B26;&#x5408;&#x8981;&#x6C42;&#x7684;&#x5339;&#x914D;&#x5B58;&#x5728;&#xFF0C;&#x5219;&#x8FDB;&#x884C;&#x4EE3;&#x6362;(&#x8DEF;&#x5F84;&#x6269;&#x5C55;)&#xFF1B;&#x5426;&#x5219;&#x5C31;&#x5C06;&#x8BE5;&#x901A;&#x914D;&#x7B26;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x5B57;&#x7B26;&#x4F20;&#x9012;&#x7ED9;&#x201C;&#x547D;&#x4EE4;&#x201D;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x7531;&#x547D;&#x4EE4;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;&#x603B;&#x4E4B;&#xFF0C;&#x901A;&#x914D;&#x7B26; &#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x662F;&#x4E00;&#x79CD; Shell &#x5B9E;&#x73B0;&#x7684;&#x8DEF;&#x5F84;&#x6269;&#x5C55;&#x529F;&#x80FD;&#x3002;&#x5728; &#x901A;&#x914D;&#x7B26;&#x88AB;&#x5904;&#x7406;&#x540E;, Shell &#x4F1A;&#x5148;&#x5B8C;&#x6210;&#x8BE5;&#x547D;&#x4EE4;&#x7684;&#x91CD;&#x7EC4;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x7EE7;&#x7EED;&#x5904;&#x7406;&#x91CD;&#x7EC4;&#x540E;&#x7684;&#x547D;&#x4EE4;&#xFF0C;&#x76F4;&#x81F3;&#x6267;&#x884C;&#x8BE5;&#x547D;&#x4EE4;</p>
<p>&#x5148;&#x4F7F;&#x7528; touch &#x547D;&#x4EE4;&#x521B;&#x5EFA; 2 &#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x540E;&#x7F00;&#x90FD;&#x4E3A; txt&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">touch 233.txt 2333.txt</div></pre></td></tr></table></figure>
<p>&#x53EF;&#x4EE5;&#x7ED9;&#x6587;&#x4EF6;&#x968F;&#x610F;&#x547D;&#x540D;&#xFF0C;&#x5047;&#x5982;&#x8FC7;&#x4E86;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x4F60;&#x5DF2;&#x7ECF;&#x5FD8;&#x4E86;&#x8FD9;&#x4E24;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x6587;&#x4EF6;&#x540D;&#xFF0C;&#x73B0;&#x5728;&#x4F60;&#x60F3;&#x5728;&#x4F60;&#x5927;&#x5806;&#x5176;&#x4ED6;&#x6587;&#x4EF6;&#x4E2D;&#x627E;&#x5230;&#x8FD9;&#x4E24;&#x4E2A;&#x6587;&#x672C;&#x6587;&#x4EF6;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x901A;&#x914D;&#x7B26;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">ls *.txt</div></pre></td></tr></table></figure>
<p>&#x5728;&#x521B;&#x5EFA;&#x6587;&#x4EF6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x4E00;&#x6B21;&#x6027;&#x521B;&#x5EFA;&#x591A;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x201C;love_1_linux.txt&#xFF0C;love_2_linux.txt&#xFF0C;&#x2026; love_10_linux.txt&#x201D;&#x3002;&#x5728; Linux &#x4E2D;&#x5341;&#x5206;&#x65B9;&#x4FBF;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">touch love_{1..10}_linux.txt</div></pre></td></tr></table></figure>
<p><img src="/2016/10/29/&#x4ECE;&#x96F6;&#x5F00;&#x59CB;&#x5B66;&#x4E60;Linux-0/2.png" alt=""></p>
<ul>
<li>&#x5B66;&#x4F1A;&#x5728;&#x547D;&#x4EE4;&#x884C;&#x4E2D;&#x83B7;&#x53D6;&#x5E2E;&#x52A9;</li>
</ul>
<p>&#x5728; Linux &#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x9047;&#x5230;&#x56F0;&#x96BE;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;man &#x547D;&#x4EE4;&#xFF0C;&#x5B83;&#x662F;Manual page&#x7684;&#x7F29;&#x5199;</p>
<p>Manual pages &#x662F;&#x5728; UNIX &#x6216;&#x7C7B; UNIX &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5728;&#x7EBF;&#x8F6F;&#x4EF6;&#x6587;&#x6863;&#x7684;&#x4E00;&#x79CD;&#x666E;&#x904D;&#x7684;&#x5F62;&#x5F0F;&#x3002; &#x5185;&#x5BB9;&#x5305;&#x62EC;&#x8BA1;&#x7B97;&#x673A;&#x7A0B;&#x5E8F;&#xFF08;&#x5305;&#x62EC;&#x5E93;&#x548C;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#xFF09;&#xFF0C;&#x6B63;&#x5F0F;&#x7684;&#x6807;&#x51C6;&#x548C;&#x60EF;&#x4F8B;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x62BD;&#x8C61;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6267;&#x884C; man &#x547D;&#x4EE4;&#x8C03;&#x7528;&#x624B;&#x518C;&#x9875;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5982;&#x4E0B;&#x65B9;&#x5F0F;&#x6765;&#x83B7;&#x5F97;&#x67D0;&#x4E2A;&#x547D;&#x4EE4;&#x7684;&#x8BF4;&#x660E;&#x548C;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#x7684;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">man &lt;command_name&gt;</div></pre></td></tr></table></figure>
<p>&#x6BD4;&#x5982;&#x4F60;&#x60F3;&#x67E5;&#x770B; man &#x547D;&#x4EE4;&#x672C;&#x8EAB;&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8F93;&#x5165;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">man man</div></pre></td></tr></table></figure>
<p>&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;man &#x624B;&#x518C;&#x91CC;&#x9762;&#x7684;&#x5185;&#x5BB9;&#x90FD;&#x662F;&#x82F1;&#x6587;&#x7684;&#xFF0C;&#x8FD9;&#x5C31;&#x8981;&#x6C42;&#x4F60;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x82F1;&#x6587;&#x57FA;&#x7840;&#x3002;man &#x624B;&#x518C;&#x7684;&#x5185;&#x5BB9;&#x5F88;&#x591A;&#xFF0C;&#x6D89;&#x53CA;&#x4E86; Linux &#x4F7F;&#x7528;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x65B9;&#x65B9;&#x9762;&#x9762;&#xFF0C;&#x4E3A;&#x4E86;&#x4FBF;&#x4E8E;&#x67E5;&#x627E;&#xFF0C;&#x662F;&#x505A;&#x4E86;&#x5206;&#x518C;&#xFF08;&#x5206;&#x533A;&#x6BB5;&#xFF09;&#x5904;&#x7406;&#x7684;&#xFF0C;&#x5728;Research UNIX&#x3001;BSD&#x3001;macOS &#x548C; Linux &#x4E2D;&#xFF0C;&#x624B;&#x518C;&#x901A;&#x5E38;&#x88AB;&#x5206;&#x4E3A;8&#x4E2A;&#x533A;&#x6BB5;&#xFF0C;&#x5B89;&#x6392;&#x5982;&#x4E0B;</p>
<p><img src="/2016/10/29/&#x4ECE;&#x96F6;&#x5F00;&#x59CB;&#x5B66;&#x4E60;Linux-0/3.png" alt=""></p>
<p>&#x8981;&#x67E5;&#x770B;&#x76F8;&#x5E94;&#x533A;&#x6BB5;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5C31;&#x5728; man &#x540E;&#x9762;&#x52A0;&#x4E0A;&#x76F8;&#x5E94;&#x533A;&#x6BB5;&#x7684;&#x6570;&#x5B57;&#x5373;&#x53EF;&#xFF0C;&#x5982;:</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">man 1 ls</div></pre></td></tr></table></figure>
<p>&#x4F1A;&#x663E;&#x793A;&#x7B2C;&#x4E00;&#x533A;&#x6BB5;&#x4E2D;&#x7684;ls&#x547D;&#x4EE4;man&#x9875;&#x9762;</p>
<p>&#x6240;&#x6709;&#x7684;&#x624B;&#x518C;&#x9875;&#x9075;&#x5FAA;&#x4E00;&#x4E2A;&#x5E38;&#x89C1;&#x7684;&#x5E03;&#x5C40;&#xFF0C;&#x5176;&#x4E3A;&#x901A;&#x8FC7;&#x7B80;&#x5355;&#x7684; ASCII &#x6587;&#x672C;&#x5C55;&#x793A;&#x800C;&#x4F18;&#x5316;&#xFF0C;&#x800C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5F62;&#x5F0F;&#x7684;&#x9AD8;&#x4EAE;&#x6216;&#x5B57;&#x4F53;&#x63A7;&#x5236;&#x3002;&#x4E00;&#x822C;&#x5305;&#x62EC;&#x4EE5;&#x4E0B;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div></pre></td><td class="code"><pre><div class="line">NAME&#xFF08;&#x540D;&#x79F0;&#xFF09;</div><div class="line">&#x8BE5;&#x547D;&#x4EE4;&#x6216;&#x51FD;&#x6570;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x63A5;&#x7740;&#x662F;&#x4E00;&#x884C;&#x7B80;&#x4ECB;&#x3002;</div><div class="line">SYNOPSIS&#xFF08;&#x6982;&#x8981;&#xFF09;</div><div class="line">&#x5BF9;&#x4E8E;&#x547D;&#x4EE4;&#xFF0C;&#x6B63;&#x5F0F;&#x7684;&#x63CF;&#x8FF0;&#x5B83;&#x5982;&#x4F55;&#x8FD0;&#x884C;&#xFF0C;&#x4EE5;&#x53CA;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x547D;&#x4EE4;&#x884C;&#x53C2;&#x6570;&#x3002;&#x5BF9;&#x4E8E;&#x51FD;&#x6570;&#xFF0C;&#x4ECB;&#x7ECD;&#x51FD;&#x6570;&#x6240;&#x9700;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x4EE5;&#x53CA;&#x54EA;&#x4E2A;&#x5934;&#x6587;&#x4EF6;&#x5305;&#x542B;&#x8BE5;&#x51FD;&#x6570;&#x7684;&#x5B9A;&#x4E49;&#x3002;</div><div class="line">DESCRIPTION&#xFF08;&#x8BF4;&#x660E;&#xFF09;</div><div class="line">&#x547D;&#x4EE4;&#x6216;&#x51FD;&#x6570;&#x529F;&#x80FD;&#x7684;&#x6587;&#x672C;&#x63CF;&#x8FF0;&#x3002;</div><div class="line">EXAMPLES&#xFF08;&#x793A;&#x4F8B;&#xFF09;</div><div class="line">&#x5E38;&#x7528;&#x7684;&#x4E00;&#x4E9B;&#x793A;&#x4F8B;&#x3002;</div><div class="line">SEE ALSO&#xFF08;&#x53C2;&#x89C1;&#xFF09;</div><div class="line">&#x76F8;&#x5173;&#x547D;&#x4EE4;&#x6216;&#x51FD;&#x6570;&#x7684;&#x5217;&#x8868;&#x3002;</div></pre></td></tr></table></figure>
<p>&#x4E5F;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;&#x90E8;&#x5206;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x8DE8;&#x624B;&#x518C;&#x9875;&#x7684;&#x6807;&#x51C6;&#x5316;&#x3002;&#x5E38;&#x89C1;&#x7684;&#x4F8B;&#x5B50;&#x5305;&#x62EC;&#xFF1A;OPTIONS&#xFF08;&#x9009;&#x9879;&#xFF09;&#xFF0C;EXIT STATUS&#xFF08;&#x9000;&#x51FA;&#x72B6;&#x6001;&#xFF09;&#xFF0C;ENVIRONMENT&#xFF08;&#x73AF;&#x5883;&#xFF09;&#xFF0C;BUGS&#xFF08;&#x7A0B;&#x5E8F;&#x6F0F;&#x6D1E;&#xFF09;&#xFF0C;FILES&#xFF08;&#x6587;&#x4EF6;&#xFF09;&#xFF0C;AUTHOR&#xFF08;&#x4F5C;&#x8005;&#xFF09;&#xFF0C;REPORTING BUGS&#xFF08;&#x5DF2;&#x77E5;&#x6F0F;&#x6D1E;&#xFF09;&#xFF0C;HISTORY&#xFF08;&#x5386;&#x53F2;&#xFF09;&#x548C;COPYRIGHT&#xFF08;&#x7248;&#x6743;&#xFF09;</p>
<p>&#x901A;&#x5E38; man &#x624B;&#x518C;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x5F88;&#x591A;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4E0D;&#x592A;&#x5BB9;&#x6613;&#x627E;&#x5230;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x4E0D;&#x8FC7;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#x4F60;&#x53EF;&#x4EE5;&#x5728; man &#x4E2D;&#x4F7F;&#x7528;&#x641C;&#x7D22;&#xFF0C;/&lt;&#x4F60;&#x8981;&#x641C;&#x7D22;&#x7684;&#x5173;&#x952E;&#x5B57;&gt;&#x4F60;&#x8981;&#x641C;&#x7D22;&#x7684;&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x67E5;&#x627E;&#x5230;&#x540E;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;n&#x952E;&#x5207;&#x6362;&#x5230;&#x4E0B;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x5B57;&#x6240;&#x5728;&#x5904;&#xFF0C;shift+n&#x4E3A;&#x4E0A;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x5B57;&#x6240;&#x5728;&#x5904;&#x3002;&#x4F7F;&#x7528;Space(&#x7A7A;&#x683C;&#x952E;)&#x7FFB;&#x9875;&#xFF0C;Enter(&#x56DE;&#x8F66;&#x952E;)&#x5411;&#x4E0B;&#x6EDA;&#x52A8;&#x4E00;&#x884C;&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x7528;j,k&#xFF08;vim&#x7F16;&#x8F91;&#x5668;&#x7684;&#x79FB;&#x52A8;&#x952E;&#xFF09;&#x8FDB;&#x884C;&#x5411;&#x524D;&#x5411;&#x540E;&#x6EDA;&#x52A8;&#x4E00;&#x884C;&#x3002;&#x6309;&#x4E0B;h&#x952E;&#x4E3A;&#x663E;&#x793A;&#x4F7F;&#x7528;&#x5E2E;&#x52A9;(&#x56E0;&#x4E3A;man&#x4F7F;&#x7528;less&#x4F5C;&#x4E3A;&#x9605;&#x8BFB;&#x5668;&#xFF0C;&#x5B9E;&#x4E3A;less&#x5DE5;&#x5177;&#x7684;&#x5E2E;&#x52A9;)&#xFF0C;&#x6309;&#x4E0B;q&#x9000;&#x51FA;</p>
<p>&#x60F3;&#x8981;&#x83B7;&#x5F97;&#x66F4;&#x8BE6;&#x7EC6;&#x7684;&#x5E2E;&#x52A9;&#xFF0C;&#x4F60;&#x8FD8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;info&#x547D;&#x4EE4;&#xFF0C;&#x4E0D;&#x8FC7;&#x901A;&#x5E38;&#x4F7F;&#x7528;man&#x5C31;&#x8DB3;&#x591F;&#x4E86;&#x3002;&#x5982;&#x679C;&#x4F60;&#x77E5;&#x9053;&#x67D0;&#x4E2A;&#x547D;&#x4EE4;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x53EA;&#x662F;&#x60F3;&#x5FEB;&#x901F;&#x67E5;&#x770B;&#x4E00;&#x4E9B;&#x5B83;&#x7684;&#x67D0;&#x4E2A;&#x5177;&#x4F53;&#x53C2;&#x6570;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x2013;help&#x53C2;&#x6570;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x547D;&#x4EE4;&#x90FD;&#x4F1A;&#x5E26;&#x6709;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5982;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">ls --help</div></pre></td></tr></table></figure>

      
    </div><!-- .entry-content -->

    <footer class="entry-meta">
    <a href="/2016/10/29/从零开始学习Linux-0/">
    <time datetime="2016-10-28T16:21:25.000Z" class="entry-date">
        2016-10-29
    </time>
</a>
    
  <span class="article-delim">&#8226;</span>
  <div class="article-category">
  <a class="article-category-link" href="/categories/编程/">编程</a>
  </div>

    
  <span class="article-delim">&#8226;</span>
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/Linux/">Linux</a></li></ul>

    </footer>
</article>


    
<nav class="nav-single">
    <h3 class="assistive-text">文章导航</h3>
    
        <span class="nav-previous"><a href="/2016/11/01/从零开始学习Linux-1/" rel="prev"><span class="meta-nav">←</span> 从零开始学习Linux-1</a></span>
    
    
        <span class="nav-next"><a href="/2016/10/26/iOS美颜实现/" rel="next">iOS美颜实现 <span class="meta-nav">→</span></a></span>
    
</nav><!-- .nav-single -->







</div></div>
        <div id="secondary" class="widget-area" role="complementary">
  
    <aside id="search" class="widget widget_search"><form role="search" method="get" accept-charset="utf-8" id="searchform" class="searchform" action="//google.com/search">
    <div>
        <input type="text" value="" name="s" id="s" />
        <input type="submit" id="searchsubmit" value="搜索" />
    </div>
</form></aside>
  
    
  
    
  <aside class="widget">
    <h3 class="widget-title">Categories</h3>
    <div class="widget-content">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/LIFE/">LIFE</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/MAC/">MAC</a><span class="category-list-count">3</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/ML/">ML</a><span class="category-list-count">19</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/PGM/">PGM</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/iOS/">iOS</a><span class="category-list-count">22</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/御宅文化/">御宅文化</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/编程/">编程</a><span class="category-list-count">58</span></li></ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Recents</h3>
    <div class="widget-content">
      <ul>
        
          <li>
            <a href="/2017/09/28/Cloud-Service-Models/">Cloud Service Models</a>
          </li>
        
          <li>
            <a href="/2017/09/18/Cloud-Introduction/">Cloud Introduction</a>
          </li>
        
          <li>
            <a href="/2017/09/07/中断以及中断处理/">中断以及中断处理</a>
          </li>
        
          <li>
            <a href="/2017/07/19/MapReduce-and-Hadoop/">MapReduce &amp; Hadoop</a>
          </li>
        
          <li>
            <a href="/2017/05/15/二维码/">详细谈谈二维码生成原理与编码（一）</a>
          </li>
        
      </ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Tags</h3>
    <div class="widget-content">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/Cloud-Computing/">Cloud Computing</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Cocoapods/">Cocoapods</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/HTML/">HTML</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Linux/">Linux</a><span class="tag-list-count">15</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Machine-Learning/">Machine Learning</a><span class="tag-list-count">17</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Matlab/">Matlab</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Probabilistic-Graphical-Models/">Probabilistic Graphical Models</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIColor/">UIColor</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView/">UIView</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView-圆角/">UIView-圆角</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Vim/">Vim</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/bug/">bug</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/hexo/">hexo</a><span class="tag-list-count">4</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/openCV/">openCV</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/二维码/">二维码</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/指针/">指针</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/操作系统/">操作系统</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/数据库/">数据库</a><span class="tag-list-count">3</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/数据结构/">数据结构</a><span class="tag-list-count">20</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/算法/">算法</a><span class="tag-list-count">9</span></li></ul>
    </div>
  </aside>

  
    
<div class="widget tag">
<h3 class="title">blogroll</h3>
<ul class="entry">


<li><a href="https://github.com/" target="_blank">github</a></li>


<li><a href="http://www.jianshu.com/users/41cd7711ed44/latest_articles" target="_blank">我的简书主页</a></li>

</ul>
</div>

  
</div>
      </div>
      <footer id="colophon" role="contentinfo">
    <p>&copy; 2017 SaberDa
    All rights reserved.</p>
    <p>Powered by <a href="http://hexo.io/" target="_blank">Hexo</a></p>
</footer>
    <script>window._bd_share_config={"common":{"bdSnsKey":{},"bdText":"","bdMini":"1","bdMiniList":false,"bdPic":"","bdStyle":"2","bdSize":"16"},"share":{}};with(document)0[(getElementsByTagName('head')[0]||body).appendChild(createElement('script')).src='http://bdimg.share.baidu.com/static/api/js/share.js?v=89860593.js?cdnversion='+~(-new Date()/36e5)];</script>

<script src="/js/jquery-2.0.3.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

<script src="/js/navigation.js"></script>

<div id="bg"></div>

  </div>
</body>
</html>