<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  
  <meta name="description" content="阿尔托利亚是我老婆~" />
  

  
  
  
  
  
  
  <title>谈一谈 Fast R-CNN 和 Faster R-CNN | SaberDa的幻想乡</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x672C;&amp;#x6587;&amp;#x8BA8;&amp;#x8BBA;&amp;#x5185;&amp;#x5BB9;&amp;#x6D89;&amp;#x53CA;&amp;#x5230;&amp;#x4E4B;&amp;#x524D;&amp;#x6574;&amp;#x7406;&amp;#x7684;&amp;#x4E00;&amp;#x7BC7;&amp;#x6587;&amp;#x7AE0;&amp;#xFF0C;&amp;#x94FE;&amp;#x63A5;&amp;#x89C1;&amp;#x4E0B;CNN&amp;#x4E4B;&amp;#x5B">
<meta property="og:type" content="article">
<meta property="og:title" content="谈一谈 Fast R-CNN 和 Faster R-CNN">
<meta property="og:url" content="https://saberda.github.io/2017/12/17/FastRCNN-FasterRCNN/index.html">
<meta property="og:site_name" content="SaberDa的幻想乡">
<meta property="og:description" content="&amp;#x672C;&amp;#x6587;&amp;#x8BA8;&amp;#x8BBA;&amp;#x5185;&amp;#x5BB9;&amp;#x6D89;&amp;#x53CA;&amp;#x5230;&amp;#x4E4B;&amp;#x524D;&amp;#x6574;&amp;#x7406;&amp;#x7684;&amp;#x4E00;&amp;#x7BC7;&amp;#x6587;&amp;#x7AE0;&amp;#xFF0C;&amp;#x94FE;&amp;#x63A5;&amp;#x89C1;&amp;#x4E0B;CNN&amp;#x4E4B;&amp;#x5B">
<meta property="og:image" content="https://saberda.github.io/2017/12/17/FastRCNN-FasterRCNN/1.png">
<meta property="og:image" content="https://saberda.github.io/2017/12/17/FastRCNN-FasterRCNN/2.png">
<meta property="og:image" content="https://saberda.github.io/2017/12/17/FastRCNN-FasterRCNN/3.png">
<meta property="og:image" content="https://saberda.github.io/2017/12/17/FastRCNN-FasterRCNN/4.png">
<meta property="og:image" content="https://saberda.github.io/2017/12/17/FastRCNN-FasterRCNN/5.png">
<meta property="og:image" content="https://saberda.github.io/2017/12/17/FastRCNN-FasterRCNN/6.png">
<meta property="og:image" content="https://saberda.github.io/2017/12/17/FastRCNN-FasterRCNN/7.png">
<meta property="og:image" content="https://saberda.github.io/2017/12/17/FastRCNN-FasterRCNN/8.png">
<meta property="og:image" content="https://saberda.github.io/2017/12/17/FastRCNN-FasterRCNN/9.png">
<meta property="og:image" content="https://saberda.github.io/2017/12/17/FastRCNN-FasterRCNN/10.png">
<meta property="og:updated_time" content="2017-12-17T08:26:07.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="谈一谈 Fast R-CNN 和 Faster R-CNN">
<meta name="twitter:description" content="&amp;#x672C;&amp;#x6587;&amp;#x8BA8;&amp;#x8BBA;&amp;#x5185;&amp;#x5BB9;&amp;#x6D89;&amp;#x53CA;&amp;#x5230;&amp;#x4E4B;&amp;#x524D;&amp;#x6574;&amp;#x7406;&amp;#x7684;&amp;#x4E00;&amp;#x7BC7;&amp;#x6587;&amp;#x7AE0;&amp;#xFF0C;&amp;#x94FE;&amp;#x63A5;&amp;#x89C1;&amp;#x4E0B;CNN&amp;#x4E4B;&amp;#x5B">
<meta name="twitter:image" content="https://saberda.github.io/2017/12/17/FastRCNN-FasterRCNN/1.png">
  
  
    <link rel="icon" href="/css/images/favicon.ico">
  
  <link rel="stylesheet" href="/css/style.css">
  

  
  <!-- baidu webmaster push -->
  <script src='//push.zhanzhang.baidu.com/push.js'></script>
</head>
<body class="home blog custom-background custom-font-enabled single-author">
  <div id="page" class="hfeed site">
      <header id="masthead" class="site-header" role="banner">
    <hgroup>
      <h1 class="site-title">
        <a href="/" title="SaberDa的幻想乡" rel="home">SaberDa的幻想乡</a>
      </h1>
      
        <h2 class="site-description">
          <a href="/" id="subtitle">　　iOS/ ML　　|　　二次元　　|　　saberda@qq.com　　|　　从花时间省钱到花钱省时间</a>
        </h2>
      
    </hgroup>

    <nav id="site-navigation" class="main-navigation" role="navigation">
            <button class="menu-toggle">菜单</button>
            <a class="assistive-text" href="/#content" title="跳至内容">跳至内容</a><!--TODO-->
            <div class="menu-main-container">
                <ul id="menu-main" class="nav-menu">
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/archives">所有文章</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/">主页</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/编程/">编程</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/iOS/">iOS</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/ML/">ML</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/PGM/">PGM</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/MAC/">MAC</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/御宅文化/">御宅文化</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/LIFE/">LIFE</a></li>
                
                </ul>
            </div>
    </nav>
</header>
      <div id="main" class="wrapper">
        <div id="primary" class="site-content"><div id="content" role="main"><article id="post-FastRCNN-FasterRCNN" class="post-FastRCNN-FasterRCNN post type-post status-publish format-standard hentry">
    <!---->

      <header class="entry-header">
        
        
  
    <h1 class="entry-title article-title">
      谈一谈 Fast R-CNN 和 Faster R-CNN
    </h1>
  

        
        <div class="comments-link">
            
            <a href="javascript:void(0);" data-url="https://saberda.github.io/2017/12/17/FastRCNN-FasterRCNN/" data-id="cjbai210y000fq4b3lbvja8ln" class="leave-reply bdsharebuttonbox" data-cmd="more">Share</a>
        </div><!-- .comments-link -->
      </header><!-- .entry-header -->

    <div class="entry-content">
      
        <p>&#x672C;&#x6587;&#x8BA8;&#x8BBA;&#x5185;&#x5BB9;&#x6D89;&#x53CA;&#x5230;&#x4E4B;&#x524D;&#x6574;&#x7406;&#x7684;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x94FE;&#x63A5;&#x89C1;&#x4E0B;<a href="http://www.saberismywife.com/2017/10/31/CNN&#x4E4B;&#x5B9A;&#x4F4D;&#x68C0;&#x6D4B;/" target="_blank" rel="external">CNN&#x4E4B;&#x5B9A;&#x4F4D;&#x68C0;&#x6D4B;</a></p>
<h2 id="R-CNN-&#x7684;&#x4E00;&#x4E9B;&#x95EE;&#x9898;"><a href="#R-CNN-&#x7684;&#x4E00;&#x4E9B;&#x95EE;&#x9898;" class="headerlink" title="R-CNN &#x7684;&#x4E00;&#x4E9B;&#x95EE;&#x9898;"></a>R-CNN &#x7684;&#x4E00;&#x4E9B;&#x95EE;&#x9898;</h2><p>R-CNN&#x5E76;&#x4E0D;&#x662F;&#x5B8C;&#x7F8E;&#x7684;&#xFF0C;&#x4ED6;&#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5728;&#x6D4B;&#x8BD5;&#x662F;&#x5B83;&#x8FD0;&#x884C;&#x7684;&#x5F88;&#x6162;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x6709;2000&#x4E2A;&#x533A;&#x57DF;&#xFF0C;&#x6BCF;&#x4E2A;&#x533A;&#x57DF;&#x90FD;&#x8981;&#x8FD0;&#x884C;&#x4E00;&#x4E0B;R-CNN&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x5F88;&#x6162;&#x7684;&#x539F;&#x56E0;&#x3002;<br>&#x6211;&#x4EEC;&#x8FD8;&#x4F1A;&#x9762;&#x5BF9;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x6709;&#x8DA3;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x4F7F;&#x7528;SVM&#x6216;&#x8005;regression&#x65F6;&#x662F;&#x79BB;&#x7EBF;&#x8BAD;&#x7EC3;&#x4F7F;&#x7528;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x7B49;&#x65B9;&#x6CD5;&#x8BAD;&#x7EC3;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x7684;R-CNN&#x6CA1;&#x6709;&#x673A;&#x4F1A;&#x6309;&#x7167;&#x76F8;&#x5E94;&#x90E8;&#x5206;&#x7684;&#x7F51;&#x7EDC;&#x76EE;&#x7684;&#x5347;&#x7EA7;&#x3002;<br>&#x540C;&#x65F6;R-CNN&#x8BAD;&#x7EC3;&#x7BA1;&#x9053;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#x65F6;&#xFF0C;&#x4ED6;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x6DF7;&#x4E71;&#x3002;</p>
<p>Fast R-CNN</p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x6709;&#x4EBA;&#x63D0;&#x51FA;&#x4E86;Fast R-CNN&#x6A21;&#x578B;&#x3002;Fast R-CNN&#x7684;&#x7B97;&#x6CD5;&#x5F88;&#x7B80;&#x5355;&#xFF1A;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x4EA4;&#x6362;&#x63D0;&#x53D6;&#x51FA;&#x7684;&#x533A;&#x57DF;&#x7136;&#x540E;&#x5728;&#x8FD0;&#x884C;CNN&#x3002;</p>
<a id="more"></a>
<p><img src="/2017/12/17/FastRCNN-FasterRCNN/1.png" alt=""></p>
<p>&#x8FD9;&#x4E2A;&#x601D;&#x60F3;&#x548C;&#x90A3;&#x4E2A;overfeat&#x7684;&#x6D6E;&#x7A97;&#x6709;&#x4E9B;&#x76F8;&#x4F3C;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x7684;pipeline&#x770B;&#x8D77;&#x6765;&#x6709;&#x4E9B;&#x76F8;&#x50CF;&#x3002;&#x5E95;&#x5C42;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x4E2A;&#x9AD8;&#x5206;&#x8FA8;&#x7684;&#x56FE;&#x7247;&#x8F93;&#x5165;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x5377;&#x79EF;&#x5C42;&#x8FD0;&#x884C;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x4E86;&#x9AD8;&#x5206;&#x8FA8;&#x7387;&#x7684;&#x5377;&#x79EF;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x3002;&#x4E4B;&#x540E;&#x6211;&#x4EEC;&#x7684;region proposals&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x53EB;ROI pooling&#x7684;&#x4E1C;&#x897F;&#x4ECE;&#x5377;&#x79EF;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x91CC;&#x5206;&#x79BB;&#x51FA;&#x8FD9;&#x4E9B;&#x533A;&#x57DF;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x8FD9;&#x4E9B;&#x533A;&#x57DF;&#x7684;&#x5377;&#x79EF;&#x7279;&#x5F81;&#x5C06;&#x4F1A;&#x8FDB;&#x5165;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#xFF0C;&#x6700;&#x540E;&#x4F1A;&#x6709;&#x5F97;&#x5230;&#x5728;&#x4E4B;&#x524D;&#x6587;&#x7AE0;&#x91CC;&#x4ECB;&#x7ECD;&#x8FC7;&#x7684;&#x548C;classification head&#x548C;regression head&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x89E3;&#x51B3;&#x4E86;R-CNN&#x6709;&#x7684;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x3002;Fast R-CNN&#x901A;&#x8FC7;&#x5171;&#x4EAB;&#x4E0D;&#x540C;&#x76EE;&#x6807;&#x6846;&#x7684;&#x5377;&#x79EF;&#x7279;&#x5F81;&#x7684;&#x8BA1;&#x7B97;&#x89E3;&#x51B3;&#x4E86;&#x6D4B;&#x8BD5;&#x8FC7;&#x7A0B;&#x4E2D;R-CNN&#x5F88;&#x6162;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5728;Fast R-CNN&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x540C;&#x65F6;&#x8BAD;&#x7EC3;&#x6240;&#x6709;&#x90E8;&#x5206;&#xFF0C;&#x800C;&#x4E0D;&#x4F7F;&#x7528;R-CNN&#x4E2D;&#x90A3;&#x4E2A;&#x590D;&#x6742;&#x7684;pipeline&#x3002;</p>
<p>&#x5728;Fast R-CNN&#x4E2D;&#x6700;&#x6709;&#x610F;&#x601D;&#x7684;&#x90E8;&#x5206;&#x5C31;&#x662F;region of interest pooling&#x3002;</p>
<p><img src="/2017/12/17/FastRCNN-FasterRCNN/2.png" alt=""></p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x56FE;&#x7247;&#xFF0C;&#x5F88;&#x5927;&#x53EF;&#x80FD;&#x662F;&#x9AD8;&#x5206;&#x8FA8;&#x7387;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x6211;&#x4EEC;&#x6709;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#x6846;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;&#x8FD9;&#x4E2A;&#x9AD8;&#x5206;&#x8FA8;&#x7387;&#x7684;&#x56FE;&#x7247;&#x8F93;&#x5165;&#x5230;&#x5377;&#x79EF;&#x5C42;&#x548C;&#x6C60;&#x5316;&#x5C42;&#x3002;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x6709;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x5E0C;&#x671B;&#x5F97;&#x5230;low-res conv&#x7684;&#x7279;&#x5F81;&#x503C;&#xFF0C;&#x800C;&#x6574;&#x4E2A;&#x56FE;&#x7247;&#x7684;&#x7279;&#x5F81;&#x662F;high-res&#x7684;&#x3002;&#x5728;Fast R-CNN&#x4E2D;&#x4F7F;&#x7528;&#x4E86;&#x5F88;&#x7B80;&#x5355;&#x7C97;&#x66B4;&#x7684;&#x65B9;&#x6CD5;&#x89E3;&#x51B3;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p><img src="/2017/12/17/FastRCNN-FasterRCNN/3.png" alt=""></p>
<p>&#x5BF9;&#x4E8E;&#x7ED9;&#x51FA;&#x7684;&#x76EE;&#x6807;&#x6846;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x5B83;&#x6295;&#x5F71;&#x5230;&#x90A3;&#x4E2A;conv feature&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x518D;&#x628A;&#x90A3;&#x4E2A;conv feature volume&#x5207;&#x6210;&#x5C0F;&#x5757;&#xFF0C;&#x5373;&#x5207;&#x5206;&#x6210;&#x4E0B;&#x5C42;&#x9700;&#x8981;&#x7684;h*w&#x7F51;&#x7EDC;&#xFF0C;&#x5728;&#x5BF9;&#x6BCF;&#x4E00;&#x5C0F;&#x683C;&#x90FD;&#x8FDB;&#x884C;&#x6700;&#x5927;&#x6C60;&#x5316;&#x3002;</p>
<p><img src="/2017/12/17/FastRCNN-FasterRCNN/4.png" alt=""></p>
<p>&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F7F;&#x7528;&#x76EE;&#x6807;&#x6846;&#x5171;&#x4EAB;&#x5377;&#x79EF;&#x7279;&#x5F81;&#x503C;&#xFF0C;&#x6700;&#x540E;&#x63D0;&#x53D6;&#x51FA;&#x90A3;&#x4E2A;&#x533A;&#x57DF;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x7B80;&#x5355;&#x6765;&#x8BB2;&#xFF0C;&#x5C31;&#x662F;&#x4EA4;&#x6362;&#x5377;&#x79EF;&#x7684;&#x987A;&#x5E8F;&#xFF0C;&#x7136;&#x540E;&#x626D;&#x66F2;&#x4FEE;&#x6539;&#x3002;&#x540C;&#x65F6;&#x8FD9;&#x4E5F;&#x662F;&#x4E2A;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#x7684;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#x3002;&#x56E0;&#x4E3A;&#x57FA;&#x672C;&#x4E0A;&#x6211;&#x4EEC;&#x53EA;&#x4F7F;&#x7528;&#x4E86;&#x6700;&#x5927;&#x6C60;&#x5316;&#xFF0C;&#x800C;&#x4E14;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x5BF9;&#x6700;&#x5927;&#x6C60;&#x5316;&#x8FDB;&#x884C;&#x5411;&#x540E;&#x4F20;&#x64AD;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5BF9;&#x8FD9;&#x4E9B;region of interest pooling&#x8FDB;&#x884C;BP&#xFF0C;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;&#x6574;&#x4E2A;&#x6574;&#x4F53;&#x4E00;&#x8D77;&#x8BAD;&#x7EC3;&#x3002;</p>
<p>&#x5728;&#x5B9E;&#x9645;&#x8BAD;&#x7EC3;&#x4E2D;&#xFF0C;Fast R-CNN&#x76F8;&#x6BD4;&#x4E8E;R-CNN&#x4F1A;&#x6709;&#x66F4;&#x597D;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x8FD9;&#x4E3B;&#x8981;&#x662F;&#x56E0;&#x4E3A;&#x5176;&#x7ECF;&#x8FC7;&#x8C03;&#x6574;&#x540E;&#x826F;&#x597D;&#x7684;&#x5C5E;&#x6027;&#x503C;&#x3002;&#x5728;Fast R-CNN&#x4E2D;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5728;&#x6BCF;&#x4E2A;&#x5377;&#x79EF;&#x7684;&#x8FDE;&#x63A5;&#x5904;&#xFF0C;&#x90FD;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x8C03;&#x6574;&#xFF0C;&#x5176;&#x4FDD;&#x8BC1;&#x4E86;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x7684;&#x51C6;&#x786E;&#x6027;&#xFF0C;&#x4F7F;&#x5F97;&#x7ED3;&#x679C;&#x6709;&#x4E9B;&#x63D0;&#x5347;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5F53;&#x524D;&#x6A21;&#x578B;&#x4E5F;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x5927;&#x7684;&#x95EE;&#x9898;&#xFF1A;&#x4E4B;&#x524D;&#x7684;&#x6D4B;&#x8BD5;&#x65F6;&#x95F4;&#x6CA1;&#x6709;&#x5305;&#x542B;&#x63A8;&#x8350;&#x533A;&#x57DF;&#x7684;&#x9009;&#x53D6;&#xFF0C;&#x6545;Fast R-CNN&#x7684;&#x74F6;&#x9888;&#x5728;&#x4E8E;&#x63A8;&#x8350;&#x533A;&#x57DF;&#x7684;&#x9009;&#x62E9;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5C06;&#x63A8;&#x8350;&#x533A;&#x57DF;&#x7684;&#x9009;&#x53D6;&#x6240;&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x4E5F;&#x8003;&#x8651;&#x8FDB;&#x6765;&#xFF0C;&#x76F8;&#x6BD4;&#x4E8E;&#x4E0D;&#x8003;&#x8651;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x901F;&#x5EA6;&#x660E;&#x663E;&#x6162;&#x4E86;&#x5F88;&#x591A;&#x3002;&#x4F46;&#x662F;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x662F;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;&#x3002;</p>
<p>Faster R-CNN</p>
<p>&#x6211;&#x4EEC;&#x80FD;&#x4F7F;&#x7528;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x505A;&#x56DE;&#x5F52;&#x548C;&#x5206;&#x7C7B;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x5176;&#x6765;&#x505A;&#x63A8;&#x8350;&#x533A;&#x57DF;&#x7684;&#x9009;&#x53D6;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x91C7;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x7684;&#x540D;&#x5B57;&#x4E5F;&#x662F;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#x7C97;&#x66B4;&#xFF0C;&#x53EB; Faster R-CNN</p>
<p><img src="/2017/12/17/FastRCNN-FasterRCNN/5.png" alt=""></p>
<p>&#x5728;Fast R-CNN&#x4E2D;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x5BF9;&#x6574;&#x5F20;&#x8F93;&#x5165;&#x56FE;&#x7247;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#x6765;&#x53D6;&#x4EE3;&#x5BF9;&#x5404;&#x4E2A;&#x63A8;&#x8350;&#x533A;&#x57DF;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#xFF1B;&#x5728;Faster R-CNN&#x4E2D;&#x4F7F;&#x7528;&#x533A;&#x57DF;&#x63A8;&#x8350;&#x7F51;&#x7EDC;&#x6765;&#x66FF;&#x4EE3;&#x989D;&#x5916;&#x7684;&#x533A;&#x57DF;&#x63A8;&#x8350;&#x7B97;&#x6CD5;&#x6765;&#x83B7;&#x5F97;&#x5377;&#x79EF;&#x5C42;&#x6700;&#x672B;&#x7AEF;&#x7684;&#x7279;&#x5F81;&#x56FE;&#x8C31;&#xFF0C;&#x5E76;&#x4ECE;&#x4E2D;&#x83B7;&#x53D6;&#x63A8;&#x8350;&#x533A;&#x57DF;&#xFF0C;&#x5B8C;&#x6210;&#x8FD9;&#x4E00;&#x6B65;&#x540E;&#x5269;&#x4E0B;&#x7684;&#x64CD;&#x4F5C;&#x548C;Fast R-CNN&#x4E00;&#x6837;&#x4E86;&#x3002;</p>
<p>Faster R-CNN&#x7684;&#x795E;&#x5947;&#x4E4B;&#x5904;&#x5C31;&#x5728;&#x4E8E;&#x533A;&#x57DF;&#x63A8;&#x8350;&#x7F51;&#x7EDC;&#xFF0C;&#x5B83;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x5B8C;&#x6210;&#x6240;&#x6709;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x533A;&#x57DF;&#x63A8;&#x8350;&#x7F51;&#x7EDC;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x5927;&#x81F4;&#x662F;&#xFF1A;&#x6211;&#x4EEC;&#x628A;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x6700;&#x540E;&#x4E00;&#x5C42;&#x7684;&#x7279;&#x5F81;&#x56FE;&#x8C31;&#x5F53;&#x505A;&#x8F93;&#x5165;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x5C06;&#x533A;&#x57DF;&#x63A8;&#x8350;&#x7F51;&#x7EDC;&#x6DFB;&#x52A0;&#x5230;&#x5377;&#x673A;&#x7F51;&#x7EDC;&#x4E4B;&#x4E0A;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x7279;&#x5F81;&#x56FE;&#x8C31;&#x8FDB;&#x884C;&#x6ED1;&#x7A97;&#x64CD;&#x4F5C;&#xFF0C;&#x5C31;&#x662F;&#x5377;&#x79EF;&#x3002;&#x6211;&#x4EEC;&#x7528;3*3&#x7684;&#x5377;&#x79EF;&#x548C;&#x5BF9;&#x7279;&#x5F81;&#x56FE;&#x8C31;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#x3002;&#x5728;&#x533A;&#x57DF;&#x63A8;&#x8350;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x4E24;&#x79CD;&#x76F8;&#x4F3C;&#x7684;&#x9876;&#x5C42;&#x7ED3;&#x6784;&#x3002;</p>
<p><img src="/2017/12/17/FastRCNN-FasterRCNN/6.png" alt=""></p>
<p>&#x5728;&#x8FD9;&#x8FB9;&#x6211;&#x4EEC;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF0C;&#x5728;&#x53E6;&#x4E00;&#x8FB9;&#x6211;&#x4EEC;&#x5224;&#x65AD;&#x56FE;&#x7247;&#x4E2D;&#x662F;&#x5426;&#x5305;&#x542B;&#x68C0;&#x6D4B;&#x76EE;&#x6807;&#xFF0C;&#x5E76;&#x5BF9;&#x4F4D;&#x7F6E;&#x8FDB;&#x884C;&#x56DE;&#x5F52;&#x3002;&#x6ED1;&#x7A97;&#x548C;&#x7279;&#x5F81;&#x56FE;&#x8C31;&#x4E4B;&#x95F4;&#x7684;&#x4F4D;&#x7F6E;&#x5173;&#x8054;&#x8868;&#x793A;&#x6211;&#x4EEC;&#x67E5;&#x770B;&#x7684;&#x662F;&#x56FE;&#x7247;&#x7684;&#x54EA;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x56DE;&#x5F52;&#x5F97;&#x51FA;&#x7684;&#x7ED3;&#x679C;&#x7ED9;&#x51FA;&#x7279;&#x5F81;&#x56FE;&#x8C31;&#x4E2D;&#x5177;&#x4F53;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5B83;&#x4EEC;&#x6240;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#x8981;&#x7A0D;&#x5FAE;&#x590D;&#x6742;&#x4E00;&#x4E9B;&#x3002;&#x4ED6;&#x4EEC;&#x5E76;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x5BF9;&#x7279;&#x5F81;&#x56FE;&#x8C31;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#x8FDB;&#x884C;&#x56DE;&#x5F52;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x51E0;&#x4E2A;&#x5F62;&#x72B6;&#x56FA;&#x5B9A;&#x7684;&#x6846;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#x8FD9;&#x4E9B;&#x4E0D;&#x540C;&#x5F62;&#x72B6;&#x548C;&#x5C3A;&#x5BF8;&#x7684;&#x6846;&#x6839;&#x636E;&#x7279;&#x5F81;&#x56FE;&#x8C31;&#x70B9;&#x5230;&#x539F;&#x59CB;&#x56FE;&#x7247;&#x70B9;&#x7684;&#x5173;&#x8054;&#xFF0C;&#x8986;&#x76D6;&#x5230;&#x539F;&#x59CB;&#x56FE;&#x7247;&#x4E0A;&#x3002;&#x5728;Fast R-CNN&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8FD9;&#x4E9B;&#x6846;&#x4ECE;&#x539F;&#x59CB;&#x56FE;&#x7247;&#x6620;&#x5C04;&#x5230;&#x7279;&#x5F81;&#x56FE;&#x8C31;&#xFF1B;&#x73B0;&#x5728;&#x5728;Faster R-CNN&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8FD9;&#x4E9B;&#x6846;&#x4ECE;&#x7279;&#x5F81;&#x56FE;&#x8C31;&#x6620;&#x5C04;&#x5230;&#x539F;&#x59CB;&#x56FE;&#x7247;&#x3002;</p>
<p><img src="/2017/12/17/FastRCNN-FasterRCNN/7.png" alt=""></p>
<p>&#x73B0;&#x5728;&#x8FD9;&#x91CC;&#x6709;n&#x4E2A;&#x5377;&#x79EF;&#x6846;&#x5BF9;&#x7279;&#x5F81;&#x56FE;&#x8C31;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#xFF0C;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x533A;&#x57DF;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#x5B83;&#x4EEC;&#x4F1A;&#x4EA7;&#x51FA;&#x4E00;&#x4E2A;&#x8BC4;&#x5206;&#x6765;&#x5224;&#x65AD;&#x8FD9;&#x4E2A;&#x6846;&#x5185;&#x662F;&#x5426;&#x6709;&#x68C0;&#x6D4B;&#x76EE;&#x6807;&#xFF0C;&#x5B83;&#x4EEC;&#x8FD8;&#x4F1A;&#x8F93;&#x51FA;4&#x4E2A;&#x56DE;&#x5F52;&#x5750;&#x6807;&#x70B9;&#x4ECE;&#x800C;&#x5F97;&#x5230;&#x6B63;&#x786E;&#x7684;&#x6846;&#x3002;&#x5C31;&#x50CF;&#x4E4B;&#x524D;&#x4ECB;&#x7ECD;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x8BAD;&#x7EC3;&#x533A;&#x57DF;&#x63A8;&#x8350;&#x7F51;&#x7EDC;&#xFF0C;&#x83B7;&#x5F97;&#x9884;&#x6D4B;&#x672A;&#x77E5;&#x7C7B;&#x7684;&#x68C0;&#x6D4B;&#x5668;&#x3002;</p>
<p>&#x5728;&#x6700;&#x539F;&#x59CB;&#x7684;Faster R-CNN&#x8BBA;&#x6587;&#x4E2D;&#xFF0C;&#x4ED6;&#x4EEC;&#x8BAD;&#x7EC3;&#x7F51;&#x7EDC;&#x7684;&#x65B9;&#x5F0F;&#x633A;&#x6709;&#x610F;&#x601D;&#x7684;&#x3002;&#x4ED6;&#x4EEC;&#x9996;&#x5148;&#x8BAD;&#x7EC3;&#x533A;&#x57DF;&#x63A8;&#x8350;&#x7F51;&#x7EDC;&#xFF0C;&#x7136;&#x540E;&#x8BAD;&#x7EC3;Fast R-CNN&#xFF0C;&#x7136;&#x540E;&#x4ED6;&#x4EEC;&#x628A;&#x4E24;&#x4E2A;&#x7F51;&#x7EDC;&#x878D;&#x5408;&#x8D77;&#x6765;&#xFF0C;&#x6700;&#x7EC8;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x6574;&#x4F53;&#x7684;&#x7F51;&#x7EDC;&#x3002;&#x4E4B;&#x540E;&#x4ED6;&#x4EEC;&#x5C06;&#x8BAD;&#x7EC3;&#x65B9;&#x5F0F;&#x6574;&#x4F53;&#x5316;&#xFF0C;&#x597D;&#x6BD4;&#x4ED6;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x5927;&#x7F51;&#x7EDC;&#xFF0C;&#x8F93;&#x5165;&#x56FE;&#x7247;&#xFF0C;&#x7F51;&#x7EDC;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x5185;&#x7F6E;&#x7684;&#x533A;&#x57DF;&#x63A8;&#x8350;&#x7F51;&#x7EDC;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x5206;&#x7C7B;&#x635F;&#x5931;&#x503C;&#x7528;&#x6765;&#x8868;&#x793A;&#x6BCF;&#x4E2A;&#x63A8;&#x8350;&#x533A;&#x57DF;&#x5185;&#x662F;&#x5426;&#x5305;&#x542B;&#x76EE;&#x6807;&#x7269;&#x4F53;&#x3002;&#x5728;&#x533A;&#x57DF;&#x63A8;&#x8350;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x56DE;&#x5F52;&#x8FB9;&#x6846;&#xFF0C;&#x5BF9;&#x5377;&#x79EF;&#x9876;&#x90E8;&#x7684;&#x7279;&#x5F81;&#x56FE;&#x8C31;&#x8FDB;&#x884C;&#x56DE;&#x5F52;&#xFF0C;&#x7136;&#x540E;&#x8FDB;&#x884C;roi&#x6C60;&#x5316;&#xFF0C;&#x4E4B;&#x540E;&#x505A;Fast R-CNN&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5728;&#x7F51;&#x7EDC;&#x7684;&#x672B;&#x7AEF;&#x6211;&#x4EEC;&#x4F1A;&#x5F97;&#x5230;&#x5206;&#x7C7B;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#x7528;&#x6765;&#x8868;&#x793A;&#x76EE;&#x6807;&#x6240;&#x5C5E;&#x7C7B;&#x4EE5;&#x53CA;&#x56DE;&#x5F52;&#x635F;&#x5931;&#xFF0C;&#x6765;&#x83B7;&#x5F97;&#x6B63;&#x786E;&#x7684;&#x63A8;&#x8350;&#x533A;&#x57DF;&#x3002;</p>
<p><img src="/2017/12/17/FastRCNN-FasterRCNN/8.png" alt=""></p>
<p>&#x8FD9;&#x9879;&#x5DE8;&#x5927;&#x7684;&#x5DE5;&#x4F5C;&#x5728;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x7F51;&#x7EDC;&#x4E2D;&#x5B8C;&#x6210;&#xFF0C;&#x6700;&#x7EC8;&#x8F93;&#x51FA;4&#x4E2A;&#x635F;&#x5931;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x5176;&#x8BAD;&#x7EC3;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x5B8C;&#x6210;&#x76EE;&#x6807;&#x68C0;&#x6D4B;&#x7684;&#x591A;&#x9879;&#x5DE5;&#x4F5C;</p>
<p>&#x6240;&#x4EE5;&#x76EE;&#x524D;&#x4E16;&#x754C;&#x4E0A;&#x6700;&#x597D;&#x7684;&#x76EE;&#x6807;&#x68C0;&#x6D4B;&#x5668;&#x662F;101&#x5C42;&#x7684;ResNet&#x52A0;&#x4E0A;Faster R-CNN&#x5728;&#x52A0;&#x4E0A;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5728;Fast R-CNN&#x4E2D;&#xFF0C;&#x5B83;&#x662F;&#x5BF9;&#x4F60;&#x7684;&#x533A;&#x57DF;&#x5EFA;&#x8BAE;&#x505A;&#x4E86;&#x4E00;&#x4E2A;&#x4FEE;&#x6B63;&#xFF0C;&#x7136;&#x540E;&#x4F1A;&#x5C06;&#x5B83;&#x53CD;&#x9988;&#x7ED9;&#x4F60;&#x7684;&#x7F51;&#x8DEF;&#xFF0C;&#x6700;&#x540E;&#x91CD;&#x65B0;&#x5206;&#x7C7B;&#x6216;&#x91CD;&#x65B0;&#x83B7;&#x53D6;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x9884;&#x6D4B;&#x503C;&#xFF0C;&#x8FD9;&#x5C31;&#x8FDB;&#x884C;&#x4E86;&#x4E00;&#x6B21;&#x6B21;&#x8FB9;&#x6846;&#x7684;&#x6539;&#x8FDB;&#xFF0C;&#x6027;&#x80FD;&#x4E5F;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x800C;&#x5F97;&#x5230;&#x4E86;&#x63D0;&#x9AD8;&#x3002;&#x9664;&#x4E86;&#x5BF9;&#x8FD9;&#x4E9B;&#x533A;&#x57DF;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x4E4B;&#x5916;&#xFF0C;&#x4ED6;&#x4EEC;&#x8FD8;&#x5F97;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x4F53;&#x73B0;&#x6574;&#x5F20;&#x56FE;&#x7247;&#x6240;&#x6709;&#x7684;&#x7279;&#x5F81;&#x5411;&#x91CF;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x4F53;&#x73B0;&#x51FA;&#x66F4;&#x597D;&#x7684;&#x5185;&#x5BB9;&#x548C;&#x66F4;&#x597D;&#x7684;&#x6027;&#x80FD;&#x3002;</p>
<p>&#x540C;&#x65F6;&#xFF0C;&#x5B83;&#x4EEC;&#x8FD8;&#x8FDB;&#x884C;&#x4E86;&#x591A;&#x4E2A;&#x5C3A;&#x5EA6;&#x7684;&#x6D4B;&#x8BD5;&#xFF0C;&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x5728;Overfeat&#x4E2D;&#x770B;&#x5230;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x6D4B;&#x8BD5;&#x65F6;&#x5C06;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5C3A;&#x5BF8;&#x4E0A;&#x8FD0;&#x884C;&#x3002;</p>
<h2 id="YOLO&#xFF1A;You-Only-Look-Once-Detection"><a href="#YOLO&#xFF1A;You-Only-Look-Once-Detection" class="headerlink" title="YOLO&#xFF1A;You Only Look Once Detection "></a>YOLO&#xFF1A;You Only Look Once Detection </h2><p>&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x8BF4;&#x8FC7;&#x5173;&#x4E8E;&#x5B9A;&#x4E3A;&#x56DE;&#x5F52;&#x7684;&#x4E00;&#x4E2A;&#x60F3;&#x6CD5;&#xFF0C;&#x8FD9;&#x4EF6;&#x4E8B;&#x53EB;YOLO&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5B83;&#x5C06;&#x68C0;&#x6D4B;&#x95EE;&#x9898;&#x76F4;&#x63A5;&#x5F53;&#x505A;&#x56DE;&#x5F52;&#x95EE;&#x9898;&#x6765;&#x5904;&#x7406;&#x3002;</p>
<p><img src="/2017/12/17/FastRCNN-FasterRCNN/9.png" alt=""></p>
<p>&#x5B83;&#x5C06;&#x6211;&#x4EEC;&#x8F93;&#x5165;&#x7684;&#x56FE;&#x50CF;&#x5212;&#x5206;&#x6210;&#x8BB8;&#x591A;&#x4E2A;&#x7A7A;&#x95F4;&#x7F51;&#x683C;&#xFF08;S <em> S&#xFF09;&#xFF0C;&#x901A;&#x5E38;&#x662F;7</em>7&#x7684;&#x7F51;&#x683C;&#xFF0C;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x7F51;&#x683C;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x5173;&#x4E8E;&#x8FB9;&#x754C;&#x68C0;&#x6D4B;&#x7684;&#x6570;&#xFF08;B&#xFF09;&#xFF0C;&#x5728;&#x5927;&#x90E8;&#x5206;&#x7684;&#x5B9E;&#x9A8C;&#x4E2D;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x4F7F;&#x7528;B=2&#x3002;</p>
<p>&#x5728;&#x6BCF;&#x4E2A;&#x7F51;&#x7EDC;&#x4E0A;&#xFF0C;&#x4F60;&#x8981;&#x9884;&#x6D4B;2&#x4E2A;B&#x8FB9;&#x754C;&#x6846;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;4&#x4E2A;&#x6570;&#xFF0C;&#x8FD8;&#x8981;&#x9884;&#x6D4B;&#x4E00;&#x4E2A;&#x6811;&#x6765;&#x8868;&#x793A;&#x8FD9;&#x4E00;&#x8FB9;&#x754C;&#x6846;&#x7684;&#x53EF;&#x4FE1;&#x5EA6;&#xFF0C;&#x540C;&#x65F6;&#x4F60;&#x8FD8;&#x8981;&#x5BF9;&#x4F60;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x7C7B;&#x8BA1;&#x7B97;&#x9884;&#x6D4B;&#x5206;&#x7C7B;&#x7684;&#x8BC4;&#x5206;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x6700;&#x7EC8;&#x68C0;&#x6D4B;&#x95EE;&#x9898;&#x6700;&#x7EC8;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x56DE;&#x5F52;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x56DE;&#x5F52;&#x95EE;&#x9898;&#xFF0C;&#x5F80;&#x5F80;&#x9700;&#x8981;&#x7528;CNN&#x6765;&#x8BAD;&#x7EC3;&#x5B83;&#x3002;&#x5B83;&#x548C;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x8BB2;&#x7684;&#x533A;&#x57DF;&#x5EFA;&#x8BAE;&#x4E4B;&#x7C7B;&#x7684;&#x4E1C;&#x897F;&#x4E0D;&#x540C;&#xFF0C;&#x5F53;&#x7136;&#x4ED6;&#x4E5F;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x5B83;&#x7684;&#x6A21;&#x578B;&#x8F93;&#x51FA;&#x7684;&#x6570;&#x91CF;&#x662F;&#x6709;&#x4E0A;&#x9650;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x4F60;&#x7684;&#x6D4B;&#x8BD5;&#x6570;&#x636E;&#x548C;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x4E2D;&#x6709;&#x5F88;&#x591A;&#x7684;ground-truth&#xFF0C;&#x5C31;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x3002;</p>
<p><img src="/2017/12/17/FastRCNN-FasterRCNN/10.png" alt=""></p>
<p>&#x5B9E;&#x9645;&#x4E0A;&#x8FD9;&#x4E2A;YOLO&#x68C0;&#x6D4B;&#x5668;&#x7684;&#x901F;&#x5EA6;&#x662F;&#x5F88;&#x5FEB;&#x7684;&#xFF0C;&#x5B83;&#x751A;&#x81F3;&#x6BD4;Faster R-CNN&#x8FD8;&#x8981;&#x5FEB;&#x3002;&#x4F46;&#x662F;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#x5B83;&#x7684;&#x5DE5;&#x4F5C;&#x6548;&#x679C;&#x4E0D;&#x662F;&#x5F88;&#x597D;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x6709;&#x4E86;Fast YOLO</p>
<h2 id="&#x8865;&#x5145;"><a href="#&#x8865;&#x5145;" class="headerlink" title="&#x8865;&#x5145;"></a>&#x8865;&#x5145;</h2><p><strong>&#x5916;&#x90E8;&#x533A;&#x57DF;&#x63A8;&#x8350;&#x7684;&#x601D;&#x60F3;</strong>&#xFF1A;&#x4F60;&#x5728;&#x505A;&#x5916;&#x90E8;&#x533A;&#x57DF;&#x63A8;&#x8350;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x6240;&#x505A;&#x7684;&#x662F;&#x9009;&#x53D6;&#x533A;&#x57DF;&#xFF0C;&#x7136;&#x540E;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#x3002;&#x5982;&#x679C;&#x80FD;&#x591F;&#x540C;&#x65F6;&#x505A;&#x5230;&#x8FD9;&#x4E9B;&#xFF0C;&#x90A3;&#x4F1A;&#x662F;&#x5F88;&#x4E0D;&#x9519;&#x7684;&#x3002;</p>
<p>&#x5377;&#x79EF;&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x5BF9;&#x56FE;&#x7247;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x7684;&#x4E00;&#x822C;&#x8FC7;&#x7A0B;&#xFF0C;&#x4F60;&#x671F;&#x5F85;&#x5377;&#x79EF;&#x80FD;&#x5BF9;&#x5206;&#x7C7B;&#x548C;&#x56DE;&#x5F52;&#x6709;&#x5229;&#x3002;&#x5176;&#x5B9E;&#x5377;&#x79EF;&#x4E2D;&#x6240;&#x5305;&#x542B;&#x7684;&#x4FE1;&#x606F;&#x5BF9;&#x533A;&#x57DF;&#x9009;&#x53D6;&#x540C;&#x6837;&#x662F;&#x5341;&#x5206;&#x6709;&#x7528;&#x7684;&#x3002;&#x8FD9;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x51CF;&#x5C11;&#x8BA1;&#x7B97;&#x91CF;&#x3002;</p>
<p>&#x5728;&#x6700;&#x540E;&#xFF0C;&#x5BF9;&#x4E8E;&#x6240;&#x6709;&#x5212;&#x5206;&#xFF0C;&#x4F60;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x540C;&#x6837;&#x7684;&#x5377;&#x79EF;&#x7279;&#x5F81;&#x56FE;&#x8C31;&#xFF0C;&#x4E0D;&#x8BBA;&#x662F;&#x533A;&#x57DF;&#x63A8;&#x8350;&#xFF0C;&#x8FD8;&#x662F;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x5206;&#x7C7B;&#x548C;&#x56DE;&#x5F52;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4F55;&#x80FD;&#x4ECE;&#x8FD9;&#x91CC;&#x83B7;&#x5F97;&#x8FD0;&#x7B97;&#x901F;&#x5EA6;&#x7684;&#x63D0;&#x5347;</p>
<p><strong>Rol&#x6C60;&#x5316;</strong>&#xFF1A;&#x5176;&#x5DE5;&#x4F5C;&#x8FC7;&#x7A0B;&#x662F;&#x901A;&#x8FC7;&#x5C06;&#x539F;&#x59CB;&#x56FE;&#x50CF;&#x5206;&#x89E3;&#x6210;&#x56FA;&#x5B9A;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x5176;&#x505A;&#x6700;&#x5927;&#x6C60;&#x5316;&#xFF0C;&#x5BF9;&#x5B83;&#x505A;&#x65CB;&#x8F6C;&#x53D8;&#x6362;&#x662F;&#x6BD4;&#x8F83;&#x56F0;&#x96BE;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x4E00;&#x4E2A;&#x53EB;&#x7A7A;&#x95F4;&#x53D8;&#x6362;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6A21;&#x578B;&#x63D0;&#x51FA;&#x4E86;&#x5F88;&#x597D;&#x89E3;&#x51B3;&#x8BE5;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x5B83;&#x7684;&#x4E2D;&#x5FC3;&#x601D;&#x60F3;&#x662F;&#xFF1A;&#x4E0D;&#x540C;&#x4E8E;Rol&#x6C60;&#x5316;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x7684;&#x662F;&#x53CC;&#x7EBF;&#x6027;&#x63D2;&#x503C;&#xFF0C;&#x8FD9;&#x6709;&#x4E9B;&#x50CF;&#x6211;&#x4EEC;&#x5728;&#x5904;&#x7406;&#x7EB9;&#x7406;&#x548C;&#x56FE;&#x5F62;&#x4E2D;&#x7528;&#x5230;&#x7684;&#x3002;&#x5F53;&#x4F60;&#x4F7F;&#x7528;&#x53CC;&#x7EBF;&#x6027;&#x63D2;&#x503C;&#x65F6;&#xFF0C;&#x4E5F;&#x8BB8;&#x4F60;&#x5C31;&#x80FD;&#x5BF9;&#x8FD9;&#x4E9B;&#x533A;&#x57DF;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x6211;&#x8BA4;&#x4E3A;&#x53E6;&#x4E00;&#x4E2A;&#x5173;&#x4E8E;&#x65CB;&#x8F6C;&#x5BF9;&#x8C61;&#x6BD4;&#x8F83;&#x5B9E;&#x9645;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x6CA1;&#x6709;&#x4E0E;&#x4E4B;&#x5BF9;&#x5E94;&#x7684;ground-truth&#xFF0C;&#x5BF9;&#x4E8E;&#x5927;&#x90E8;&#x5206;&#x68C0;&#x6D4B;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x6211;&#x4EEC;&#x4EC5;&#x6709;&#x7684;ground-truth&#x4FE1;&#x606F;&#x90FD;&#x662F;&#x6CBF;&#x7740;&#x5750;&#x6807;&#x8F74;&#x7684;&#x3002;</p>
<h2 id="&#x672C;&#x6587;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x6A21;&#x578B;&#x94FE;&#x63A5;"><a href="#&#x672C;&#x6587;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x6A21;&#x578B;&#x94FE;&#x63A5;" class="headerlink" title="&#x672C;&#x6587;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x6A21;&#x578B;&#x94FE;&#x63A5;"></a>&#x672C;&#x6587;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x6A21;&#x578B;&#x94FE;&#x63A5;</h2><p><a href="https://github.com/rbgirshick/rcnn" target="_blank" rel="external">R-CNN(Caffe + MATLAB)</a></p>
<p><a href="https://github.com/rbgirshick/fast-rcnn" target="_blank" rel="external">Fast R-CNN(Caffe + MATLAB)</a></p>
<p><a href="https://github.com/ShaoqingRen/faster_rcnn" target="_blank" rel="external">Faster R-CNN(Caffe + MATLAB)</a></p>
<p><a href="https://github.com/rbgirshick/py-faster-rcnn" target="_blank" rel="external">Faster R-CNN(Caffe + Python)</a></p>
<p><a href="http://pjreddie.com/darknet/yolo/" target="_blank" rel="external">YOLO</a></p>

      
    </div><!-- .entry-content -->

    <footer class="entry-meta">
    <a href="/2017/12/17/FastRCNN-FasterRCNN/">
    <time datetime="2017-12-17T08:10:42.000Z" class="entry-date">
        2017-12-17
    </time>
</a>
    
  <span class="article-delim">&#8226;</span>
  <div class="article-category">
  <a class="article-category-link" href="/categories/ML/">ML</a>
  </div>

    
  <span class="article-delim">&#8226;</span>
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/Neural-Networks/">Neural Networks</a></li></ul>

    </footer>
</article>


    
<nav class="nav-single">
    <h3 class="assistive-text">文章导航</h3>
    
    
        <span class="nav-next"><a href="/2017/11/17/如何在Xcode中添加-bits-stdc-h-头文件/" rel="next">如何在Xcode中添加&lt;bits/stdc++.h&gt;头文件 <span class="meta-nav">→</span></a></span>
    
</nav><!-- .nav-single -->







</div></div>
        <div id="secondary" class="widget-area" role="complementary">
  
    <aside id="search" class="widget widget_search"><form role="search" method="get" accept-charset="utf-8" id="searchform" class="searchform" action="//google.com/search">
    <div>
        <input type="text" value="" name="s" id="s" />
        <input type="submit" id="searchsubmit" value="搜索" />
    </div>
</form></aside>
  
    
  
    
  <aside class="widget">
    <h3 class="widget-title">Categories</h3>
    <div class="widget-content">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/LIFE/">LIFE</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/MAC/">MAC</a><span class="category-list-count">3</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/ML/">ML</a><span class="category-list-count">26</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/PGM/">PGM</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/iOS/">iOS</a><span class="category-list-count">22</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/御宅文化/">御宅文化</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/算法/">算法</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/编程/">编程</a><span class="category-list-count">58</span></li></ul>
    </div>
  </aside>

  
    
<div class="widget tag">
<h3 class="title">blogroll</h3>
<ul class="entry">


<li><a href="https://github.com/" target="_blank">我的github</a></li>


<li><a href="http://www.jianshu.com/users/41cd7711ed44/latest_articles" target="_blank">我的简书主页</a></li>


<li><a href="http://uuzdaisuki.com" target="_blank">leticia’s blog</a></li>


<li><a href="http://www.helloyzy.cn" target="_blank">acery</a></li>


<li><a href="http://wxjackie.com" target="_blank">WXJACKIE</a></li>


<li><a href="http://www.stephenzhang.me" target="_blank">stephenzhang</a></li>


<li><a href="blog.keybrl.com" target="_blank">keybrl</a></li>


<li><a href="http://blog.ciaran.cn" target="_blank">Ciaran</a></li>


<li><a href="http://1.dev.blog.qinka.pro" target="_blank">Qinka</a></li>


<li><a href="http://tobiasLee.top" target="_blank">TobiasLee</a></li>


<li><a href="http://blog.boileryao.com" target="_blank">bingo</a></li>

</ul>
</div>

  
    
  <aside class="widget">
    <h3 class="widget-title">Recents</h3>
    <div class="widget-content">
      <ul>
        
          <li>
            <a href="/2017/12/17/FastRCNN-FasterRCNN/">谈一谈 Fast R-CNN 和 Faster R-CNN</a>
          </li>
        
          <li>
            <a href="/2017/11/17/如何在Xcode中添加-bits-stdc-h-头文件/">如何在Xcode中添加&lt;bits/stdc++.h&gt;头文件</a>
          </li>
        
          <li>
            <a href="/2017/11/02/LSTM/">RNN 与 LSTM</a>
          </li>
        
          <li>
            <a href="/2017/11/01/循环神经网络-RNN/">循环神经网络_RNN</a>
          </li>
        
          <li>
            <a href="/2017/10/31/CNN之定位检测/">卷积神经网络之定位检测</a>
          </li>
        
      </ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Tags</h3>
    <div class="widget-content">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/Cloud-Computing/">Cloud Computing</a><span class="tag-list-count">3</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Cocoapods/">Cocoapods</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/HTML/">HTML</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Linux/">Linux</a><span class="tag-list-count">15</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Machine-Learning/">Machine Learning</a><span class="tag-list-count">17</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Matlab/">Matlab</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Neural-Networks/">Neural Networks</a><span class="tag-list-count">6</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Probabilistic-Graphical-Models/">Probabilistic Graphical Models</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIColor/">UIColor</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView/">UIView</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView-圆角/">UIView-圆角</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Vim/">Vim</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/bug/">bug</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/hexo/">hexo</a><span class="tag-list-count">4</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/openCV/">openCV</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/二维码/">二维码</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/指针/">指针</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/操作系统/">操作系统</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/数据库/">数据库</a><span class="tag-list-count">3</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/数据结构/">数据结构</a><span class="tag-list-count">20</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/算法/">算法</a><span class="tag-list-count">9</span></li></ul>
    </div>
  </aside>

  
</div>
      </div>
      <footer id="colophon" role="contentinfo">
    <p>&copy; 2017 SaberDa
    All rights reserved.</p>
    <p>Powered by <a href="http://hexo.io/" target="_blank">Hexo</a></p>
</footer>
    <script>window._bd_share_config={"common":{"bdSnsKey":{},"bdText":"","bdMini":"1","bdMiniList":false,"bdPic":"","bdStyle":"2","bdSize":"16"},"share":{}};with(document)0[(getElementsByTagName('head')[0]||body).appendChild(createElement('script')).src='http://bdimg.share.baidu.com/static/api/js/share.js?v=89860593.js?cdnversion='+~(-new Date()/36e5)];</script>

<script src="/js/jquery-2.0.3.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

<script src="/js/navigation.js"></script>

<div id="bg"></div>

  </div>
</body>
</html>