<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  
  <meta name="description" content="阿尔托利亚是我老婆~" />
  

  
  
  
  
  
  
  <title>带你进入龙与地下城的世界 | SaberDa的幻想乡</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="D20&amp;#xFF0C;&amp;#x5168;&amp;#x7A0B;Dice20&amp;#x3002;&amp;#x662F;&amp;#x4E00;&amp;#x4E2A;&amp;#x6700;&amp;#x5927;&amp;#x6570;&amp;#x4E3A;20&amp;#x7684;&amp;#x4E8C;&amp;#x5341;&amp;#x9762;&amp;#x9AB0;&amp;#x5B50;&amp;#x3002;&amp;#x5728;&amp;#x8FC7;&amp;#x53BB;&amp;#x7684;&amp;#x56DB;&amp;#x53">
<meta property="og:type" content="article">
<meta property="og:title" content="带你进入龙与地下城的世界">
<meta property="og:url" content="https://saberda.github.io/2016/11/13/带你进入龙与地下城的世界/index.html">
<meta property="og:site_name" content="SaberDa的幻想乡">
<meta property="og:description" content="D20&amp;#xFF0C;&amp;#x5168;&amp;#x7A0B;Dice20&amp;#x3002;&amp;#x662F;&amp;#x4E00;&amp;#x4E2A;&amp;#x6700;&amp;#x5927;&amp;#x6570;&amp;#x4E3A;20&amp;#x7684;&amp;#x4E8C;&amp;#x5341;&amp;#x9762;&amp;#x9AB0;&amp;#x5B50;&amp;#x3002;&amp;#x5728;&amp;#x8FC7;&amp;#x53BB;&amp;#x7684;&amp;#x56DB;&amp;#x53">
<meta property="og:updated_time" content="2016-11-14T16:04:20.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="带你进入龙与地下城的世界">
<meta name="twitter:description" content="D20&amp;#xFF0C;&amp;#x5168;&amp;#x7A0B;Dice20&amp;#x3002;&amp;#x662F;&amp;#x4E00;&amp;#x4E2A;&amp;#x6700;&amp;#x5927;&amp;#x6570;&amp;#x4E3A;20&amp;#x7684;&amp;#x4E8C;&amp;#x5341;&amp;#x9762;&amp;#x9AB0;&amp;#x5B50;&amp;#x3002;&amp;#x5728;&amp;#x8FC7;&amp;#x53BB;&amp;#x7684;&amp;#x56DB;&amp;#x53">
  
  
    <link rel="icon" href="/css/images/favicon.ico">
  
  <link rel="stylesheet" href="/css/style.css">
  

  
  <!-- baidu webmaster push -->
  <script src='//push.zhanzhang.baidu.com/push.js'></script>
</head>
<body class="home blog custom-background custom-font-enabled single-author">
  <div id="page" class="hfeed site">
      <header id="masthead" class="site-header" role="banner">
    <hgroup>
      <h1 class="site-title">
        <a href="/" title="SaberDa的幻想乡" rel="home">SaberDa的幻想乡</a>
      </h1>
      
        <h2 class="site-description">
          <a href="/" id="subtitle">　　iOS　　|　　二次元　　|　　630991493@qq.com　　|　　我生而坚强 只要不死 就能笑的猖狂</a>
        </h2>
      
    </hgroup>

    <nav id="site-navigation" class="main-navigation" role="navigation">
            <button class="menu-toggle">菜单</button>
            <a class="assistive-text" href="/#content" title="跳至内容">跳至内容</a><!--TODO-->
            <div class="menu-main-container">
                <ul id="menu-main" class="nav-menu">
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/archives">所有文章</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/">主页</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/编程/">编程</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/iOS/">iOS</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/机器学习/">机器学习</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/MAC/">MAC</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/御宅文化/">御宅文化</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/LIFE/">LIFE</a></li>
                
                </ul>
            </div>
    </nav>
</header>
      <div id="main" class="wrapper">
        <div id="primary" class="site-content"><div id="content" role="main"><article id="post-带你进入龙与地下城的世界" class="post-带你进入龙与地下城的世界 post type-post status-publish format-standard hentry">
    <!---->

      <header class="entry-header">
        
        
  
    <h1 class="entry-title article-title">
      带你进入龙与地下城的世界
    </h1>
  

        
        <div class="comments-link">
            
            <a href="javascript:void(0);" data-url="https://saberda.github.io/2016/11/13/带你进入龙与地下城的世界/" data-id="ciwnnr5fd005fuib3wy9g7x6y" class="leave-reply bdsharebuttonbox" data-cmd="more">Share</a>
        </div><!-- .comments-link -->
      </header><!-- .entry-header -->

    <div class="entry-content">
      
        <p>D20&#xFF0C;&#x5168;&#x7A0B;Dice20&#x3002;&#x662F;&#x4E00;&#x4E2A;&#x6700;&#x5927;&#x6570;&#x4E3A;20&#x7684;&#x4E8C;&#x5341;&#x9762;&#x9AB0;&#x5B50;&#x3002;&#x5728;&#x8FC7;&#x53BB;&#x7684;&#x56DB;&#x5341;&#x5E74;&#x95F4;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x6210;&#x4E3A;&#x4E86;&#x5728;&#x7535;&#x5B50;&#x6E38;&#x620F;&#x754C;&#x4E43;&#x81F3;&#x4E16;&#x754C;&#x6E38;&#x620F;&#x53F2;&#x4E0A;&#x6700;&#x91CD;&#x8981;&#x7684;&#x7B26;&#x53F7;&#xFF0C;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x5F71;&#x54CD;&#x65E0;&#x6CD5;&#x4F30;&#x91CF;&#x3002;&#x800C;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#xFF0C;&#x662F;&#x73A9;&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;&#x7684;&#x91CD;&#x8981;&#x9053;&#x5177;&#x3002;&#xFF08;&#x4E5F;&#x662F;&#x4E07;&#x667A;&#x7684;&#x4E3B;&#x8981;&#x9053;&#x5177;&#xFF09;</p>
<p>&#x90A3;&#x4EC0;&#x4E48;&#x662F;&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;&#x5462;&#xFF1F;</p>
<a id="more"></a>
<h2 id="&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;"><a href="#&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;" class="headerlink" title="&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;"></a>&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;</h2><p>&#x5728;&#x751F;&#x6D3B;&#x91CC;&#xFF0C;&#x4F60;&#x5728;&#x6D4F;&#x89C8;&#x6E38;&#x620F;&#x3001;&#x6E38;&#x620F;&#x6D4B;&#x8BC4;&#x7684;&#x65F6;&#x5019;&#x603B;&#x4F1A;&#x770B;&#x5230;&#xFF1A;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x57FA;&#x4E8E;&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;&#xFF0C;&#x90A3;&#x4E2A;&#x6E38;&#x620F;&#x662F;&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;&#x80CC;&#x666F;&#xFF0C;&#x90A3;&#x4E2A;&#x6E38;&#x620F;&#x501F;&#x9274;&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4F60;&#x4E0D;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x662F;&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x5F88;&#x597D;&#x5947;&#xFF0C;&#x4F60;&#x5C31;&#x767E;&#x5EA6;&#x4E00;&#x4E0B;&#xFF0C;&#x7136;&#x540E;&#x767E;&#x5EA6;&#x767E;&#x79D1;&#x91CC;&#x4E00;&#x5927;&#x5806;&#x7684;&#x6E38;&#x620F;&#x89C4;&#x5219;&#x6E38;&#x620F;&#x8BBE;&#x5B9A;&#xFF0C;&#x5230;&#x5934;&#x6765;&#x4F60;&#x4EC0;&#x4E48;&#x4E5F;&#x6CA1;&#x6709;&#x641E;&#x61C2;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x4ECA;&#x5929;&#x6211;&#x4EEC;&#x5C31;&#x6765;&#x4E00;&#x52B3;&#x6C38;&#x9038;&#x7684;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<pre><code>&#x4EC0;&#x4E48;&#x662F;&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;&#xFF1F;&#x800C;&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;&#x53C8;&#x4EA7;&#x751F;&#x4E86;&#x591A;&#x5927;&#x7684;&#x5F71;&#x54CD;&#xFF1F;
</code></pre><h2 id="&#x5386;&#x53F2;"><a href="#&#x5386;&#x53F2;" class="headerlink" title="&#x5386;&#x53F2;"></a>&#x5386;&#x53F2;</h2><p>&#x5C06;&#x65F6;&#x95F4;&#x63A8;&#x56DE;&#x81F3;&#x4E0A;&#x4E2A;&#x4E16;&#x7EAA;&#x516D;&#x4E03;&#x5341;&#x5E74;&#x4EE3;&#xFF0C;&#x90A3;&#x65F6;&#x7684;&#x4EBA;&#x4EEC;&#x8FD8;&#x6CA1;&#x6709;&#x7535;&#x5B50;&#x6E38;&#x620F;&#xFF0C;&#x5F53;&#x65F6;&#x7684;&#x73A9;&#x5BB6;&#x53EA;&#x80FD;&#x73A9;&#x684C;&#x6E38;&#x3002;&#x7136;&#x540E;&#x5F53;&#x65F6;&#x6709;&#x4E2A;&#x4EBA;&#xFF0C;&#x53EB;G&#x4EC0;&#x4E48;&#x6765;&#x7740;&#xFF0C;&#x5177;&#x4F53;&#x5FD8;&#x4E86;&#xFF0C;&#x6682;&#x65F6;&#x5C31;&#x53EB;&#x4ED6;G&#x80D6;&#x5427;&#x3002;</p>
<p>G&#x80D6;&#x5F53;&#x65F6;&#x5FC3;&#x8840;&#x6765;&#x6F6E;&#xFF0C;&#x60F3;&#x628A;&#x519B;&#x65D7;&#x91CC;&#x7684;&#x5927;&#x70AE;&#x6362;&#x4E3A;&#x9B54;&#x6CD5;&#x5E08;&#xFF0C;&#x6539;&#x4E3A;&#x9B54;&#x5E7B;&#x80CC;&#x666F;&#x7684;&#x6E38;&#x620F;&#xFF0C;&#x7136;&#x540E;&#x4ED6;&#x505A;&#x51FA;&#x4E86;&#x4E00;&#x6B3E;&#x300A;&#x94FE;&#x7532;&#x300B;&#x7684;&#x684C;&#x9762;&#x6218;&#x65D7;&#x6E38;&#x620F;&#x3002;&#x800C;&#x540E;G&#x80D6;&#x548C;&#x4ED6;&#x5FD7;&#x540C;&#x9053;&#x5408;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x5728;&#x300A;&#x94FE;&#x7532;&#x300B;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x4E00;&#x987F;&#x75AF;&#x72C2;&#x7684;&#x9B54;&#x6539;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x8BDE;&#x751F;&#x4E86;&#x6211;&#x4EEC;&#x4ECA;&#x5929;&#x7684;&#x4E3B;&#x89D2;&#xFF0C;&#x300A;&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;&#x300B;&#xFF0C;&#x7B80;&#x79F0;dnd&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;&#x662F;&#x4E00;&#x6B3E;&#x684C;&#x6E38;&#xFF0C;&#x7136;&#x800C;&#x8FD9;&#x4E2A;&#x684C;&#x6E38;&#x548C;&#x5F53;&#x65F6;&#x7684;&#x6218;&#x68CB;&#x684C;&#x6E38;&#x4E0D;&#x540C;&#x70B9;&#x5728;&#x4E8E;&#xFF0C;&#x5728;&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;&#x4E2D;&#x4F60;&#x4E0D;&#x518D;&#x626E;&#x6F14;&#x519B;&#x961F;&#x7684;&#x6307;&#x6325;&#x5B98;&#xFF0C;&#x53BB;&#x6307;&#x6325;&#x519B;&#x961F;&#x5728;&#x6218;&#x573A;&#x4E0A;&#x5F81;&#x4F10;&#xFF0C;&#x800C;&#x662F;&#x626E;&#x6F14;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x4E2A;&#x4F53;&#xFF0C;&#x5728;&#x4E00;&#x4E2A;&#x9B54;&#x5E7B;&#x7684;&#x5F02;&#x4E16;&#x754C;&#x63A2;&#x9669;&#x3002;</p>
<pre><code>&#x6240;&#x4EE5;&#x8BF4;&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;&#x600E;&#x4E48;&#x73A9;&#x5462;&#xFF1F;
</code></pre><h2 id="&#x73A9;&#x6CD5;"><a href="#&#x73A9;&#x6CD5;" class="headerlink" title="&#x73A9;&#x6CD5;"></a>&#x73A9;&#x6CD5;</h2><p>&#x9996;&#x5148;&#xFF0C;&#x73A9;&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x50CF;&#x73A9;&#x522B;&#x7684;&#x684C;&#x6E38;&#x4E00;&#x6837;&#x8D2D;&#x4E70;&#x4E00;&#x4E2A;&#x684C;&#x6E38;&#x76D2;&#x5B50;&#xFF0C;&#x7136;&#x540E;&#x91CC;&#x9762;&#x6709;&#x4E00;&#x5F20;&#x5927;&#x7684;&#x5730;&#x56FE;&#x7EB8;&#x7136;&#x540E;&#x4E00;&#x5806;&#x6307;&#x793A;&#x7269;&#x3001;&#x5361;&#x7247;&#x548C;&#x9053;&#x5177;&#x3002;&#x6709;&#x65F6;&#x5019;&#x73A9;&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;&#x4F60;&#x751A;&#x81F3;&#x4E0D;&#x9700;&#x8981;&#x53BB;&#x8D2D;&#x4E70;&#x4EFB;&#x4F55;&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;&#x7684;&#x5B98;&#x65B9;&#x4EA7;&#x54C1;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x9700;&#x8981;&#x505A;&#x7684;&#xFF0C;&#x662F;&#x719F;&#x8BFB;&#x4E00;&#x672C;&#x4E66;&#x3002;&#x5E76;&#x643A;&#x5E26;&#x8FD9;&#x672C;&#x4E66;&#x4F5C;&#x4E3A;&#x6E38;&#x620F;&#x4E2D;&#x7684;&#x53C2;&#x8003;&#x8D44;&#x6599;&#x3002;&#x8FD9;&#x672C;&#x4E66;&#x5C31;&#x662F;<strong>&#x300A;&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;&#x73A9;&#x5BB6;&#x624B;&#x518C;&#x300B;</strong>&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x8BB0;&#x5F55;&#x4E86;&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;&#x7684;&#x89C4;&#x5219;&#x3002;</p>
<p>&#x7136;&#x540E;&#x4E0B;&#x4E00;&#x6B65;&#x5C31;&#x662F;&#x634F;&#x8138;&#xFF0C;&#x554A;&#x4E0D;&#x5BF9;&#xFF0C;&#x662F;&#x521B;&#x5EFA;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x4EBA;&#x7269;&#xFF0C;&#x4F60;&#x7684;&#x4EBA;&#x7269;&#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x4E2A;&#x9B54;&#x5E7B;&#x4E16;&#x754C;&#x4E2D;&#x7684;&#x79CD;&#x65CF;&#xFF0C;&#x4EBA;&#x7C7B;&#x3001;&#x7CBE;&#x7075;&#x3001;&#x77EE;&#x4EBA;&#x3001;&#x4F8F;&#x5112;&#x7B49;&#x7B49;&#x3002;&#x800C;&#x4E14;&#x6709;&#x4E00;&#x4E2A;&#x9B54;&#x5E7B;&#x4E16;&#x754C;&#x4E2D;&#x63A2;&#x9669;&#x5BB6;&#x7684;&#x804C;&#x4E1A;&#xFF0C;&#x6BD4;&#x5982;&#x6CD5;&#x5E08;&#x6218;&#x58EB;&#x7267;&#x5E08;&#x6B66;&#x50E7;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x4E4B;&#x540E;&#x518D;&#x786E;&#x8BA4;&#x4F60;&#x4EBA;&#x7269;&#x7684;&#x57FA;&#x7840;&#x5C5E;&#x6027;&#x70B9;&#xFF0C;&#x518D;&#x786E;&#x8BA4;&#x4F60;&#x4EBA;&#x7269;&#x7684;&#x4E00;&#x4E9B;&#x521D;&#x59CB;&#x88C5;&#x5907;&#x548C;&#x521D;&#x59CB;&#x91D1;&#x94B1;&#x3002;</p>
<p>&#x597D;&#x7684;&#xFF0C;&#x4F60;&#x7684;&#x4EBA;&#x7269;&#x5DF2;&#x7ECF;&#x6574;&#x88C5;&#x5F85;&#x53D1;&#xFF0C;&#x51C6;&#x5907;&#x5230;&#x5947;&#x5E7B;&#x4E16;&#x754C;&#x63A2;&#x9669;&#x5E76;&#x5927;&#x5C55;&#x8EAB;&#x624B;&#x4E86;&#x3002;</p>
<p>&#x7136;&#x540E;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x73A9;&#x5462;&#xFF1F;&#x597D;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E2A;DM&#xFF08;Dungeon Master&#xFF09;&#xFF0C;&#x5730;&#x4E0B;&#x57CE;&#x57CE;&#x4E3B;&#x3002;&#x5730;&#x4E0B;&#x57CE;&#x57CE;&#x4E3B;&#x901A;&#x5E38;&#x7531;&#x719F;&#x7EC3;&#x7684;&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;&#x8001;&#x624B;&#x626E;&#x6F14;&#xFF0C;&#x5FC5;&#x987B;&#x5BF9;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x8DB3;&#x591F;&#x7684;&#x719F;&#x7EC3;&#xFF0C;&#x5E76;&#x540C;&#x65F6;&#x5E94;&#x4F7F;&#x7528;&#x53E6;&#x5916;&#x7684;&#x4E24;&#x672C;&#x4E66;&#xFF0C;<strong>&#x300A;&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;&#x57CE;&#x4E3B;&#x6307;&#x5357;&#x300B;&#x548C;&#x300A;&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;&#x602A;&#x7269;&#x56FE;&#x9274;&#x300B;</strong>&#x3002;&#x4E00;&#x672C;&#x53EB;&#x4F60;&#x600E;&#x4E48;&#x505A;&#x57CE;&#x4E3B;&#xFF0C;&#x4E00;&#x672C;&#x89C4;&#x5B9A;&#x4E86;&#x5947;&#x5E7B;&#x4E16;&#x754C;&#x4E2D;&#x7684;&#x602A;&#x7269;&#x5C5E;&#x6027;&#x3002;</p>
<p>PS&#xFF1A;&#x300A;&#x751F;&#x6D3B;&#x5927;&#x7206;&#x70B8;&#x300B;&#x7B2C;6&#x5B63;&#x7B2C;23&#x96C6;&#xFF0C;Sheldon&#x4ED6;&#x4EEC;&#x5C31;&#x5728;&#x73A9;&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;&#xFF0C;&#x800C;&#x8FD9;&#x91CC;&#x626E;&#x6F14;DM&#x7684;&#x5C31;&#x662F;Howard&#x3002;</p>
<p>&#x800C;&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#xFF0C;&#x901A;&#x4FD7;&#x70B9;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;&#x73A9;&#x5BB6;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;&#x57CE;&#x4E3B;&#x5728;&#x8FD9;&#x4E09;&#x672C;&#x4E66;&#x7684;&#x89C4;&#x5219;&#x4E2D;&#xFF0C;&#x6309;&#x7167;&#x4E25;&#x8C28;&#x7684;&#x89C4;&#x5219;&#x8FDB;&#x884C;&#x7684;&#x9760;&#x8111;&#x6D1E;&#x548C;&#x60F3;&#x8C61;&#x529B;&#x7684;&#x6E38;&#x620F;&#x3002;&#x4E0D;&#x8981;&#x89C9;&#x5F97;&#x5F88;&#x5947;&#x602A;&#xFF0C;dnd&#x73A9;&#x5BB6;&#x5F88;&#x81EA;&#x7136;&#x7684;&#x63A5;&#x53D7;&#x8FD9;&#x4E2A;&#x770B;&#x6CD5;&#xFF0C;&#x56E0;&#x4E3A;&#x7684;&#x786E;&#x662F;&#x8FD9;&#x6837;&#x3002;</p>
<p>dnd&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x7F51;&#x6E38;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x7F51;&#x6E38;&#x7684;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x5C31;&#x662F;DM&#x7684;&#x5927;&#x8111;&#xFF0C;&#x800C;&#x7F51;&#x6E38;&#x7684;&#x753B;&#x9762;&#x5C31;&#x662F;&#x73A9;&#x5BB6;&#x7684;&#x60F3;&#x8C61;&#x529B;&#x3002;&#x7531;DM&#x8D1F;&#x8D23;&#x642D;&#x5EFA;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x5947;&#x5E7B;&#x4E16;&#x754C;&#xFF0C;&#x800C;&#x4ED6;&#x8D1F;&#x8D23;&#x60F3;&#x8C61;&#x8FD9;&#x4E2A;&#x5947;&#x5E7B;&#x4E16;&#x754C;&#x7684;&#x5730;&#x56FE;&#x3001;&#x79CD;&#x65CF;&#x751F;&#x7269;&#x3001;&#x73A9;&#x5BB6;&#x906D;&#x9047;&#x7684;&#x5267;&#x60C5;&#x3001;&#x63A7;&#x5236;&#x73A9;&#x5BB6;&#x906D;&#x9047;&#x7684;&#x602A;&#x7269;&#x3001;&#x51B3;&#x5B9A;&#x5B9D;&#x7BB1;&#x6389;&#x843D;&#x7684;&#x5B9D;&#x7269;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x7B80;&#x5355;&#x70B9;&#xFF0C;DM&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x7684;&#x4E3B;&#x6301;&#x4EBA;&#xFF0C;&#x8D1F;&#x8D23;&#x7ED9;&#x73A9;&#x5BB6;&#x5E03;&#x7F6E;&#x9677;&#x9631;&#xFF0C;&#x64CD;&#x63A7;&#x602A;&#x7269;&#x3001;&#x7ED9;&#x5B9D;&#x7BB1;&#x91CC;&#x653E;&#x7F6E;&#x5B9D;&#x85CF;&#xFF0C;&#x5E03;&#x7F6E;&#x6574;&#x4E2A;&#x6E38;&#x620F;&#x7684;&#x5267;&#x60C5;&#x3002;&#x800C;&#x73A9;&#x5BB6;&#x5219;&#x626E;&#x6F14;&#x4E00;&#x4E2A;&#x63A2;&#x9669;&#x8005;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;DM&#x6784;&#x5EFA;&#x7684;&#x4E16;&#x754C;&#x5F53;&#x4E2D;&#x63A2;&#x9669;&#x3002;&#x4F60;&#x4F1A;&#x5728;&#x8FD9;&#x4E2A;&#x5947;&#x5E7B;&#x4E16;&#x754C;&#x4E2D;&#x9762;&#x4E34;&#x9009;&#x62E9;&#xFF0C;&#x906D;&#x9047;&#x602A;&#x7269;&#x3001;&#x63A2;&#x7D22;&#x5B9D;&#x85CF;&#x3001;&#x63D0;&#x5347;&#x7B49;&#x7EA7;&#x3001;&#x5B66;&#x4E60;&#x6280;&#x80FD;&#x3002;</p>
<p>&#x597D;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x8981;&#x8BF4;&#x7684;&#x662F;&#x77E5;&#x8BC6;&#x70B9;&#xFF0C;&#x662F;<strong>&#x91CD;&#x70B9;</strong>&#x3002;<strong>&#x662F;dnd&#x5728;&#x8FD9;&#x51E0;&#x5341;&#x5E74;&#x7684;&#x53D1;&#x5C55;&#x4E2D;&#x7ECF;&#x4E45;&#x4E0D;&#x8870;&#x7684;&#x9B45;&#x529B;&#x6240;&#x5728;</strong>&#xFF0C;&#x4E5F;&#x662F;&#x8FC4;&#x4ECA;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4E00;&#x6B3E;&#x7535;&#x5B50;&#x6E38;&#x620F;&#x80FD;&#x5B8C;&#x7F8E;&#x8FD8;&#x539F;dnd&#x7684;&#x539F;&#x56E0;&#x6240;&#x5728;&#x3002;</p>
<pre><code>&#x56E0;&#x4E3A;&#x6E38;&#x620F;&#x7684;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x3001;&#x6E38;&#x620F;&#x7684;&#x53CD;&#x9988;&#x662F;&#x4EBA;&#x8111;&#xFF0C;&#x800C;&#x6CA1;&#x6709;&#x7CFB;&#x7EDF;&#x548C;&#x6E38;&#x620F;&#x8BBE;&#x8BA1;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x505A;&#x4F60;&#x80FD;&#x60F3;&#x8C61;&#x5230;&#xFF0C;&#x4E14;&#x6E38;&#x620F;&#x89C4;&#x5219;&#x4E2D;&#x5141;&#x8BB8;&#x7684;&#x4EFB;&#x4F55;&#x4E8B;&#xFF0C;&#x662F;&#x7684;&#xFF0C;&#x4EFB;&#x4F55;&#x4E8B;&#x3002;
</code></pre><p>&#x4E5F;&#x8BB8;&#x4F60;&#x73B0;&#x5728;&#x8FD8;&#x6CA1;&#x6709;&#x53CD;&#x5E94;&#x8FC7;&#x6765;&#x8FD9;&#x5230;&#x5E95;&#x6709;&#x591A;&#x9177;&#xFF0C;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x4F60;&#x5728;&#x6E38;&#x620F;&#x4E2D;&#x78B0;&#x5230;&#x4E00;&#x6247;&#x95E8;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x662F;&#x5728;&#x7535;&#x5B50;&#x6E38;&#x620F;&#x4E2D;&#xFF0C;&#x4F60;&#x53EA;&#x80FD;&#x6309;&#x7167;&#x6E38;&#x620F;&#x8BBE;&#x8BA1;&#x5E08;&#x7684;&#x60F3;&#x6CD5;&#x6765;&#x6253;&#x5F00;&#x8FD9;&#x6247;&#x95E8;&#xFF0C;&#x5373;&#x4FBF;&#x4F60;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x4E2D;&#x7684;&#x65E0;&#x654C;&#x7684;&#x795E;&#x5947;&#xFF0C;&#x4F46;&#x8FD8;&#x662F;&#x8981;&#x8DD1;&#x904D;&#x5927;&#x534A;&#x4E2A;&#x5730;&#x56FE;&#x53BB;&#x83B7;&#x53D6;&#x94A5;&#x5319;&#x3002;&#x4F46;&#x662F;&#x5728;dnd&#x91CC;&#xFF0C;&#x4F60;&#x6709;&#x65E0;&#x6570;&#x7684;&#x9009;&#x62E9;&#x6765;&#x6253;&#x5F00;&#x8FD9;&#x6247;&#x95E8;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x638F;&#x51FA;&#x4F60;&#x80CC;&#x540E;&#x7684;&#x6218;&#x65A7;&#x4E00;&#x65A7;&#x5B50;&#x628A;&#x95E8;&#x7ED9;&#x5288;&#x5F00;&#x7136;&#x540E;&#x6740;&#x8FDB;&#x53BB;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x4EEC;&#x961F;&#x7684;&#x6CD5;&#x5E08;&#x4E00;&#x4E2A;&#x6CD5;&#x672F;&#x628A;&#x95E8;&#x8F70;&#x5F00;&#x7136;&#x540E;&#x6740;&#x8FDB;&#x53BB;&#xFF0C;&#x6216;&#x8005;&#x8BA9;&#x4F60;&#x4EEC;&#x961F;&#x7684;&#x76D7;&#x8D3C;&#x5C0F;&#x5FC3;&#x7FFC;&#x7FFC;&#x7684;&#x628A;&#x95E8;&#x64AC;&#x5F00;&#xFF0C;&#x7136;&#x540E;&#x5C0F;&#x5FC3;&#x7FFC;&#x7FFC;&#x7684;&#x53BB;&#x5077;&#x88AD;&#x91CC;&#x9762;&#x7684;&#x654C;&#x4EBA;&#xFF0C;&#x6216;&#x8005;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x627E;&#x901A;&#x98CE;&#x7BA1;&#x722C;&#x8FDB;&#x53BB;&#xFF0C;&#x6216;&#x8005;&#x751A;&#x81F3;&#x4E0D;&#x8FDB;&#x53BB;&#x627E;&#x522B;&#x7684;&#x8DEF;&#x3002;&#x8FD9;&#x4EC5;&#x4EC5;&#x662F;&#x65E0;&#x6570;&#x79CD;&#x9009;&#x62E9;&#x4E2D;&#x7684;&#x4E00;&#x79CD;&#x3002;</p>
<p>&#x5728;&#x522B;&#x7684;&#x6E38;&#x620F;&#x7684;&#x6218;&#x6597;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x505A;&#x4E0D;&#x51FA;&#x50CF;dnd&#x91CC;&#x8FD9;&#x79CD;&#xFF0C;&#x201C;&#x6211;&#x4E00;&#x811A;&#x628A;&#x9152;&#x5427;&#x7684;&#x684C;&#x5B50;&#x8E39;&#x7FFB;&#x7136;&#x540E;&#x8EB2;&#x5728;&#x684C;&#x5B50;&#x540E;&#x9762;&#xFF0C;&#x8FD9;&#x4E2A;&#x684C;&#x5B50;&#x53EF;&#x4EE5;&#x4E3A;&#x6211;&#x63D0;&#x4F9B;+4&#x7684;&#x9632;&#x5FA1;&#x9274;&#x5B9A;&#x52A0;&#x6210;&#x6765;&#x963B;&#x6321;&#x8FDC;&#x7A0B;&#x6B66;&#x5668;&#x7684;&#x653B;&#x51FB;&#x201D;&#x6216;&#x8005;&#x201C;&#x6211;&#x9AD8;&#x9AD8;&#x8DF3;&#x8DC3;&#x5230;&#x7A7A;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x6293;&#x4F4F;&#x9152;&#x5427;&#x9876;&#x90E8;&#x7684;&#x540A;&#x706F;&#xFF0C;&#x4ECE;&#x4E0A;&#x800C;&#x4E0B;&#x5760;&#x843D;&#x5E76;&#x7ED9;&#x4E88;&#x654C;&#x4EBA;&#x91CD;&#x51FB;&#xFF0C;&#x6253;&#x843D;&#x654C;&#x4EBA;&#x7684;&#x76FE;&#x724C;&#x201D;</p>
<pre><code>&#x81EA;&#x7531;&#x5EA6;&#xFF0C;&#x5C31;&#x662F;dnd&#x5728;&#x6F2B;&#x957F;&#x7684;&#x6E38;&#x620F;&#x957F;&#x6CB3;&#x4E2D;&#x7ECF;&#x4E45;&#x4E0D;&#x8870;&#x7684;&#x5173;&#x952E;&#x6240;&#x5728;
</code></pre><p>&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x5C31;&#x662F;&#x4F60;&#x548C;&#x5176;&#x4ED6;&#x73A9;&#x5BB6;&#xFF0C;&#x548C;DM&#xFF0C;&#x5229;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x8111;&#x6D1E;&#xFF0C;&#x4F9D;&#x9760;&#x60F3;&#x8C61;&#x529B;&#xFF0C;&#x5728;&#x5408;&#x7406;&#x7684;&#x89C4;&#x5219;&#x4E0B;&#xFF0C;&#x5229;&#x7528;&#x60F3;&#x8C61;&#x529B;&#x8FDB;&#x884C;&#x7684;&#x4E92;&#x52A8;&#x6587;&#x5B57;&#x6E38;&#x620F;&#x3002;&#x800C;&#x5927;&#x5BB6;&#x805A;&#x5728;&#x4E00;&#x8D77;&#x73A9;dnd&#x5C31;&#x88AB;&#x79F0;&#x4E4B;&#x4E3A;&#x8DD1;&#x56E2;&#x3002;</p>
<p>&#x6709;&#x4E9B;&#x4EBA;&#x4EAB;&#x53D7;&#x6E38;&#x620F;&#x4E2D;&#x6218;&#x6597;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x4EEC;&#x4F1A;&#x5F00;&#x4E00;&#x4E9B;&#x4E3B;&#x8981;&#x4EE5;&#x6253;&#x602A;&#x5F00;&#x5B9D;&#x7BB1;&#x4E3A;&#x76EE;&#x7684;&#x7684;&#x7B80;&#x5355;&#x66B4;&#x529B;&#x7684;&#x66B4;&#x529B;&#x56E2;&#xFF0C;&#x8FD9;&#x5E2E;&#x4EBA;&#x7684;&#x6E38;&#x620F;&#x98CE;&#x683C;&#x5C31;&#x662F;&#x8E22;&#x95E8;&#x5C31;&#x662F;&#x5E72;&#xFF1B;&#x6709;&#x4E9B;&#x4EBA;&#x4ED6;&#x4EEC;&#x559C;&#x6B22;&#x4EAB;&#x53D7;&#x5728;&#x5F02;&#x4E16;&#x754C;&#x4E2D;&#x63A2;&#x9669;&#x90A3;&#x4E9B;&#x7CBE;&#x5F69;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x5C55;&#x5F00;&#x5267;&#x60C5;&#x65F6;&#x8111;&#x6D1E;&#x90FD;&#x4F1A;&#x6BD4;&#x8F83;&#x5927;&#xFF0C;&#x5C31;&#x662F;&#x4EE5;&#x5267;&#x60C5;&#x4E3A;&#x76EE;&#x7684;&#x7684;&#x56E2;&#xFF0C;&#x8FD9;&#x8FD9;&#x79CD;&#x56E2;&#x91CC;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x67D0;&#x4E2A;&#x73A9;&#x5BB6;&#x628A;&#x6700;&#x7EC8;BOSS&#x7684;&#x5973;&#x513F;&#x7ED9;&#x5A36;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x6311;&#x62E8;&#x4ED6;&#x4E24;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x8BA9;&#x4ED6;&#x5973;&#x513F;&#x5728;&#x4ED6;&#x5403;&#x996D;&#x65F6;&#x4E0B;&#x836F;&#x7136;&#x540E;&#x4E0D;&#x6218;&#x800C;&#x80DC;&#x7684;&#x72D7;&#x8840;&#x5267;&#x60C5;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EBA;&#x7684;&#x8DD1;&#x56E2;&#x8BB0;&#x5F55;&#x6709;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x62FF;&#x5C0F;&#x8BF4;&#x6765;&#x770B;&#xFF08;&#x300A;&#x9F99;&#x67AA;&#x7F16;&#x5E74;&#x53F2;&#x300B;&#xFF09;</p>
<p>&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x6709;&#x89C4;&#x5219;&#xFF0C;&#x6709;&#x5F88;&#x4E25;&#x8C28;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x73A9;&#x5BB6;&#x8981;&#x5FC5;&#x987B;&#x901A;&#x8BFB;&#x300A;&#x73A9;&#x5BB6;&#x624B;&#x518C;&#x300B;&#x7684;&#x539F;&#x56E0;&#xFF08;&#x5176;&#x5B9E;&#x53EF;&#x4EE5;&#x4E00;&#x8FB9;&#x73A9;&#x4E00;&#x8FB9;&#x67E5;&#x7684;&#xFF09;</p>
<p>&#x521B;&#x5EFA;&#x4EBA;&#x7269;&#x65F6;&#x6709;&#x516D;&#x5927;&#x5C5E;&#x6027;&#xFF1A;&#x529B;&#x91CF;&#x3001;&#x654F;&#x6377;&#x3001;&#x4F53;&#x8D28;&#x3001;&#x667A;&#x529B;&#x3001;&#x611F;&#x77E5;&#x548C;&#x9B45;&#x529B;&#xFF0C;&#x800C;&#x4E14;&#x4E66;&#x4E2D;&#x8BBE;&#x5B9A;&#x4E86;&#x4F60;&#x6240;&#x6709;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x7684;&#x79CD;&#x65CF;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5B66;&#x4E60;&#x7684;&#x6280;&#x80FD;&#x548C;&#x4E13;&#x957F;&#xFF0C;&#x6240;&#x6709;&#x6B66;&#x5668;&#x548C;&#x9053;&#x5177;&#x7684;&#x5C5E;&#x6027;&#x548C;&#x6548;&#x679C;&#xFF0C;&#x5305;&#x62EC;&#x6CD5;&#x672F;&#x5217;&#x8868;&#x3002;&#x602A;&#x7269;&#x7684;&#x5C5E;&#x6027;&#x548C;&#x653B;&#x51FB;&#x624B;&#x6BB5;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x8981;&#x63ED;&#x5F00;&#x5728;&#x6587;&#x7AE0;&#x5F00;&#x5934;&#x90A3;&#x4E2A;&#x5C0F;&#x9AB0;&#x5B50;&#x7684;&#x771F;&#x6B63;&#x4F5C;&#x7528;&#x4E86;&#x3002;&#x9AB0;&#x5B50;&#x62C5;&#x5F53;&#x4E86;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x7684;&#x6838;&#x5FC3;&#x7CFB;&#x7EDF;D20&#x7CFB;&#x7EDF;&#x3002;&#x9AB0;&#x5B50;&#x662F;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x4E2D;&#x7684;&#x968F;&#x673A;&#x62C5;&#x5F53;&#xFF0C;&#x4F60;&#x4E0D;&#x4EC5;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x9AB0;&#x5B50;&#xFF0C;&#x800C;&#x662F;&#x4E03;&#x4E2A;&#x4E00;&#x7EC4;&#x7684;&#x9AB0;&#x5B50;&#xFF0C;&#x5206;&#x522B;&#x4E3A;D4&#x3001;D6&#x3001;D8&#x3001;&#x4E24;&#x4E2A;D10(&#x5373;D100)&#x3001;D12&#x4EE5;&#x53CA;D20&#x3002;&#x8FD9;&#x4E2A;&#x4F53;&#x7CFB;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x7684;&#x7406;&#x89E3;&#x8840;&#x7EDF;&#x9274;&#x5B9A;&#xFF0C;&#x5F53;&#x4F60;&#x60F3;&#x505A;&#x4E00;&#x4E9B;&#x4F60;&#x76EE;&#x524D;&#x80FD;&#x529B;&#x65E0;&#x6CD5;&#x505A;&#x5230;&#x662F;&#x4E8B;&#x60C5;&#x65F6;&#xFF0C;&#x901A;&#x8FC7;&#x9AB0;&#x5B50;&#x53EF;&#x4EE5;&#x5E2E;&#x4F60;&#x505A;&#x5230;&#x3002;&#x662F;&#x975E;&#x6D32;&#x4EBA;&#x8FD8;&#x662F;&#x6B27;&#x6D32;&#x4EBA;&#x5462;&#xFF1F;</p>
<h2 id="dnd&#x7684;&#x5F71;&#x54CD;"><a href="#dnd&#x7684;&#x5F71;&#x54CD;" class="headerlink" title="dnd&#x7684;&#x5F71;&#x54CD;"></a>dnd&#x7684;&#x5F71;&#x54CD;</h2><p>&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x5728;&#x8FD1;&#x4EE3;&#x4EBA;&#x7C7B;&#x6587;&#x5316;&#x53F2;&#x4E0A;&#x7684;&#x5F71;&#x54CD;&#x53EF;&#x6BD4;&#x4F60;&#x60F3;&#x8C61;&#x7684;&#x5927;&#x591A;&#x4E86;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;&#x5C06;&#x684C;&#x6E38;&#x7684;&#x4E3B;&#x6D41;&#x65B9;&#x5411;&#x4ECE;War-Games&#x6218;&#x68CB;&#x6E38;&#x620F;&#x8F6C;&#x53D8;&#x6210;&#x4E86;TRPG&#x684C;&#x9762;&#x89D2;&#x8272;&#x626E;&#x6F14;&#x6E38;&#x620F;&#x3002;&#x5C3D;&#x7BA1;&#x73B0;&#x5728;&#x63D0;&#x5230;TRPG&#x7684;&#x65F6;&#x5019;&#x4F60;&#x8FD8;&#x662F;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5C06;TRPG&#x4E0E;dnd&#x7B49;&#x540C;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x522B;&#x7684;TRPG&#x4F5C;&#x54C1;&#x3002;&#x4F60;&#x4E5F;&#x6CE8;&#x610F;&#x5230;&#x4E86;RPG&#x8FD9;&#x4E2A;&#x8BCD;&#x2013;&#x89D2;&#x8272;&#x626E;&#x6F14;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#x8FD9;&#x662F;&#x4EBA;&#x7C7B;&#x7684;&#x6E38;&#x620F;&#x53F2;&#x4E0A;&#x7B2C;&#x4E00;&#x6B21;&#x5C06;&#x73A9;&#x5BB6;&#x72E0;&#x5FC3;&#x653E;&#x5728;&#x4E86;&#x201C;&#x626E;&#x6F14;&#x4E00;&#x4E2A;&#x89D2;&#x8272;&#x201D;&#x4E0A;&#xFF0C;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x5C06;&#x626E;&#x6F14;&#x8FD9;&#x79CD;&#x72EC;&#x7279;&#x7684;&#x4E50;&#x8DA3;&#x53D1;&#x5C55;&#x51FA;&#x6765;&#x7684;&#x6E38;&#x620F;&#x3002;&#x4ECE;&#x8FD9;&#x4E2A;&#x89D2;&#x5EA6;&#x4E0A;&#x6765;&#x8BB2;&#xFF0C;&#x73B0;&#x5728;&#x7684;&#x4EFB;&#x4F55;RPG&#x6E38;&#x620F;&#x751A;&#x81F3;MMORPG&#x6E38;&#x620F;&#x90FD;&#x8981;&#x53EB;&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;&#x4E00;&#x58F0;&#x7956;&#x5E08;&#x7237;&#x3002;</p>
<p>dnd&#x7ED9;&#x5F53;&#x65F6;&#x4E43;&#x81F3;&#x73B0;&#x5728;&#x7684;RPG&#x7535;&#x5B50;&#x6E38;&#x620F;&#x65E2;&#x5B9A;&#x4E86;&#x5F88;&#x591A;&#x5927;&#x81F4;&#x7684;&#x6846;&#x67B6;&#x3002;&#x6389;&#x843D;&#x7CFB;&#x7EDF;&#x3001;&#x6B66;&#x5668;&#x88C5;&#x5907;&#x7CFB;&#x7EDF;&#x3001;&#x5546;&#x5E97;&#x7CFB;&#x7EDF;&#x3001;&#x804C;&#x4E1A;&#x7CFB;&#x7EDF;&#x3001;&#x5730;&#x4E0B;&#x57CE;&#x7CFB;&#x7EDF;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x559C;&#x6B22;&#x73A9;dnd&#x7684;nerd&#x51E0;&#x4E4E;&#x662F;&#x65E9;&#x671F;&#x5317;&#x7F8E;&#x6E38;&#x620F;&#x754C;&#x7684;&#x652F;&#x67F1;&#xFF0C;&#x800C;&#x4ED6;&#x4EEC;&#x5BF9;&#x6574;&#x4E2A;&#x6E38;&#x620F;&#x754C;&#x7684;&#x98CE;&#x5411;&#x548C;&#x5BA1;&#x7F8E;&#x7684;&#x5F71;&#x54CD;&#x6301;&#x7EED;&#x81F3;&#x4ECA;</p>
<p>dnd&#x7684;&#x8FD9;&#x79CD;&#x8BBE;&#x5B9A;&#xFF0C;&#x4E0D;&#x53EA;&#x662F;&#x5F71;&#x54CD;&#x5230;&#x4E86;&#x6E38;&#x620F;&#x754C;&#xFF0C;&#x8FD8;&#x5F71;&#x54CD;&#x5230;&#x4E86;&#x5F71;&#x89C6;&#x754C;&#x3001;&#x6587;&#x5B66;&#x754C;&#x3001;&#x6F2B;&#x753B;&#x754C;&#x3002;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x8BB2;&#xFF0C;&#x73B0;&#x5728;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x4F5C;&#x54C1;&#x91CC;&#x53EA;&#x8981;&#x6709;&#x201C;&#x5251;&#x4E0E;&#x9B54;&#x6CD5;&#x201D;&#x3001;&#x201C;&#x5404;&#x79CD;&#x804C;&#x4E1A;&#x201D;&#x751A;&#x81F3;&#x201C;&#x89D2;&#x8272;&#x626E;&#x6F14;&#x201D;&#x7B49;&#x76F8;&#x5173;&#x5B57;&#x6837;&#x7684;&#x90FD;&#x501F;&#x9274;&#x4E86;dnd</p>
<p>dnd&#x5F00;&#x521B;&#x4E86;&#x4E00;&#x79CD;&#x7B80;&#x5355;&#x6709;&#x6548;&#x7684;&#x521B;&#x9020;&#x54F2;&#x5B66;&#xFF0C;&#x5F00;&#x521B;&#x4E86;&#x5728;&#x8FDB;&#x884C;&#x4E16;&#x754C;&#x8BBE;&#x5B9A;&#x65F6;&#x7684;&#x501F;&#x53E3;&#x901A;&#x7528;&#x5316;&#xFF0C;&#x7ED9;&#x65E0;&#x6570;&#x7684;&#x521B;&#x4F5C;&#x8005;&#x5E26;&#x6765;&#x4E86;&#x7075;&#x611F;&#xFF0C;&#x540C;&#x65F6;&#x5F71;&#x54CD;&#x4E86;&#x6E38;&#x620F;&#x6570;&#x636E;&#x5316;&#x4E0A;&#x7684;&#x8868;&#x73B0;&#x3002;&#x5C5E;&#x6027;&#x5F71;&#x54CD;&#x52A0;&#x7B80;&#x5355;&#x968F;&#x673A;&#x7684;&#x6A21;&#x578B;&#x3001;&#x51CF;&#x4F24;&#x7CFB;&#x7EDF;&#x3001;&#x5148;&#x653B;&#x5224;&#x5B9A;&#x7B49;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x5728;&#x521B;&#x4F5C;&#x548C;&#x5F71;&#x54CD;&#x5C42;&#x9762;&#x4E0A;&#x7684;dnd&#x4E0D;&#x662F;&#x4E00;&#x6B3E;&#x6E38;&#x620F;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x6B3E;&#x6E38;&#x620F;&#x5F15;&#x64CE;&#xFF0C;&#x65E0;&#x5173;&#x7A0B;&#x5E8F;&#x3001;&#x7F8E;&#x5DE5;&#x3001;&#x5267;&#x60C5;&#x7684;&#x6E38;&#x620F;&#x5F15;&#x64CE;&#x3002;</p>
<hr>
<p><strong>&#x9F99;&#x4E0E;&#x5730;&#x4E0B;&#x57CE;&#x7684;&#x6545;&#x4E8B;&#x548C;&#x6E38;&#x620F;&#x4E2D;&#x4E2D;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x9F99;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x5730;&#x4E0B;&#x57CE;&#xFF0C;&#x4F46;&#x662F;&#x53D6;&#x800C;&#x4EE3;&#x4E4B;&#x7684;&#x662F;&#x65E0;&#x9650;&#x7684;&#x53EF;&#x80FD;&#x3002;</strong></p>
<hr>

      
    </div><!-- .entry-content -->

    <footer class="entry-meta">
    <a href="/2016/11/13/带你进入龙与地下城的世界/">
    <time datetime="2016-11-13T03:47:49.000Z" class="entry-date">
        2016-11-13
    </time>
</a>
    
  <span class="article-delim">&#8226;</span>
  <div class="article-category">
  <a class="article-category-link" href="/categories/御宅文化/">御宅文化</a>
  </div>

    
    </footer>
</article>


    
<nav class="nav-single">
    <h3 class="assistive-text">文章导航</h3>
    
        <span class="nav-previous"><a href="/2016/11/14/从零开始学习Linux-8/" rel="prev"><span class="meta-nav">←</span> 从零开始学习Linux-8</a></span>
    
    
        <span class="nav-next"><a href="/2016/11/12/普通二叉树基础C实现/" rel="next">普通二叉树基础函数C语言实现 <span class="meta-nav">→</span></a></span>
    
</nav><!-- .nav-single -->







</div></div>
        <div id="secondary" class="widget-area" role="complementary">
  
    <aside id="search" class="widget widget_search"><form role="search" method="get" accept-charset="utf-8" id="searchform" class="searchform" action="//google.com/search">
    <div>
        <input type="text" value="" name="s" id="s" />
        <input type="submit" id="searchsubmit" value="搜索" />
    </div>
</form></aside>
  
    
  
    
  <aside class="widget">
    <h3 class="widget-title">Categories</h3>
    <div class="widget-content">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/LIFE/">LIFE</a><span class="category-list-count">3</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/MAC/">MAC</a><span class="category-list-count">3</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/iOS/">iOS</a><span class="category-list-count">20</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/御宅文化/">御宅文化</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/机器学习/">机器学习</a><span class="category-list-count">6</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/编程/">编程</a><span class="category-list-count">55</span></li></ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Recents</h3>
    <div class="widget-content">
      <ul>
        
          <li>
            <a href="/2016/12/13/Machine-Learning-6/">Machine-Learning-6</a>
          </li>
        
          <li>
            <a href="/2016/12/10/Machine-Learning-5/">Machine-Learning-5</a>
          </li>
        
          <li>
            <a href="/2016/12/07/Machine-Learning-4/">Machine-Learning-4</a>
          </li>
        
          <li>
            <a href="/2016/11/29/Machine-Learning-3/">Machine-Learning-3</a>
          </li>
        
          <li>
            <a href="/2016/11/26/Machine-Learning-2/">Machine-Learning-2</a>
          </li>
        
      </ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Tags</h3>
    <div class="widget-content">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/Cocoapods/">Cocoapods</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/HTML/">HTML</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Linux/">Linux</a><span class="tag-list-count">15</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Machine-Learning/">Machine Learning</a><span class="tag-list-count">6</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Matlab/">Matlab</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/MySQL/">MySQL</a><span class="tag-list-count">3</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIColor/">UIColor</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView/">UIView</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView-圆角/">UIView-圆角</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Vim/">Vim</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/bug/">bug</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/hexo/">hexo</a><span class="tag-list-count">4</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/指针/">指针</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/数据结构/">数据结构</a><span class="tag-list-count">20</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/算法/">算法</a><span class="tag-list-count">8</span></li></ul>
    </div>
  </aside>

  
    
<div class="widget tag">
<h3 class="title">blogroll</h3>
<ul class="entry">


<li><a href="https://github.com/" target="_blank">github</a></li>


<li><a href="http://www.jianshu.com/users/41cd7711ed44/latest_articles" target="_blank">我的简书主页</a></li>

</ul>
</div>

  
</div>
      </div>
      <footer id="colophon" role="contentinfo">
    <p>&copy; 2016 SaberDa
    All rights reserved.</p>
    <p>Powered by <a href="http://hexo.io/" target="_blank">Hexo</a></p>
</footer>
    <script>window._bd_share_config={"common":{"bdSnsKey":{},"bdText":"","bdMini":"1","bdMiniList":false,"bdPic":"","bdStyle":"2","bdSize":"16"},"share":{}};with(document)0[(getElementsByTagName('head')[0]||body).appendChild(createElement('script')).src='http://bdimg.share.baidu.com/static/api/js/share.js?v=89860593.js?cdnversion='+~(-new Date()/36e5)];</script>

<script src="/js/jquery-2.0.3.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

<script src="/js/navigation.js"></script>

<div id="bg"></div>

  </div>
</body>
</html>