<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  
  <meta name="description" content="阿尔托利亚是我老婆~" />
  

  
  
  
  
  
  
  <title>Legend 2016 | SaberDa的幻想乡</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x7AD9;&amp;#x5728;2016&amp;#x7684;&amp;#x5C3D;&amp;#x5934;&amp;#xFF0C;&amp;#x770B;&amp;#x5411;2016&amp;#x4F0A;&amp;#x59CB;&amp;#x65F6;&amp;#x7684;&amp;#x81EA;&amp;#x5DF1;&amp;#xFF0C;&amp;#x4ED6;&amp;#x53D8;&amp;#x4E86;&amp;#x597D;&amp;#x591A;&amp;#x554A;&amp;#x3002;

&amp;#x4E00;&amp;#x4E2">
<meta property="og:type" content="article">
<meta property="og:title" content="Legend 2016">
<meta property="og:url" content="https://saberda.github.io/2016/12/31/2016年终总结/index.html">
<meta property="og:site_name" content="SaberDa的幻想乡">
<meta property="og:description" content="&amp;#x7AD9;&amp;#x5728;2016&amp;#x7684;&amp;#x5C3D;&amp;#x5934;&amp;#xFF0C;&amp;#x770B;&amp;#x5411;2016&amp;#x4F0A;&amp;#x59CB;&amp;#x65F6;&amp;#x7684;&amp;#x81EA;&amp;#x5DF1;&amp;#xFF0C;&amp;#x4ED6;&amp;#x53D8;&amp;#x4E86;&amp;#x597D;&amp;#x591A;&amp;#x554A;&amp;#x3002;

&amp;#x4E00;&amp;#x4E2">
<meta property="og:updated_time" content="2016-12-31T13:01:25.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Legend 2016">
<meta name="twitter:description" content="&amp;#x7AD9;&amp;#x5728;2016&amp;#x7684;&amp;#x5C3D;&amp;#x5934;&amp;#xFF0C;&amp;#x770B;&amp;#x5411;2016&amp;#x4F0A;&amp;#x59CB;&amp;#x65F6;&amp;#x7684;&amp;#x81EA;&amp;#x5DF1;&amp;#xFF0C;&amp;#x4ED6;&amp;#x53D8;&amp;#x4E86;&amp;#x597D;&amp;#x591A;&amp;#x554A;&amp;#x3002;

&amp;#x4E00;&amp;#x4E2">
  
  
    <link rel="icon" href="/css/images/favicon.ico">
  
  <link rel="stylesheet" href="/css/style.css">
  

  
  <!-- baidu webmaster push -->
  <script src='//push.zhanzhang.baidu.com/push.js'></script>
</head>
<body class="home blog custom-background custom-font-enabled single-author">
  <div id="page" class="hfeed site">
      <header id="masthead" class="site-header" role="banner">
    <hgroup>
      <h1 class="site-title">
        <a href="/" title="SaberDa的幻想乡" rel="home">SaberDa的幻想乡</a>
      </h1>
      
        <h2 class="site-description">
          <a href="/" id="subtitle">　　iOS　　|　　二次元　　|　　630991493@qq.com　　|　　我生而坚强 只要不死 就能笑的猖狂</a>
        </h2>
      
    </hgroup>

    <nav id="site-navigation" class="main-navigation" role="navigation">
            <button class="menu-toggle">菜单</button>
            <a class="assistive-text" href="/#content" title="跳至内容">跳至内容</a><!--TODO-->
            <div class="menu-main-container">
                <ul id="menu-main" class="nav-menu">
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/archives">所有文章</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/">主页</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/编程/">编程</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/iOS/">iOS</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/机器学习/">机器学习</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/MAC/">MAC</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/御宅文化/">御宅文化</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/LIFE/">LIFE</a></li>
                
                </ul>
            </div>
    </nav>
</header>
      <div id="main" class="wrapper">
        <div id="primary" class="site-content"><div id="content" role="main"><article id="post-2016年终总结" class="post-2016年终总结 post type-post status-publish format-standard hentry">
    <!---->

      <header class="entry-header">
        
        
  
    <h1 class="entry-title article-title">
      Legend 2016
    </h1>
  

        
        <div class="comments-link">
            
            <a href="javascript:void(0);" data-url="https://saberda.github.io/2016/12/31/2016年终总结/" data-id="cixd8d73l000098b3aldkn5e0" class="leave-reply bdsharebuttonbox" data-cmd="more">Share</a>
        </div><!-- .comments-link -->
      </header><!-- .entry-header -->

    <div class="entry-content">
      
        <pre><code>&#x7AD9;&#x5728;2016&#x7684;&#x5C3D;&#x5934;&#xFF0C;&#x770B;&#x5411;2016&#x4F0A;&#x59CB;&#x65F6;&#x7684;&#x81EA;&#x5DF1;&#xFF0C;&#x4ED6;&#x53D8;&#x4E86;&#x597D;&#x591A;&#x554A;&#x3002;

&#x4E00;&#x4E2A;&#x6691;&#x5047;&#xFF0C;&#x5C06;&#x6211;&#x7684;2016&#x5212;&#x5206;&#x6210;&#x4E86;&#x4E24;&#x90E8;&#x5206;&#xFF1A;&#x4E0A;&#x534A;&#x5E74;&#x73A9;&#x5F97;&#x75AF;&#x72C2;&#xFF0C;&#x4E0B;&#x534A;&#x5E74;&#x5B66;&#x7684;&#x75AF;&#x72C2;

&#x8FD8;&#x6709;&#xFF0C;&#x83AB;&#x540D;&#x88AB;&#x7EED;&#x4E86;&#x597D;&#x51E0;&#x79D2;&#x7684;&#x540C;&#x65F6;&#x4E0D;&#x77E5;&#x9053;&#x7EED;&#x4E86;&#x591A;&#x5C11;&#x79D2;
</code></pre><a id="more"></a>    
<h2 id="&#x4E0A;&#x534A;&#x5E74;"><a href="#&#x4E0A;&#x534A;&#x5E74;" class="headerlink" title="&#x4E0A;&#x534A;&#x5E74;"></a>&#x4E0A;&#x534A;&#x5E74;</h2><p>&#x63A5;&#x89E6;&#x4E86;&#x9B54;&#x517D;&#x4E16;&#x754C;&#x8FD9;&#x4E2A;&#x4F20;&#x5947;&#x7684;&#x6E38;&#x620F;&#x3002;&#x4ECE;1&#x5230;100&#xFF0C;&#x6BCF;&#x5929;&#x8DD1;&#x4EFB;&#x52A1;&#x5237;&#x526F;&#x672C;&#x770B;&#x98CE;&#x666F;&#x4E86;&#x89E3;&#x9B54;&#x517D;&#x5267;&#x60C5;&#x4EBA;&#x6587;&#xFF1B;100&#x540E;&#x7684;&#x9B54;&#x517D;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x6E38;&#x620F;&#xFF0C;&#x6C89;&#x8FF7;&#x4E8E;&#x5DE5;&#x4F1A;&#x56E2;&#x672C;&#x3002;&#x4F60;&#x4E0D;&#x4EB2;&#x8EAB;&#x7ECF;&#x5386;&#xFF0C;&#x662F;&#x65E0;&#x6CD5;&#x4F53;&#x4F1A;&#x5230;&#x88AB;&#x56E2;&#x706D;n&#x6B21;&#x540E;&#x7A81;&#x7136;&#x8FC7;&#x4E86;&#x7684;&#x90A3;&#x79CD;&#x5174;&#x594B;&#xFF0C;&#x662F;&#x65E0;&#x6CD5;&#x4F53;&#x4F1A;&#x7206;&#x51FA;&#x4E86;&#x5FC3;&#x4EEA;&#x5DF2;&#x4E45;&#x7684;&#x88C5;&#x5907;&#x90A3;&#x79CD;&#x559C;&#x60A6;&#x3002;</p>
<p>&#x4E5F;&#x56E0;&#x6B64;&#xFF0C;&#x4E0A;&#x534A;&#x5E74;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5927;&#x4E00;&#x4E0B;&#xFF0C;&#x57FA;&#x672C;&#x4EC0;&#x4E48;&#x90FD;&#x6CA1;&#x6709;&#x505A;&#xFF0C;iOS&#x4E5F;&#x53D8;&#x5F97;&#x534A;&#x770B;&#x4E0D;&#x770B;&#xFF0C;&#x671F;&#x672B;&#x524D;&#x7A81;&#x51FB;&#x4E86;&#x4E24;&#x5468;&#x6DF7;&#x4E86;&#x4E2A;&#x5956;&#x5B66;&#x91D1;&#x3002;&#x671F;&#x95F4;&#x88AB;&#x7A81;&#x7136;&#x94A6;&#x5B9A;&#x4E3A;&#x9662;&#x79D1;&#x534F;&#x4E3B;&#x5E2D;&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x5C31;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x4E86;&#x3002;</p>
<p>&#x7528;&#x4E00;&#x53E5;&#x8BDD;&#x603B;&#x7ED3;&#x4E0A;&#x534A;&#x5E74;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x662F;&#x2013;<strong>&#x6B64;&#x751F;&#x65E0;&#x6094;&#x5165;&#x9B54;&#x517D;</strong></p>
<h2 id="&#x6691;&#x5047;"><a href="#&#x6691;&#x5047;" class="headerlink" title="&#x6691;&#x5047;"></a>&#x6691;&#x5047;</h2><p>&#x8FD9;&#x4E2A;&#x6691;&#x5047;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x8F6C;&#x6298;&#x70B9;&#x3002;</p>
<p>&#x4F60;&#x4E0D;&#x51FA;&#x53BB;&#x770B;&#x770B;&#xFF0C;&#x6C38;&#x8FDC;&#x4E0D;&#x77E5;&#x9053;&#x5916;&#x9762;&#x7684;&#x4E16;&#x754C;&#x6709;&#x591A;&#x7F8E;&#x597D;&#x3002;&#x6691;&#x5047;&#x7684;&#x8FD9;&#x6B21;&#x6B27;&#x6D32;&#x81EA;&#x7531;&#x884C;&#xFF0C;&#x575A;&#x5B9A;&#x4E86;&#x6211;&#x5C06;&#x6765;&#x51FA;&#x56FD;&#x7684;&#x51B3;&#x5FC3;&#x3002;</p>
<p>&#x8C08;&#x8D77;&#x8FD9;&#x6B21;&#x6B27;&#x6D32;&#x4E4B;&#x65C5;&#xFF0C;&#x8FD8;&#x662F;&#x5F88;&#x68D2;&#x7684;&#x3002;&#x8D70;&#x904D;&#x4E86;&#x5A01;&#x5C3C;&#x65AF;&#x7684;&#x53CC;&#x5C9B;&#xFF0C;&#x7528;&#x53CC;&#x811A;&#x5F81;&#x670D;&#x4E86;&#x7F57;&#x9A6C;&#xFF0C;&#x57FA;&#x672C;&#x6E38;&#x904D;&#x4E86;&#x897F;&#x6B27;&#x5404;&#x56FD;&#xFF0C;&#x4F53;&#x9A8C;&#x5230;&#x4E86;&#x5404;&#x56FD;&#x7F8E;&#x98DF;&#xFF0C;&#x987A;&#x4FBF;&#x5B8C;&#x6210;&#x4E86;&#x5F88;&#x591A;&#x7684;&#x4EBA;&#x751F;&#x7684;&#x7B2C;&#x4E00;&#x6B21;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x548C;&#x6CD5;&#x56FD;&#x59D1;&#x5A18;&#x5408;&#x5F71;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x4F4F;&#x6C11;&#x5BBF;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x5C1D;&#x5230;&#x6B63;&#x5B97;&#x7684;&#x610F;&#x5927;&#x5229;&#x9762;&#x4E0E;&#x62AB;&#x8428;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x5750;&#x6C34;&#x4E0A;&#x51FA;&#x79DF;&#x2026;</p>
<p>&#x5F53;&#x65F6;&#x539F;&#x8BA1;&#x5212;&#x662F;&#x540C;&#x6B65;&#x4E00;&#x4E2A;&#x6B27;&#x6D32;&#x6E38;&#x8BB0;&#x6765;&#x7740;&#xFF0C;&#x7ED3;&#x679C;&#x53EA;&#x540C;&#x6B65;&#x4E86;&#x7B2C;&#x4E00;&#x5929;&#xFF0C;&#x4E4B;&#x540E;&#x7531;&#x4E8E;&#x79CD;&#x79CD;&#x539F;&#x56E0;&#x4E00;&#x76F4;&#x62D6;&#x5230;&#x4E86;&#x73B0;&#x5728;&#x8FD8;&#x6CA1;&#x6709;&#x5199;&#xFF0C;&#x62D6;&#x5EF6;&#x75C7;&#x665A;&#x671F;&#x4E86;2333</p>
<h2 id="&#x4E0B;&#x534A;&#x5E74;"><a href="#&#x4E0B;&#x534A;&#x5E74;" class="headerlink" title="&#x4E0B;&#x534A;&#x5E74;"></a>&#x4E0B;&#x534A;&#x5E74;</h2><p>&#x6B63;&#x5982;&#x5F00;&#x5934;&#x6240;&#x8A00;&#xFF0C;&#x4E0B;&#x534A;&#x5E74;&#x5B66;&#x7684;&#x75AF;&#x72C2;&#x3002;&#x56DE;&#x56FD;&#x540E;&#xFF0C;&#x6709;&#x4E86;&#x65B0;&#x7684;&#x76EE;&#x6807;&#x4E5F;&#x6709;&#x4E86;&#x65B0;&#x7684;&#x52A8;&#x529B;&#x3002;&#x540C;&#x65F6;&#x53D1;&#x73B0;&#x56E0;&#x4E3A;&#x4E0A;&#x534A;&#x5E74;&#x7684;&#x8352;&#x5E9F;&#xFF0C;&#x81EA;&#x5DF1;&#x4E0E;&#x522B;&#x4EBA;&#x843D;&#x4E0B;&#x7684;&#x592A;&#x591A;&#x592A;&#x591A;&#x3002;&#x4E8E;&#x662F;&#x5F00;&#x59CB;&#x5F3A;&#x8FEB;&#x81EA;&#x5DF1;&#xFF0C;&#x6BCF;&#x5929;&#x4E0D;&#x53EF;&#x4EE5;&#x6709;&#x95F2;&#x7740;&#x7684;&#x65F6;&#x5019;&#x3002;</p>
<p>&#x5F00;&#x5B66;&#x7684;&#x524D;&#x4E24;&#x4E2A;&#x6708;&#xFF0C;&#x8FC7;&#x4E86;&#x4E00;&#x904D;GRE&#x5355;&#x8BCD;&#xFF0C;&#x65E0;&#x5DE7;&#x4E0D;&#x6210;&#x4E66;&#x5427;&#xFF0C;&#x8FD9;&#x4E3A;&#x6211;&#x540E;&#x9762;&#x6253;&#x4E0B;&#x4E86;&#x826F;&#x597D;&#x7684;&#x5355;&#x8BCD;&#x57FA;&#x7840;&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x6708;&#x8FC7;&#x5F97;&#x53EF;&#x8C13;&#x76F8;&#x5F53;&#x9ED1;&#x6697;&#xFF0C;&#x767D;&#x5929;&#x9664;&#x4E86;&#x4E0A;&#x8BFE;&#x65F6;&#x95F4;&#x5916;&#x57FA;&#x672C;&#x90FD;&#x5728;&#x56FE;&#x4E66;&#x9986;&#x5543;&#x5355;&#x8BCD;&#x4E66;&#xFF0C;&#x665A;&#x4E0A;&#x53BB;&#x6559;&#x5B66;&#x697C;&#x80CC;&#x5230;&#x5341;&#x70B9;&#x534A;&#x4E4B;&#x540E;&#x56DE;&#x5BDD;&#x5BA4;&#x7B80;&#x5355;&#x6536;&#x62FE;&#x6536;&#x62FE;&#xFF0C;&#x5C31;&#x4E0A;&#x5E8A;&#x5F00;&#x59CB;&#x6572;&#x4EE3;&#x7801;&#x770B;&#x6587;&#x6863;&#x3002;</p>
<p>&#x8FD9;&#x6BB5;&#x671F;&#x95F4;&#x786C;&#x751F;&#x751F;&#x7684;&#x4F7F;&#x6211;&#x517B;&#x6210;&#x4E86;&#x51CC;&#x6668;&#x4E24;&#x70B9;&#x7761;&#x65E9;&#x4E0A;&#x4E03;&#x70B9;&#x9192;&#x7684;&#x751F;&#x7269;&#x949F;&#xFF0C;&#x4E00;&#x76F4;&#x5230;&#x73B0;&#x5728;&#x4E00;&#x70B9;&#x524D;&#x4E00;&#x70B9;&#x56F0;&#x610F;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x65E9;&#x4E0A;&#x52A8;&#x4E0D;&#x52A8;&#x5C31;&#x4E03;&#x70B9;&#x591A;&#x81EA;&#x7136;&#x9192;&#x3002;&#x6709;&#x4ED8;&#x51FA;&#x5FC5;&#x5B9A;&#x4F1A;&#x6709;&#x6536;&#x83B7;&#xFF0C;&#x9664;&#x4E86;&#x5C06;&#x6211;&#x7684;&#x5355;&#x8BCD;&#x50A8;&#x91CF;&#x6307;&#x6570;&#x7FFB;&#x500D;&#x540E;&#xFF0C;&#x671F;&#x95F4;&#x5B8C;&#x6210;&#x4E86;&#x4E00;&#x6B21;&#x5BF9;&#x54D4;&#x54E9;&#x54D4;&#x54E9;iOS&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x9AD8;&#x4EFF;&#xFF0C;&#x8FD8;&#x5BF9;C++&#x3001;python&#x7684;&#x638C;&#x63E1;&#x66F4;&#x4E0A;&#x4E86;&#x4E00;&#x5C42;&#x697C;&#x3002;</p>
<p>&#x5341;&#x4E00;&#x671F;&#x95F4;&#x521D;&#x4E2D;&#x6B7B;&#x515A;&#x6765;&#x627E;&#x6211;&#x73A9;&#xFF0C;&#x82B1;&#x4E86;5&#x5929;&#x7684;&#x65F6;&#x95F4;&#x57FA;&#x672C;&#x901B;&#x5B8C;&#x4E86;&#x897F;&#x5B89;&#x7684;&#x91CD;&#x70B9;&#x666F;&#x533A;&#x3002;&#x7136;&#x540E;&#x98DE;&#x5230;&#x4E86;&#x6DF1;&#x5733;&#x770B;&#x4E86;&#x4E00;&#x573A;&#x591C;&#x613F;&#x7684;&#x6F14;&#x5531;&#x4F1A;&#xFF0C;&#x5728;&#x8001;&#x8205;&#x5BB6;&#x4F4F;&#x4E86;&#x4E00;&#x5929;&#x540E;&#x56DE;&#x5230;&#x4E86;&#x5B66;&#x6821;&#x3002;</p>
<p>&#x5341;&#x6708;&#x4EFD;&#x9664;&#x4E86;&#x80CC;&#x5355;&#x8BCD;&#x5916;&#x4E00;&#x76F4;&#x5728;&#x5FD9;&#x661F;&#x706B;&#x676F;&#x4F5C;&#x54C1;&#xFF0C;&#x5728;&#x6708;&#x5E95;&#x524D;&#x5C06;&#x4E00;&#x4E2A;&#x76F4;&#x64AD;APP&#x8D76;&#x4E86;&#x51FA;&#x6765;&#x3002;&#x671F;&#x95F4;&#x987A;&#x4FBF;&#x53BB;&#x897F;&#x5B89;&#x8C37;&#x6B4C;&#x5F00;&#x53D1;&#x8005;&#x805A;&#x4F1A;&#x4E0A;&#x73A9;&#x4E86;&#x4E00;&#x6B21;&#xFF0C;&#x63A5;&#x89E6;&#x5230;&#x4E86;web app&#x8FD9;&#x4E2A;&#x521A;&#x521A;&#x51FA;&#x751F;&#x4E0D;&#x4E45;&#x7684;&#x5C0F;&#x5BB6;&#x4F19;&#x3002;</p>
<p>&#x5341;&#x6708;&#x4E0B;&#x65EC;&#x51C6;&#x5907;&#x53BB;&#x53C2;&#x52A0;&#x5317;&#x4EAC;iDev&#x5927;&#x4F1A;&#x7684;&#xFF0C;&#x7531;&#x4E8E;&#x96FE;&#x973E;&#x5728;&#x897F;&#x5B89;&#x548C;&#x5317;&#x4EAC;&#x7684;&#x53CC;&#x91CD;&#x5F71;&#x54CD;&#xFF0C;&#x822A;&#x73ED;&#x53D6;&#x6D88;&#xFF0C;&#x5728;&#x5728;&#x673A;&#x573A;&#x5BBE;&#x9986;&#x4F4F;&#x4E00;&#x5BBF;&#x4E0E;&#x56DE;&#x6821;&#x95F4;&#x6211;&#x9009;&#x62E9;&#x4E86;&#x540E;&#x8005;&#x3002;&#x540E;&#x6765;&#x4E0A;&#x5FAE;&#x535A;&#x4E0A;&#x4E00;&#x770B;&#xFF0C;&#x7531;&#x4E8E;&#x5317;&#x4EAC;&#x96FE;&#x973E;&#x800C;&#x53D6;&#x6D88;&#x822A;&#x73ED;&#x5BFC;&#x81F4;&#x65E0;&#x6CD5;&#x53C2;&#x52A0;iDev&#x7684;&#x4E0D;&#x6B62;&#x6211;&#x4E00;&#x4E2A;&#xFF0C;&#x77AC;&#x95F4;&#x5C31;&#x5F00;&#x5FC3;&#x4E86;2333</p>
<pre><code>&#x6709;&#x4E9B;&#x8BB0;&#x5FC6;&#x5C31;&#x662F;&#x65E0;&#x6CD5;free&#x7684;memory
</code></pre><p>&#x5341;&#x4E00;&#x6708;&#x7531;&#x4E8E;&#x611F;&#x60C5;&#x4E0A;&#x51FA;&#x4E86;&#x4E00;&#x4E9B;&#x6CE2;&#x52A8;&#xFF0C;&#x9009;&#x62E9;&#x7528;&#x770B;&#x4E66;&#x9EBB;&#x75F9;&#x81EA;&#x5DF1;&#x3002;&#x5341;&#x4E00;&#x6708;&#x771F;&#x7684;&#x662F;&#x6211;&#x7684;&#x4E00;&#x4E2A;&#x7206;&#x53D1;&#x6708;&#xFF0C;&#x671F;&#x95F4;&#x770B;&#x5B8C;&#x4E86;&#x5927;&#x534A;&#x672C;&#x7684;&#x300A;&#x7B97;&#x6CD5;&#x5BFC;&#x8BBA;&#x300B;&#xFF0C;&#x6700;&#x540E;&#x7531;&#x4E8E;B&#x6811;&#x7684;&#x5220;&#x9664;&#x6B7B;&#x6D3B;&#x6CA1;&#x770B;&#x61C2;&#x5C31;&#x6254;&#x4E0B;&#x4E86;&#x3002;</p>
<p>&#x540C;&#x65F6;&#x8FD8;&#x75AF;&#x72C2;&#x7684;&#x70B9;&#x4E86;&#x4E00;&#x5806;&#x672C;&#x5E94;&#x8BE5;&#x5728;&#x5927;&#x4E00;&#x4E0B;&#x5B66;&#x671F;&#x5C31;&#x5E94;&#x8BE5;&#x70B9;&#x7684;&#x57FA;&#x7840;&#x6280;&#x80FD;&#x70B9;&#x3002;&#x638C;&#x63E1;&#x4E86;Linux&#x7684;&#x57FA;&#x7840;&#x64CD;&#x4F5C;&#xFF0C;&#x5165;&#x95E8;&#x4E86;mySQL&#xFF0C;&#x91CD;&#x6E29;&#x4E86;vim&#xFF0C;&#x624B;&#x6413;&#x4E86;&#x5F88;&#x591A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x8F6E;&#x5B50;&#xFF0C;&#x5F88;&#x7C97;&#x7565;&#x7684;&#x6D4F;&#x89C8;&#x4E86;&#x4E00;&#x8FB9;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x7EC4;&#x6210;&#x3002;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x4E0D;&#x4E00;&#x4E00;&#x4F8B;&#x4E3E;&#x4E86;&#xFF0C;&#x73B0;&#x5728;&#x56DE;&#x60F3;&#x8D77;&#x6765;&#x5F53;&#x65F6;&#x7684;&#x6211;&#x771F;&#x53EF;&#x6015;&#x3002;</p>
<p>&#x5341;&#x4E00;&#x6708;&#x4E0B;&#x65EC;&#x4E0A;coursera&#x4E70;&#x4E86;&#x65AF;&#x5766;&#x798F;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x8BFE;&#x7A0B;&#xFF0C;&#x4ECE;&#x6B64;&#x4FBF;&#x5165;&#x4E86;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x5751;&#xFF0C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x771F;&#x7684;&#x5F88;&#x6709;&#x610F;&#x601D;&#xFF0C;&#x5F53;&#x4F60;&#x53D1;&#x73B0;&#x4F60;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x90A3;&#x4E9B;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x9760;&#x81EA;&#x5DF1;&#x6765;&#x4E0D;&#x65AD;&#x4F18;&#x5316;&#x81EA;&#x5DF1;&#xFF0C;&#x6709;&#x79CD;&#x517B;&#x513F;&#x5B50;&#x7684;&#x9519;&#x89C9;2333</p>
<p>&#x8BFE;&#x7A0B;&#x5230;&#x73B0;&#x5728;&#x8FD8;&#x6CA1;&#x6709;&#x7ED3;&#x675F;&#xFF0C;&#x6309;&#x65F6;&#x95F4;&#x8868;&#x7ED3;&#x675F;&#x7684;&#x90A3;&#x4E00;&#x5468;&#x6B63;&#x597D;&#x662F;&#x519C;&#x5386;&#x65B0;&#x5E74;&#x7684;&#x90A3;&#x4E00;&#x5468;&#xFF0C;&#x90A3;&#x65F6;&#x5C31;&#x5C06;&#x7ED3;&#x8BFE;&#x8BC1;&#x4E66;&#x9001;&#x7ED9;&#x81EA;&#x5DF1;&#x5F53;&#x505A;&#x793C;&#x7269;&#x5427;&#x3002;</p>
<p>&#x5341;&#x4E8C;&#x6708;&#x5728;&#x51C6;&#x5907;&#x590D;&#x4E60;&#x7684;&#x540C;&#x65F6;&#x7EE7;&#x7EED;&#x8DDF;&#x7740;&#x8BFE;&#x7A0B;&#x8D70;&#xFF0C;&#x6CA1;&#x4EC0;&#x4E48;&#x53EF;&#x8BF4;&#x7684;&#x3002;</p>
<h2 id="&#x611F;&#x8C22;"><a href="#&#x611F;&#x8C22;" class="headerlink" title="&#x611F;&#x8C22;"></a>&#x611F;&#x8C22;</h2><p>&#x4E00;&#x603B;&#x7ED3;&#x624D;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x5728;&#x5927;&#x4E8C;&#x4E0A;&#x5B66;&#x671F;&#x638C;&#x63E1;&#x4E86;&#x4E0D;&#x5C11;&#x4E1C;&#x897F;&#x3002;&#x5728;&#x8FDB;&#x6B65;&#x7684;&#x80CC;&#x540E;&#xFF0C;&#x6700;&#x8981;&#x611F;&#x8C22;&#x7684;&#x5C31;&#x662F;&#x9662;&#x79D1;&#x534F;&#x8FD9;&#x4E2A;&#x795E;&#x5947;&#x7684;&#x7EC4;&#x7EC7;&#xFF0C;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x8BF4;&#xFF0C;2016&#x6700;&#x540E;&#x51E0;&#x4E2A;&#x6708;&#x8BA9;&#x6211;&#x575A;&#x6301;&#x8D70;&#x4E0B;&#x6765;&#x7684;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x4FE1;&#x5FF5;&#xFF0C;&#x7B49;&#x6211;&#x5230;&#x5927;&#x4E09;&#x65F6;&#x4E5F;&#x8981;&#x50CF;&#x8D35;&#x534F;&#x90A3;&#x4E9B;&#x5F3A;&#x8005;&#x4E00;&#x6837;&#x5389;&#x5BB3;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x770B;&#x8D77;&#x6765;&#x6211;&#x5728;&#x5927;&#x4E00;&#x65F6;&#x505A;&#x7684;&#x6700;&#x91CD;&#x8981;&#x7684;&#x51B3;&#x5B9A;&#xFF0C;&#x5C31;&#x662F;&#x5728;&#x8D35;&#x534F;&#x575A;&#x6301;&#x5730;&#x7559;&#x4E86;&#x4E0B;&#x6765;&#x3002;&#x5F88;&#x591A;&#x5E74;&#x4E4B;&#x540E;&#x6211;&#x4E00;&#x5B9A;&#x4F1A;&#x611F;&#x8C22;&#x8FD9;&#x4E2A;&#x51B3;&#x5B9A;&#x7684;&#xFF0C;&#x4E00;&#x5B9A;&#x3002;</p>
<h2 id="&#x5C55;&#x671B;2017"><a href="#&#x5C55;&#x671B;2017" class="headerlink" title="&#x5C55;&#x671B;2017"></a>&#x5C55;&#x671B;2017</h2><p>&#x76F8;&#x6BD4;&#x4E8E;&#x6652;&#x8BA1;&#x5212;&#xFF0C;&#x6211;&#x66F4;&#x559C;&#x6B22;&#x6652;&#x6210;&#x679C;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x7684;2017&#x552F;&#x4E00;&#x7684;&#x8BA1;&#x5212;&#x5C31;&#x662F;&#xFF0C;&#x8BA9;&#x81EA;&#x5DF1;&#x6BCF;&#x5929;&#x90FD;&#x6709;&#x65B0;&#x7684;&#x957F;&#x8FDB;&#xFF0C;&#x5B58;&#x91CF;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x589E;&#x91CF;&#x624D;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x6709;&#x7684;&#x4EBA;&#x4E00;&#x751F;&#x53EA;&#x6D3B;&#x4E86;&#x4E00;&#x5929;&#xFF0C;&#x4E0D;&#x8FC7;&#x662F;&#x91CD;&#x590D;&#x4E86;&#x4E00;&#x4E07;&#x591A;&#x6B21;&#xFF1B;&#x8FD8;&#x6709;&#x7684;&#x4EBA;&#x4E00;&#x751F;&#x6D3B;&#x4E86;&#x4E00;&#x4E07;&#x591A;&#x5929;&#x3002;&#x6211;&#x52AA;&#x529B;&#x60F3;&#x6210;&#x4E3A;&#x7B2C;&#x4E8C;&#x79CD;&#x4EBA;&#xFF0C;&#x6240;&#x4EE5;&#x52AA;&#x529B;&#x53BB;&#x7ECF;&#x5386;&#x66F4;&#x591A;&#x7684;&#x4E8B;&#xFF0C;&#x8BA9;&#x81EA;&#x5DF1;&#x7684;&#x4EBA;&#x751F;&#x5145;&#x5B9E;&#x3002; </p>
<p>&#x4E3A;&#x4E86;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x7684;&#x5B66;&#x6821;&#x52A0;&#x6CB9;&#x5954;&#x8DD1;&#x5427;</p>
<p>2016&#x5E74;12&#x6708;31&#x65E5;&#x665A;&#xFF0C;&#x5199;&#x4E8E;G302&#x3002;</p>

      
    </div><!-- .entry-content -->

    <footer class="entry-meta">
    <a href="/2016/12/31/2016年终总结/">
    <time datetime="2016-12-31T11:49:22.000Z" class="entry-date">
        2016-12-31
    </time>
</a>
    
  <span class="article-delim">&#8226;</span>
  <div class="article-category">
  <a class="article-category-link" href="/categories/LIFE/">LIFE</a>
  </div>

    
    </footer>
</article>


    
<nav class="nav-single">
    <h3 class="assistive-text">文章导航</h3>
    
    
        <span class="nav-next"><a href="/2016/12/31/Machine-Learning-9/" rel="next">Machine-Learning-9 <span class="meta-nav">→</span></a></span>
    
</nav><!-- .nav-single -->







</div></div>
        <div id="secondary" class="widget-area" role="complementary">
  
    <aside id="search" class="widget widget_search"><form role="search" method="get" accept-charset="utf-8" id="searchform" class="searchform" action="//google.com/search">
    <div>
        <input type="text" value="" name="s" id="s" />
        <input type="submit" id="searchsubmit" value="搜索" />
    </div>
</form></aside>
  
    
  
    
  <aside class="widget">
    <h3 class="widget-title">Categories</h3>
    <div class="widget-content">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/LIFE/">LIFE</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/MAC/">MAC</a><span class="category-list-count">3</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/iOS/">iOS</a><span class="category-list-count">20</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/御宅文化/">御宅文化</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/机器学习/">机器学习</a><span class="category-list-count">9</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/编程/">编程</a><span class="category-list-count">55</span></li></ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Recents</h3>
    <div class="widget-content">
      <ul>
        
          <li>
            <a href="/2016/12/31/2016年终总结/">Legend 2016</a>
          </li>
        
          <li>
            <a href="/2016/12/31/Machine-Learning-9/">Machine-Learning-9</a>
          </li>
        
          <li>
            <a href="/2016/12/31/Machine-Learning-8/">Machine-Learning-8</a>
          </li>
        
          <li>
            <a href="/2016/12/19/Machine-Learning-7/">Machine-Learning-7</a>
          </li>
        
          <li>
            <a href="/2016/12/13/Machine-Learning-6/">Machine-Learning-6</a>
          </li>
        
      </ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Tags</h3>
    <div class="widget-content">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/Cocoapods/">Cocoapods</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/HTML/">HTML</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Linux/">Linux</a><span class="tag-list-count">15</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Machine-Learning/">Machine Learning</a><span class="tag-list-count">9</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Matlab/">Matlab</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/MySQL/">MySQL</a><span class="tag-list-count">3</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIColor/">UIColor</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView/">UIView</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView-圆角/">UIView-圆角</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Vim/">Vim</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/bug/">bug</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/hexo/">hexo</a><span class="tag-list-count">4</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/指针/">指针</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/数据结构/">数据结构</a><span class="tag-list-count">20</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/算法/">算法</a><span class="tag-list-count">8</span></li></ul>
    </div>
  </aside>

  
    
<div class="widget tag">
<h3 class="title">blogroll</h3>
<ul class="entry">


<li><a href="https://github.com/" target="_blank">github</a></li>


<li><a href="http://www.jianshu.com/users/41cd7711ed44/latest_articles" target="_blank">我的简书主页</a></li>

</ul>
</div>

  
</div>
      </div>
      <footer id="colophon" role="contentinfo">
    <p>&copy; 2016 SaberDa
    All rights reserved.</p>
    <p>Powered by <a href="http://hexo.io/" target="_blank">Hexo</a></p>
</footer>
    <script>window._bd_share_config={"common":{"bdSnsKey":{},"bdText":"","bdMini":"1","bdMiniList":false,"bdPic":"","bdStyle":"2","bdSize":"16"},"share":{}};with(document)0[(getElementsByTagName('head')[0]||body).appendChild(createElement('script')).src='http://bdimg.share.baidu.com/static/api/js/share.js?v=89860593.js?cdnversion='+~(-new Date()/36e5)];</script>

<script src="/js/jquery-2.0.3.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

<script src="/js/navigation.js"></script>

<div id="bg"></div>

  </div>
</body>
</html>