<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  
  <meta name="description" content="一个神奇的地方" />
  

  
  
  
  
  
  
  <title>魔兽十年永不长眠 | SaberDa的幻想乡</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;gt;&amp;#x867D;&amp;#x7136;&amp;#x6211;&amp;#x4E0D;&amp;#x9002;&amp;#x5408;&amp;#x5199;&amp;#x6587;&amp;#x7AE0;&amp;#xFF0C;&amp;#x4F46;&amp;#x8FD9;&amp;#x7BC7;&amp;#x6587;&amp;#x7AE0;&amp;#x6211;&amp;#x4E00;&amp;#x5B9A;&amp;#x8981;&amp;#x5199;&amp;#x51FA;&amp;#x6765;&amp;#x3002;&amp;#x4ECE;&amp;#x4">
<meta property="og:type" content="article">
<meta property="og:title" content="魔兽十年永不长眠">
<meta property="og:url" content="https://saberda.github.io/2016/03/19/魔兽十年-永不长眠/index.html">
<meta property="og:site_name" content="SaberDa的幻想乡">
<meta property="og:description" content="&amp;gt;&amp;#x867D;&amp;#x7136;&amp;#x6211;&amp;#x4E0D;&amp;#x9002;&amp;#x5408;&amp;#x5199;&amp;#x6587;&amp;#x7AE0;&amp;#xFF0C;&amp;#x4F46;&amp;#x8FD9;&amp;#x7BC7;&amp;#x6587;&amp;#x7AE0;&amp;#x6211;&amp;#x4E00;&amp;#x5B9A;&amp;#x8981;&amp;#x5199;&amp;#x51FA;&amp;#x6765;&amp;#x3002;&amp;#x4ECE;&amp;#x4">
<meta property="og:updated_time" content="2016-06-26T16:45:17.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="魔兽十年永不长眠">
<meta name="twitter:description" content="&amp;gt;&amp;#x867D;&amp;#x7136;&amp;#x6211;&amp;#x4E0D;&amp;#x9002;&amp;#x5408;&amp;#x5199;&amp;#x6587;&amp;#x7AE0;&amp;#xFF0C;&amp;#x4F46;&amp;#x8FD9;&amp;#x7BC7;&amp;#x6587;&amp;#x7AE0;&amp;#x6211;&amp;#x4E00;&amp;#x5B9A;&amp;#x8981;&amp;#x5199;&amp;#x51FA;&amp;#x6765;&amp;#x3002;&amp;#x4ECE;&amp;#x4">
  
  
    <link rel="icon" href="/css/images/favicon.ico">
  
  <link rel="stylesheet" href="/css/style.css">
  

  
  <!-- baidu webmaster push -->
  <script src='//push.zhanzhang.baidu.com/push.js'></script>
</head>
<body class="home blog custom-background custom-font-enabled single-author">
  <div id="page" class="hfeed site">
      <header id="masthead" class="site-header" role="banner">
    <hgroup>
      <h1 class="site-title">
        <a href="/" title="SaberDa的幻想乡" rel="home">SaberDa的幻想乡</a>
      </h1>
      
        <h2 class="site-description">
          <a href="/" id="subtitle">　　iOS　　|　　Mac　　|　　二次元　　|　　最近喜欢上了一个妹子～</a>
        </h2>
      
    </hgroup>

    <nav id="site-navigation" class="main-navigation" role="navigation">
            <button class="menu-toggle">菜单</button>
            <a class="assistive-text" href="/#content" title="跳至内容">跳至内容</a><!--TODO-->
            <div class="menu-main-container">
                <ul id="menu-main" class="nav-menu">
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/archives">所有文章</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/">主页</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/编程/">编程</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/iOS/">iOS</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/MAC/">MAC</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/御宅文化/">御宅文化</a></li>
                
                    <li class="menu-item menu-item-type-post_type menu-item-object-page"><a href="/categories/LIFE/">LIFE</a></li>
                
                </ul>
            </div>
    </nav>
</header>
      <div id="main" class="wrapper">
        <div id="primary" class="site-content"><div id="content" role="main"><article id="post-魔兽十年-永不长眠" class="post-魔兽十年-永不长眠 post type-post status-publish format-standard hentry">
    <!---->

      <header class="entry-header">
        
        
  
    <h1 class="entry-title article-title">
      魔兽十年永不长眠
    </h1>
  

        
        <div class="comments-link">
            
            <a href="javascript:void(0);" data-url="https://saberda.github.io/2016/03/19/魔兽十年-永不长眠/" data-id="citloi0tk0029eqb3n36ce251" class="leave-reply bdsharebuttonbox" data-cmd="more">Share</a>
        </div><!-- .comments-link -->
      </header><!-- .entry-header -->

    <div class="entry-content">
      
        <p>&gt;<br>&#x867D;&#x7136;&#x6211;&#x4E0D;&#x9002;&#x5408;&#x5199;&#x6587;&#x7AE0;&#xFF0C;&#x4F46;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x6211;&#x4E00;&#x5B9A;&#x8981;&#x5199;&#x51FA;&#x6765;&#x3002;<br>&#x4ECE;&#x4E0A;&#x4E2A;&#x5047;&#x671F;&#x5F00;&#x59CB;&#x63A5;&#x89E6;&#x9B54;&#x517D;&#x5230;&#x73B0;&#x5728;&#x4E5F;&#x6709;&#x4E24;&#x4E2A;&#x591A;&#x6708;&#x4E86;&#xFF0C;&#x8001;&#x5B9E;&#x8BF4;&#xFF0C;&#x5BF9;&#x4E8E;&#x63A5;&#x89E6;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x6211;&#x65E2;&#x5FC3;&#x5B58;&#x6094;&#x6068;&#x53C8;&#x5E26;&#x6709;&#x5E86;&#x5E78;&#xFF0C;&#x6094;&#x6068;&#x662F;&#x56E0;&#x4E3A;&#x9B54;&#x517D;&#x5360;&#x7528;&#x4E86;&#x6211;&#x672C;&#x5E94;&#x8BE5;&#x7528;&#x6765;&#x5B66;&#x4E60;&#x7684;&#x592A;&#x591A;&#x65F6;&#x95F4;&#xFF0C;&#x5E86;&#x5E78;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x63A5;&#x89E6;&#x4E86;&#x9B54;&#x517D;&#x8FD9;&#x4E2A;miracle&#x3002;<br>&#x60F3;&#x8981;&#x5177;&#x4F53;&#x7684;&#x8C08;&#x4E00;&#x8C08;&#x9B54;&#x517D;&#xFF0C;&#x4E0D;&#x5F97;&#x4E0D;&#x8BF4;&#x6211;&#x662F;&#x5982;&#x4F55;&#x60F3;&#x73A9;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x7684;&#x3002;</p>
<p>&#x5927;&#x4E00;&#x4E0A;&#x5B66;&#x671F;&#x671F;&#x672B;&#x8003;&#x8BD5;&#x671F;&#x95F4;&#xFF0C;&#x6211;&#x6709;&#x91CD;&#x6E29;&#x4E86;&#x4E00;&#x904D;&#x300A;&#x5168;&#x804C;&#x9AD8;&#x624B;&#x300B;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x840C;&#x53D1;&#x4E86;&#x4E00;&#x4E2A;&#x60F3;&#x73A9;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x7684;RPG&#x6E38;&#x620F;&#xFF0C;&#x4E8E;&#x662F;&#x628A;&#x73B0;&#x884C;&#x7684;&#x6BD4;&#x8F83;&#x706B;&#x7684;RPG&#x62CE;&#x51FA;&#x6765;&#x770B;&#x4E86;&#x770B;&#xFF0C;&#x60C5;&#x4E0D;&#x81EA;&#x7981;&#x7684;&#x5C31;&#x4E0B;&#x8F7D;&#x4E86;&#x9B54;&#x517D;&#x3002;&#x4E00;&#x662F;&#x6211;&#x4E00;&#x76F4;&#x5C31;&#x60F3;&#x4F53;&#x9A8C;&#x4E00;&#x4E0B;RPG&#x7684;&#x7956;&#x5B97;&#xFF0C;&#x66F4;&#x4E3B;&#x8981;&#x7684;&#x662F;&#x5C31;&#x9B54;&#x517D;&#x4E00;&#x6B3E;&#x6E38;&#x620F;&#x6709;Mac&#x5E73;&#x53F0;&#x7684;&#x6E38;&#x620F;&#xFF0C;&#x4E0D;&#x5F97;&#x4E0D;&#x8BF4;&#xFF0C;&#x548C;&#x66B4;&#x96EA;&#x6BD4;&#x8D77;&#x6765;&#xFF0C;&#x56FD;&#x5185;&#x7684;&#x6E38;&#x620F;&#x516C;&#x53F8;&#x5C31;&#x662F;&#x814A;&#x9E21;&#x3002;</p>
<p>&#x6E38;&#x620F;&#x4E86;&#x8FD9;&#x4E48;&#x957F;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x6211;&#x611F;&#x89E6;&#x6700;&#x6DF1;&#x7684;&#x4E00;&#x70B9;&#x5C31;&#x662F;&#x9B54;&#x517D;&#x73A9;&#x5BB6;&#x7684;&#x7D20;&#x8D28;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#xFF0C;&#x6211;&#x4ECE;&#x4E00;&#x7EA7;&#x6253;&#x5230;&#x6EE1;&#x7EA7;&#xFF0C;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x73A9;&#x5BB6;&#x56E0;&#x6211;&#x662F;&#x65B0;&#x624B;&#x800C;&#x5ACC;&#x5F03;&#x6211;&#xFF0C;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x73A9;&#x5BB6;&#x56E0;&#x6211;&#x662F;&#x65B0;&#x624B;&#x5C31;&#x5751;&#x6211;&#xFF0C;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x4F1A;&#x8010;&#x5FC3;&#x7684;&#x544A;&#x8BC9;&#x6211;&#x8FD9;&#x91CC;&#x8BE5;&#x600E;&#x4E48;&#x8D70;&#xFF0C;&#x90A3;&#x91CC;&#x8BE5;&#x600E;&#x4E48;&#x6253;&#xFF0C;&#x4E0D;&#x7BA1;&#x6211;&#x95EE;&#x7684;&#x95EE;&#x9898;&#x5728;&#x4ED6;&#x4EEC;&#x773C;&#x91CC;&#x6709;&#x591A;&#x65E0;&#x77E5;&#xFF0C;&#x90FD;&#x4F1A;&#x8010;&#x5FC3;&#x7684;&#x56DE;&#x7B54;&#x6211;&#x3002;&#x6211;&#x6562;&#x65AD;&#x8A00;&#xFF0C;&#x8FD9;&#x79CD;&#x73B0;&#x8C61;&#x5728;&#x73B0;&#x5728;&#x6700;&#x706B;&#x7684;&#x6E38;&#x620F;&#x67D0;&#x76DF;&#x662F;&#x7EDD;&#x5BF9;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x7684;&#x3002;&#x6211;&#x73B0;&#x5728;&#x8FD8;&#x6E05;&#x695A;&#x7684;&#x8BB0;&#x5F97;&#xFF0C;&#x6211;&#x5728;&#x5E7D;&#x6697;&#x57CE;&#x91CC;&#x8FF7;&#x8DEF;&#x4E86;&#x968F;&#x4FBF;&#x627E;&#x4E86;&#x4E00;&#x4E2A;&#x73A9;&#x5BB6;&#x95EE;&#x8DEF;&#xFF0C;&#x4ED6;&#x7ACB;&#x5373;&#x5C31;&#x628A;&#x6211;&#x9886;&#x51FA;&#x4E86;&#x57CE;&#x3002;&#x5728;&#x6E38;&#x620F;&#x91CC;&#xFF0C;&#x6709;&#x4E2A;&#x53EB;&#x8840;&#x7075;&#x7684;&#x5927;&#x54E5;&#x975E;&#x5E38;&#x7167;&#x987E;&#x6211;&#xFF0C;&#x5728;&#x6211;&#x6EE1;&#x7EA7;&#x540E;&#x6211;&#x5F88;&#x8FF7;&#x832B;&#x6211;&#x63A5;&#x4E0B;&#x6765;&#x600E;&#x4E48;&#x505A;&#xFF0C;&#x4ED6;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x7684;&#x544A;&#x8BC9;&#x6211;&#x8BE5;&#x53BB;&#x54EA;&#x91CC;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x8FD8;&#x7ED9;&#x6211;&#x90AE;&#x5BC4;&#x4E86;&#x4E00;&#x4E2A;&#x4F20;&#x5BB6;&#x5B9D;&#xFF0C;&#x867D;&#x7136;&#x5230;&#x73B0;&#x5728;&#x6211;&#x4E5F;&#x6CA1;&#x6709;&#x6536;&#x5230;&#xFF08;&#x4ED6;&#x53EF;&#x80FD;&#x662F;&#x5BC4;&#x9519;&#x4EBA;&#x4E86;&#xFF09;&#xFF0C;&#x4F46;&#x4E0D;&#x7BA1;&#x600E;&#x6837;&#xFF0C;&#x6211;&#x5728;&#x9B54;&#x517D;&#x8FD9;&#x4E2A;&#x5927;&#x5BB6;&#x5EAD;&#x91CC;&#x5F88;&#x6E29;&#x6696;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x6E38;&#x620F;&#x79EF;&#x7D2F;&#x4E86;&#x5341;&#x5E74;&#xFF0C;&#x4ECE;&#x73A9;&#x5BB6;&#x7D20;&#x8D28;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x8FD9;&#x5341;&#x5E74;&#x6C89;&#x6DC0;&#x7684;&#x529B;&#x91CF;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x6E38;&#x620F;&#x91CC;&#x53EA;&#x4F1A;&#x9A82;&#x8054;&#x76DF;&#x72D7;&#xFF0C;&#x8054;&#x76DF;&#x53CD;&#x8FC7;&#x6765;&#x9A82;&#x6211;&#x4EEC;&#x90E8;&#x843D;&#x732A;&#xFF0C;&#x53CD;&#x89C2;&#x67D0;&#x76DF;&#x52A8;&#x4E0D;&#x52A8;&#x7684;&#x5C31;&#x62DB;&#x547C;&#x4F60;&#x5168;&#x5BB6;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x5DEE;&#x8DDD;&#xFF0C;&#x4E00;&#x4E2A;&#x4F20;&#x5947;&#x548C;&#x4E00;&#x4E2A;&#x6E38;&#x620F;&#x7684;&#x5DEE;&#x8DDD;&#x3002;&#x4E5F;&#x8BB8;&#x518D;&#x8FC7;&#x5341;&#x5E74;&#xFF0C;&#x9B54;&#x517D;&#x6700;&#x706B;&#x7684;&#x670D;&#x90FD;&#x4F1A;&#x53D8;&#x6210;&#x9B3C;&#x670D;&#xFF0C;&#x800C;&#x67D0;&#x76DF;&#x8FD8;&#x662F;&#x4F9D;&#x65E7;&#x7684;&#x706B;&#xFF0C;&#x4F46;&#x662F;&#x67D0;&#x76DF;&#x4F9D;&#x7136;&#x662F;&#x4E00;&#x6B3E;&#x6E38;&#x620F;&#xFF0C;&#x800C;&#x9B54;&#x517D;&#x65E9;&#x5DF2;&#x6210;&#x4E3A;&#x4E86;&#x90A3;&#x4E00;&#x4EE3;&#x73A9;&#x5BB6;&#x5728;&#x5FC3;&#x4E2D;&#x7684;&#x4E16;&#x754C;&#x3002;</p>
<p>&#x5341;&#x5E74;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x4E00;&#x751F;&#x800C;&#x8A00;&#x662F;&#x975E;&#x5E38;&#x5B9D;&#x8D35;&#x7684;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;&#x4E00;&#x6B3E;&#x7F51;&#x7EDC;&#x6E38;&#x620F;&#xFF0C;&#x5341;&#x5E74;&#x7684;&#x65F6;&#x95F4;&#x8DB3;&#x4EE5;&#x6811;&#x7ACB;&#x4E00;&#x6BB5;&#x4F20;&#x5947;&#x3002;&#x6211;&#x4ECE;&#x5C0F;&#x5B66;&#x4E8C;&#x4E09;&#x5E74;&#x7EAA;&#x5F00;&#x59CB;&#x6253;&#x6E38;&#x620F;&#xFF0C;&#x6211;&#x51E0;&#x4E4E;&#x89C1;&#x8BC1;&#x4E86;&#x76DB;&#x5927;&#x4ECE;&#x7E41;&#x534E;&#x5230;&#x8870;&#x843D;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x51E0;&#x4E4E;&#x89C1;&#x8BC1;&#x4E86;&#x817E;&#x8BAF;&#x6E38;&#x620F;&#x8FD9;&#x4E2A;&#x5168;&#x7403;&#x6700;&#x5927;&#x6E38;&#x620F;&#x4EE3;&#x7406;&#x5546;&#x7684;&#x5D1B;&#x8D77;&#xFF0C;&#x6211;&#x89C1;&#x8BC1;&#x4E86;&#x592A;&#x591A;&#x7684;&#x706B;&#x7206;&#x4E00;&#x65F6;&#x7684;&#x6240;&#x8C13;&#x5927;&#x4F5C;&#x5728;&#x6781;&#x77ED;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x4ECE;&#x9876;&#x5CF0;&#x8DCC;&#x5165;&#x4F4E;&#x8C37;&#xFF0C;&#x4ECE;&#x9686;&#x91CD;&#x767B;&#x53F0;&#x5230;&#x9EEF;&#x7136;&#x79BB;&#x573A;&#x3002;&#x4E5F;&#x8BB8;&#x4E24;&#x4E09;&#x5E74;&#xFF0C;&#x4E5F;&#x8BB8;&#x662F;&#x51E0;&#x4E2A;&#x6708;&#xFF0C;&#x751A;&#x81F3;&#x8BA1;&#x6570;&#x7684;&#x5355;&#x4F4D;&#x4EC5;&#x4EC5;&#x662F;&#x5929;&#xFF0C;&#x800C;&#x9B54;&#x517D;&#x4E16;&#x754C;&#xFF0C;&#x4E00;&#x5982;&#x65E2;&#x5F80;&#x7684;&#x706B;&#x4E86;&#x5341;&#x5E74;&#x3002;</p>
<p>&#x5341;&#x5E74;&#x7684;&#x6C89;&#x6DC0;&#xFF0C;&#x4F7F;&#x9B54;&#x517D;&#x4E16;&#x754C;&#x62E5;&#x6709;&#x4E86;&#x5927;&#x591A;&#x6570;&#x6E38;&#x620F;&#x65E0;&#x6CD5;&#x4F01;&#x53CA;&#x7684;&#x9AD8;&#x5FE0;&#x73A9;&#x5BB6;&#x7FA4;&#x4F53;&#x4E0E;&#x6E38;&#x620F;&#x6587;&#x5316;&#xFF0C;&#x4E5F;&#x56E0;&#x6B64;&#x4F7F;&#x6E38;&#x620F;&#x5728;&#x4E00;&#x4EE3;&#x4E00;&#x4EE3;&#x7684;&#x73A9;&#x5BB6;&#x4E4B;&#x95F4;&#x5F97;&#x5230;&#x4E86;&#x4F20;&#x627F;&#x3002;&#x65E0;&#x8BBA;&#x4F60;&#x662F;60&#xFF0C;70&#xFF0C;80&#xFF0C;90&#x751A;&#x81F3;00&#x5728;&#x751A;&#x81F3;10&#x540E;&#xFF0C;&#x90FD;&#x80FD;&#x5728;&#x8FD9;&#x4E2A;&#x5927;&#x5BB6;&#x5EAD;&#x4E2D;&#x5F97;&#x5230;&#x4E00;&#x79CD;&#x5F52;&#x5C5E;&#x611F;&#x3002;&#x6211;&#x4EEC;&#x66FE;&#x5728;&#x65E0;&#x6570;&#x7684;&#x573A;&#x5408;&#x542C;&#x5230;&#x8FC7;&#x201C;&#x4E3A;&#x4E86;&#x8054;&#x76DF;&#x201D;&#x4E0E;&#x201C;&#x4E3A;&#x4E86;&#x90E8;&#x843D;&#x201D;&#x9707;&#x8033;&#x6B32;&#x804B;&#x7684;&#x5450;&#x558A;&#xFF0C;&#x8FD9;&#x65F6;&#x65E0;&#x8BBA;&#x4F60;&#x662F;&#x8054;&#x76DF;&#x8FD8;&#x662F;&#x90E8;&#x843D;&#xFF0C;&#x65E0;&#x8BBA;&#x4F60;&#x662F;&#x5728;&#x5728;&#x6821;&#x5B66;&#x751F;&#x8FD8;&#x662F;&#x516C;&#x53F8;&#x767D;&#x9886;&#xFF0C;&#x4E5F;&#x65E0;&#x8BBA;&#x4F60;&#x662F;&#x4E00;&#x63B7;&#x5343;&#x91D1;&#x7684;&#x571F;&#x8C6A;&#x8001;&#x677F;&#x8FD8;&#x662F;&#x80CC;&#x4E95;&#x79BB;&#x4E61;&#x7684;&#x6253;&#x5DE5;&#x9752;&#x5E74;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x5FC3;&#x91CC;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x57CB;&#x85CF;&#x7740;&#x4E00;&#x4E2A;&#x58F0;&#x97F3;&#x2014;&#x2014;&#x201C;&#x6211;&#x662F;&#x9B54;&#x517D;&#x73A9;&#x5BB6;&#xFF01;&#x201D;&#x3002;&#x6CA1;&#x9519;&#xFF0C;&#x6211;&#x56E0;&#x4E3A;&#x6211;&#x73A9;&#x8FC7;&#x9B54;&#x517D;&#xFF0C;&#x6211;&#x63A5;&#x89E6;&#x4E86;&#x827E;&#x6CFD;&#x62C9;&#x65AF;&#x8FD9;&#x4E2A;&#x7F8E;&#x4E3D;&#x7684;&#x5927;&#x9646;&#x800C;&#x81EA;&#x8C6A;&#xFF01;</p>
<p>&#x6211;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5584;&#x4E8E;&#x5199;&#x4F5C;&#x7684;&#x4EBA;&#xFF0C;&#x4F46;&#x6211;&#x4E00;&#x5B9A;&#x8981;&#x628A;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x5199;&#x51FA;&#x6765;&#x3002;&#x6211;&#x5411;&#x5F88;&#x591A;&#x4EBA;&#x5BA3;&#x4F20;&#x3001;&#x547C;&#x5401;&#xFF0C;&#x60F3;&#x8BA9;&#x4ED6;&#x4EEC;&#x63A5;&#x89E6;&#x5230;&#x8FD9;&#x4E2A;&#x5947;&#x8FF9;&#xFF0C;&#x4F46;&#x662F;&#x66F4;&#x591A;&#x7684;&#x4EBA;&#x9009;&#x62E9;&#x653E;&#x5F03;&#xFF0C;&#x751A;&#x81F3;&#x6709;&#x4EBA;&#x613F;&#x610F;&#x73A9;&#x6BD4;&#x9B54;&#x517D;&#x52A3;&#x8D28;&#x7684;&#x591A;&#x7684;rpg&#xFF0C;&#x8FD9;&#x8BA9;&#x6211;&#x611F;&#x89C9;&#x5F88;&#x4E0D;&#x8212;&#x670D;&#x3002;&#x6CA1;&#x9519;&#xFF0C;&#x9B54;&#x517D;&#x7528;&#x7684;&#x8FD8;&#x662F;&#x51E0;&#x5E74;&#x524D;&#x7684;&#x8001;&#x5F15;&#x64CE;&#xFF0C;&#x8FD9;&#x5BFC;&#x81F4;&#x5B83;&#x7684;&#x6E38;&#x620F;&#x753B;&#x9762;&#x4E0D;&#x5982;&#x73B0;&#x884C;&#x7684;&#x591A;&#x6B3E;&#x6E38;&#x620F;&#xFF1B;&#x6216;&#x8BB8;&#x5B83;&#x7684;&#x6E38;&#x620F;&#x8BBE;&#x5B9A;&#x592A;&#x8FC7;&#x590D;&#x6742;&#xFF08;&#x8FD9;&#x5C45;&#x7136;&#x662F;&#x597D;&#x591A;&#x4EBA;&#x7528;&#x6765;&#x62D2;&#x7EDD;&#x7684;&#x501F;&#x53E3;&#xFF09;&#xFF0C;&#x4F46;&#x6E38;&#x620F;&#x590D;&#x6742;&#x4E0D;&#x6B63;&#x662F;&#x8FD9;&#x6B3E;&#x6E38;&#x620F;&#x7684;&#x9B45;&#x529B;&#x6240;&#x5728;&#x5417;&#xFF1F;</p>
<p>&#x540C;&#x65F6;&#x6211;&#x4E5F;&#x8981;&#x7ED9;&#x4F60;&#x4EEC;&#x66F4;&#x6B63;&#x89C2;&#x5FF5;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x82B1;&#x70B9;&#x5361;&#x5C31;&#x662F;&#x4F60;&#x80FD;&#x62D2;&#x7EDD;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#x7684;&#x539F;&#x56E0;&#x5417;&#xFF1F;&#x5F53;&#x5E74;&#x7684;&#x68A6;&#x5E7B;&#x897F;&#x6E38;&#x4E5F;&#x662F;&#x70B9;&#x5361;&#x6E38;&#x620F;&#xFF0C;&#x4E0D;&#x662F;&#x7167;&#x6837;&#x7684;&#x706B;&#x4E86;&#x597D;&#x51E0;&#x5E74;&#x5417;&#xFF1F;&#x6211;&#x4EEC;&#x8FD9;&#x4EE3;&#x4EBA;&#x57FA;&#x672C;&#x662F;&#x5728;&#x76D7;&#x7248;&#x6E38;&#x620F;&#x548C;&#x514D;&#x8D39;&#x8D44;&#x6E90;&#x7684;&#x56F4;&#x7ED5;&#x4E0B;&#x6210;&#x957F;&#x8D77;&#x6765;&#x7684;&#xFF0C;&#x5BF9;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x4EFB;&#x4F55;&#x6536;&#x8D39;&#x7684;&#x4E1C;&#x897F;&#x90FD;&#x62B1;&#x6709;&#x62B5;&#x89E6;&#x611F;&#xFF0C;&#x5BF9;&#x7F51;&#x7AD9;&#x4E0D;&#x662F;&#x4F1A;&#x5458;&#x5C31;&#x4E0D;&#x80FD;&#x89C2;&#x5F71;&#x5E26;&#x6709;&#x6124;&#x6068;&#xFF0C;&#x8FD9;&#x4E5F;&#x4E0D;&#x80FD;&#x8BF4;&#x5168;&#x662F;&#x4F60;&#x4EEC;&#x7684;&#x9519;&#xFF0C;&#x8DDF;&#x56FD;&#x5BB6;&#x7684;&#x653F;&#x7B56;&#x6CA1;&#x6709;&#x8DDF;&#x4E0A;&#x53BB;&#x4E5F;&#x6709;&#x5F88;&#x5927;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x76F8;&#x8F83;&#x4E8E;&#x7F8E;&#x56FD;&#xFF0C;&#x4ED6;&#x4EEC;&#x5728;&#x8FD9;&#x65B9;&#x9762;&#x505A;&#x7684;&#x771F;&#x7684;&#x6BD4;&#x56FD;&#x5185;&#x597D;&#x3002;&#x73B0;&#x5728;&#x56FD;&#x5185;&#x73A9;&#x5BB6;&#x7684;&#x7D20;&#x8D28;&#x4E5F;&#x90FD;&#x8DDF;&#x4E0A;&#x53BB;&#x4E86;&#xFF0C;&#x5230;steam&#x4E0A;&#x4E70;&#x6B63;&#x7248;&#x6E38;&#x620F;&#x7684;&#x73A9;&#x5BB6;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x4F7F;&#x7528;&#x76D7;&#x7248;&#x7684;&#x4E5F;&#x5728;&#x9010;&#x6E10;&#x51CF;&#x5C11;&#xFF0C;&#x7F51;&#x7EDC;&#x6536;&#x8D39;&#x6B63;&#x5728;&#x6210;&#x4E3A;&#x4E00;&#x80A1;&#x6F6E;&#x6D41;&#x5E2D;&#x5377;&#x4E2D;&#x56FD;&#x7F51;&#x7EDC;&#x3002;&#x6240;&#x4EE5;&#x4E3A;&#x4E86;&#x827E;&#x6CFD;&#x62C9;&#x65AF;&#x8FD9;&#x4E2A;&#x7F8E;&#x4E3D;&#x7684;&#x4E16;&#x754C;&#xFF0C;&#x4F60;&#x727A;&#x7272;&#x4E00;&#x4E9B;&#x70B9;&#x5361;&#x53C8;&#x7B97;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;</p>
<p>&#x9B54;&#x517D;&#x771F;&#x7684;&#x6709;&#x597D;&#x591A;&#x4E0D;&#x540C;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x653E;&#x4E0B;&#x90A3;&#x4E9B;&#x4E00;&#x76F4;&#x4EE5;&#x6765;&#x517B;&#x6210;&#x7684;&#x601D;&#x7EF4;&#x5B9A;&#x5F0F;&#x6765;&#x89C2;&#x5BDF;&#x8FD9;&#x4E2A;&#x6E38;&#x620F;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#xFF0C;&#x5E26;&#x7ED9;&#x6211;&#x4EEC;&#x7684;&#xFF0C;&#x662F;&#x5F88;&#x591A;&#x96BE;&#x4EE5;&#x5BDF;&#x89C9;&#x4E5F;&#x96BE;&#x4EE5;&#x53D1;&#x89C9;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x81F3;&#x5C11;&#xFF0C;&#x4F60;&#x62E5;&#x6709;&#x7684;&#x5173;&#x4E8E;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x7684;&#x56DE;&#x5FC6;&#xFF0C;&#x90A3;&#x662F;&#x5728;&#x522B;&#x7684;&#x5730;&#x65B9;&#x4E5F;&#x65E0;&#x6CD5;&#x53D1;&#x89C9;&#x7684;&#x3002;&#x6211;&#x76F8;&#x4FE1;&#x5F88;&#x591A;&#x73A9;&#x5BB6;&#x90FD;&#x66FE;&#x5728;&#x6253;&#x5012;&#x5DEB;&#x5996;&#x738B;&#x7684;&#x77AC;&#x95F4;&#x622A;&#x56FE;&#x7559;&#x604B;&#xFF1B;&#x6211;&#x76F8;&#x4FE1;&#x4F60;&#x53EA;&#x8981;&#x7ECF;&#x5386;&#x8FC7;&#x5C31;&#x4E0D;&#x4F1A;&#x5FD8;&#x8BB0;&#x7B2C;&#x4E00;&#x6B21;&#x5728;&#x526F;&#x672C;&#x91CC;&#x8FBE;&#x5230;&#x5750;&#x9A91;&#x7684;&#x559C;&#x60A6;&#xFF1B;&#x6211;&#x76F8;&#x4FE1;&#x6BCF;&#x4E2A;&#x73A9;&#x5BB6;&#x5FC3;&#x4E2D;&#x90FD;&#x6709;&#x90A3;&#x4E48;&#x4E00;&#x6BB5;&#x8BB0;&#x5FC6;&#xFF0C;&#x90A3;&#x6BB5;&#x8BB0;&#x5FC6;&#x662F;&#x548C;&#x5DE5;&#x4F1A;&#x91CC;&#x5144;&#x5F1F;&#x59D0;&#x59B9;&#x53BB;&#x5237;&#x88C5;&#x5907;&#x800C;&#x6B7B;&#x6D3B;&#x5237;&#x4E0D;&#x51FA;&#x6765;&#x7684;&#x8BB0;&#x5FC6;&#xFF0C;&#x8FD9;&#x6BB5;&#x8BB0;&#x5FC6;&#x4E5F;&#x8BB8;&#x5C31;&#x662F;&#x9B54;&#x517D;&#x5E26;&#x7ED9;&#x4F60;&#x7684;&#x6700;&#x5927;&#x7684;&#x5B9D;&#x85CF;&#x3002;&#x8FD8;&#x662F;&#x90A3;&#x53E5;&#x8BDD;&#xFF0C;&#x9B54;&#x517D;&#xFF0C;&#x5B83;&#x7ED9;&#x4F60;&#x7684;&#x4E0D;&#x53EA;&#x662F;&#x6E38;&#x620F;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x4E2A;&#x4E16;&#x754C;&#x3002;</p>
<p>&#x5728;&#x674E;&#x6BC5;&#x6CA1;&#x6709;&#x706B;&#x4E4B;&#x524D;&#xFF0C;wow&#x5427;&#x4E00;&#x76F4;&#x662F;&#x8D34;&#x5427;&#x91CC;&#x6700;&#x5927;&#x5427;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x6B3E;&#x73B0;&#x8C61;&#x7EA7;&#x7684;&#x7F51;&#x7EDC;&#x6E38;&#x620F;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x7F51;&#x7EDC;&#x6E38;&#x620F;&#x884D;&#x751F;&#x51FA;&#x7684;&#x7EBF;&#x4E0A;&#x793E;&#x533A;&#xFF0C;WOW&#x8FD9;&#x4E09;&#x4E2A;&#x5B57;&#x6BCD;&#x627F;&#x8F7D;&#x4E86;&#x592A;&#x591A;&#x4EBA;&#x7684;&#x559C;&#x6012;&#x54C0;&#x4E50;&#x3002;</p>
<hr>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x201C;&#x5DE5;&#x4F1A;&#x201D;&#x7684;&#x6982;&#x5FF5;&#x8D85;&#x8D8A;&#x7EBF;&#x4E0A;&#x7684;&#x6E38;&#x620F;</p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5C06;&#x201C;&#x9635;&#x8425;&#x201D;&#x7684;&#x6982;&#x5FF5;&#x6F14;&#x53D8;&#x6210;&#x90E8;&#x5206;&#x4EBA;&#x4FE1;&#x4EF0;&#x7684;&#x6E38;&#x620F;</p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x62E5;&#x6709;&#x5E9E;&#x5927;&#x771F;&#x5B9E;&#x7684;&#x4E16;&#x754C;&#x8BBE;&#x5B9A;&#x3001;&#x62E5;&#x6709;&#x5B8C;&#x6574;&#x7684;&#x795E;&#x8BDD;&#x4F53;&#x7CFB;&#x7684;&#x6E38;&#x620F;</p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x8D44;&#x6599;&#x7247;&#x66F4;&#x65B0;&#x8DF3;&#x7968;&#x4E00;&#x5E74;&#x4ECD;&#x9760;&#x4E00;&#x4E2A;&#x5E16;&#x5B50;&#x70B8;&#x51FA;&#x51E0;&#x5341;&#x4E07;&#x73A9;&#x5BB6;&#x7684;&#x6E38;&#x620F;</p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4EE3;&#x4EBA;&#x5173;&#x4E8E;&#x201C;&#x7F51;&#x7EDC;&#x201D;&#x548C;&#x201C;&#x9752;&#x6625;&#x201D;&#x7684;&#x8BB0;&#x5FC6;&#x6807;&#x7B7E;&#x3002;</p>
<hr>
<p>&#x6211;&#x5F88;&#x540E;&#x6094;&#x6211;&#x6CA1;&#x80FD;&#x5728;&#x9B54;&#x517D;&#x6700;&#x597D;&#x7684;&#x65F6;&#x5149;&#x53BB;&#x4F53;&#x9A8C;&#x5B83;&#xFF0C;&#x6211;&#x5F88;&#x5E86;&#x5E78;&#x81EA;&#x5DF1;&#x5728;&#x9B54;&#x517D;&#x6B63;&#x5F0F;&#x8870;&#x843D;&#x4E4B;&#x524D;&#x63A5;&#x89E6;&#x4E86;&#x5B83;&#xFF0C;&#x9B54;&#x517D;&#x4E16;&#x754C;&#xFF0C;&#x597D;&#x50CF;&#x771F;&#x7684;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x4E16;&#x754C;&#x3002;</p>
<ul>
<li>&#x4E00;&#x5165;&#x9B54;&#x517D;&#x95E8;&#xFF0C;&#x65E0;&#x6094;&#x4EBA;&#x751F;&#x6E38;&#x3002;</li>
</ul>
<p>&#x6211;&#x6562;&#x8BF4;&#xFF0C;&#x5C06;&#x6765;&#x5982;&#x679C;&#x771F;&#x7684;&#x6709;&#x4E00;&#x5929;&#x9B54;&#x517D;&#x8981;&#x5173;&#x95ED;&#x670D;&#x52A1;&#x5668;&#x4E86;&#xFF0C;&#x90A3;&#x4E00;&#x5929;&#x7EDD;&#x5BF9;&#x662F;&#x66B4;&#x96EA;&#x706D;&#x4EA1;&#x7684;&#x4E00;&#x5929;.</p>
<p>&#x6211;&#x4EEC;&#x9B54;&#x517D;&#x73A9;&#x5BB6;&#x4E00;&#x76F4;&#x90FD;&#x62E5;&#x6709;&#x7740;&#x4E24;&#x4E2A;&#x4E16;&#x754C;.</p>

      
    </div><!-- .entry-content -->

    <footer class="entry-meta">
    <a href="/2016/03/19/魔兽十年-永不长眠/">
    <time datetime="2016-03-18T16:00:00.000Z" class="entry-date">
        2016-03-19
    </time>
</a>
    
  <span class="article-delim">&#8226;</span>
  <div class="article-category">
  <a class="article-category-link" href="/categories/御宅文化/">御宅文化</a>
  </div>

    
    </footer>
</article>


    
<nav class="nav-single">
    <h3 class="assistive-text">文章导航</h3>
    
        <span class="nav-previous"><a href="/2016/06/26/hello-world/" rel="prev"><span class="meta-nav">←</span> Hello World</a></span>
    
    
</nav><!-- .nav-single -->







</div></div>
        <div id="secondary" class="widget-area" role="complementary">
  
    <aside id="search" class="widget widget_search"><form role="search" method="get" accept-charset="utf-8" id="searchform" class="searchform" action="//google.com/search">
    <div>
        <input type="text" value="" name="s" id="s" />
        <input type="submit" id="searchsubmit" value="搜索" />
    </div>
</form></aside>
  
    
  
    
  <aside class="widget">
    <h3 class="widget-title">Categories</h3>
    <div class="widget-content">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/LIFE/">LIFE</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/MAC/">MAC</a><span class="category-list-count">2</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/iOS/">iOS</a><span class="category-list-count">7</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/御宅文化/">御宅文化</a><span class="category-list-count">2</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/编程/">编程</a><span class="category-list-count">17</span></li></ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Recents</h3>
    <div class="widget-content">
      <ul>
        
          <li>
            <a href="/2016/09/28/HTML-文本/">HTML-文本</a>
          </li>
        
          <li>
            <a href="/2016/09/26/用栈解决进制转换/">用栈解决进制转换</a>
          </li>
        
          <li>
            <a href="/2016/09/25/栈基础函数C语言实现/">栈基础函数C语言实现</a>
          </li>
        
          <li>
            <a href="/2016/09/24/栈，队列，数组/">栈，队列，数组</a>
          </li>
        
          <li>
            <a href="/2016/09/23/素数筛C-实现/">素数筛C++实现</a>
          </li>
        
      </ul>
    </div>
  </aside>

  
    
  <aside class="widget">
    <h3 class="widget-title">Tags</h3>
    <div class="widget-content">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/Cocoapods/">Cocoapods</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/HTML/">HTML</a><span class="tag-list-count">2</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Matlab/">Matlab</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIColor/">UIColor</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView/">UIView</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/UIView-圆角/">UIView-圆角</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/bug/">bug</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/hexo/">hexo</a><span class="tag-list-count">4</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/指针/">指针</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/数据结构/">数据结构</a><span class="tag-list-count">4</span></li></ul>
    </div>
  </aside>

  
    
<div class="widget tag">
<h3 class="title">blogroll</h3>
<ul class="entry">


<li><a href="https://github.com/" target="_blank">github</a></li>


<li><a href="http://www.jianshu.com/users/41cd7711ed44/latest_articles" target="_blank">我的简书主页</a></li>

</ul>
</div>

  
</div>
      </div>
      <footer id="colophon" role="contentinfo">
    <p>&copy; 2016 SaberDa
    All rights reserved.</p>
    <p>Powered by <a href="http://hexo.io/" target="_blank">Hexo</a></p>
</footer>
    <script>window._bd_share_config={"common":{"bdSnsKey":{},"bdText":"","bdMini":"1","bdMiniList":false,"bdPic":"","bdStyle":"2","bdSize":"16"},"share":{}};with(document)0[(getElementsByTagName('head')[0]||body).appendChild(createElement('script')).src='http://bdimg.share.baidu.com/static/api/js/share.js?v=89860593.js?cdnversion='+~(-new Date()/36e5)];</script>

<script src="/js/jquery-2.0.3.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

<script src="/js/navigation.js"></script>

<div id="bg"></div>

  </div>
</body>
</html>